# Default (English) exception messages.
#
# See XQuery*Exception.java for Java-language codes corresponding to these
# QNames.

########## Standard dynamic exceptions ########################################

err\:XPDY0002="{0}": valor do contexto din\u00E2mico n\u00E3o definido
err\:XQDY0025="{0}": atributo duplicado
err\:XQDY0026=N\u00E3o \u00E9 poss\u00EDvel que a instru\u00E7\u00E3o de processamento contenha "?>"
err\:XQDY0027=Falha na valida\u00E7\u00E3o: {0}
err\:XQST0040="{0}": atributo duplicado
err\:XQDY0041=N\u00E3o \u00E9 poss\u00EDvel converter no NCName: {0}
err\:XQDY0044=nome de atributo ilegal
err\:XPDY0050=O tipo din\u00E2mico n\u00E3o corresponde ao tipo especificado pela express\u00E3o de tratamento: {0}
err\:XQDY0061=Conte\u00FAdo do n\u00F3 do documento ilegal
err\:XQDY0062=Restri\u00E7\u00E3o do n\u00F3 do conte\u00FAdo n\u00E3o satisfeita
err\:XQDY0064=N\u00E3o \u00E9 poss\u00EDvel que o nome da instru\u00E7\u00E3o de processamento calculada seja "XML"
err\:XQDY0072=N\u00E3o \u00E9 poss\u00EDvel que o coment\u00E1rio calculado contenha "--" ou termine em "-"
err\:XQDY0074=N\u00E3o \u00E9 poss\u00EDvel expandir QName: {0}
err\:XQDY0084=N\u00E3o \u00E9 poss\u00EDvel encontrar o elemento "{0}" atrav\u00E9s da utiliza\u00E7\u00E3o de declara\u00E7\u00F5es do tipo de elemento dentro do \u00E2mbito
err\:XQDY0096=O nome fornecido ao criador de elementos calculados n\u00E3o \u00E9 v\u00E1lido
err\:FOAR0001=Dividir por zero
err\:FOAR0002="{0}": excesso/insufici\u00EAncia de dados num\u00E9ricos
err\:FOCA0001="{0}": n\u00E3o \u00E9 poss\u00EDvel converter em decimal
err\:FOCA0002="{0}": valor lexical incorreto
err\:FOCA0004="{0}": n\u00E3o \u00E9 poss\u00EDvel converter em n\u00FAmeros inteiros
err\:FOCA0005=NaN foi fornecido para valor flutuante/duplo
err\:FOCH0001=Ponto de c\u00F3digo incorreto: {0}
err\:FOCH0002="{0}": ordena\u00E7\u00E3o n\u00E3o suportada
err\:FOCH0003="{0}": formato de normaliza\u00E7\u00E3o n\u00E3o suportado
err\:FOCH0004="{0}": ordena\u00E7\u00E3o inadequada para esta fun\u00E7\u00E3o
err\:FODC0001=Sem documento de contexto
err\:FODC0002=Erro na obten\u00E7\u00E3o do recurso "{0}": {1}
err\:FODC0004="{0}": argumento inv\u00E1lido para fn:collection()
err\:FODC0005="{0}": argumento inv\u00E1lido para fn:doc()
err\:FODT0001=Excesso de dados na aritm\u00E9tica de data/hora
err\:FODT0002=Excesso/insufici\u00EAncia de dados na opera\u00E7\u00E3o de dura\u00E7\u00E3o
err\:FODT0003="{0}": fuso hor\u00E1rio inv\u00E1lido
err\:FOER0000=Erro n\u00E3o identificado
err\:FONS0003="{0}": prefixo n\u00E3o definido em contexto est\u00E1tico
err\:FONS0004="{0}": namespace n\u00E3o encontrado para este prefixo
err\:FONS0005=O URI de base n\u00E3o foi definido
err\:FORG0001="{0}": valor inv\u00E1lido para convers\u00E3o/criador: {1}
err\:FORG0002="{0}": argumento inv\u00E1lido para fn:resolve-uri()
err\:FORG0003=eram esperados zero itens ou um item, foram recebidos dois ou mais itens
err\:FORG0004=eram esperados um ou v\u00E1rios itens, foram recebidos zero itens
err\:FORG0005=era esperado exatamente um item, foram recebidos {0} itens
err\:FORG0006="{0}": Tipo de argumento inv\u00E1lido
err\:FORG0008=Ambos os argumentos de fn:dateTime t\u00EAm um fuso hor\u00E1rio especificado: "{0}" e "{1}"
err\:FORG0009=fn:resolve-uri() foi chamado com URI de base n\u00E3o absoluto "{0}"
err\:FORX0001=Indicadores de express\u00E3o regular inv\u00E1lida
err\:FORX0002="{0}": express\u00E3o regular inv\u00E1lida
err\:FORX0003=A express\u00E3o regular corresponde a uma cadeia de caracteres de comprimento zero: "{0}"
err\:FORX0004="{0}": cadeia de caracteres de substitui\u00E7\u00E3o inv\u00E1lida
err\:FOTY0011=O item de contexto n\u00E3o \u00E9 um n\u00F3

########## Oracle-specific dynamic exceptions ####################################

ora-err\:TBDDYNAMIC=TBD DYNAMIC: {0}
ora-err\:XPDY0002a=\u00C9 necess\u00E1rio um item de contexto, mas n\u00E3o foi definido (ou falta '$' antes do nome de uma vari\u00E1vel)
ora-err\:XPDY0002b="{0}": vari\u00E1vel externa n\u00E3o associada
ora-err\:XPDY0002c="{0}": URI de documento inv\u00E1lido
ora-err\:XQDY0027a=O atributo "{0}" n\u00E3o foi encontrado para valida\u00E7\u00E3o
ora-err\:XQDY0027b=O elemento "{0}" n\u00E3o foi encontrado para valida\u00E7\u00E3o
ora-err\:ENT001=N\u00E3o \u00E9 poss\u00EDvel decifrar o URI "{0}": Esquema desconhecido
ora-err\:FODC0002a=Erro durante a an\u00E1lise do XML de entrada de dados "{0}" {1}
ora-err\:FODC0002b=Erro durante a an\u00E1lise do XML de entrada de dados: S\u00F3 \u00E9 poss\u00EDvel utilizar um cursor de StAX uma vez
ora-err\:FODC0002c=Recolha por omiss\u00E3o n\u00E3o definida
ora-err\:FO0001="{0}": argumento inv\u00E1lido para a fun\u00E7\u00E3o {1}
ora-err\:FO0002="{0}": n\u00E3o est\u00E1 no formato esperado {1}
ora-err\:NS0001="{0}": o prefixo j\u00E1 est\u00E1 associado a {1}
ora-err\:FOUD0001=O procedimento {0} foi invocado com uma entrada de dados incompleta"
ora-err\:MEM0001=O pedido requer {0} operadores geridos pela mem\u00F3ria, mas existem apenas {1} dispon\u00EDveis

########## Standard static exceptions #########################################

err\:FONC0001=item de contexto n\u00E3o definido
err\:XPST0001="{0}": valor do contexto est\u00E1tico n\u00E3o definido
err\:XPST0003=Express\u00E3o inv\u00E1lida: {0}
err\:XPST0005=N\u00E3o \u00E9 poss\u00EDvel atribuir um tipo que esteja vazio
err\:XPST0008=O nome "{0}" n\u00E3o foi encontrado no contexto est\u00E1tico
err\:XPST0051="{0}": tipo n\u00E3o definido ou n\u00E3o at\u00F3mico
err\:XQST0009=A funcionalidade de importa\u00E7\u00E3o do schema n\u00E3o \u00E9 suportada
err\:XPST0010=A funcionalidade de eixo integral n\u00E3o \u00E9 suportada
err\:XQST0012=Schema inv\u00E1lido {0}. {1}
err\:XQST0013=O conte\u00FAdo do pragma \u00E9 inv\u00E1lido. {0}
err\:XQST0014=O conte\u00FAdo da extens\u00E3o \u00E9 inv\u00E1lido. {0}
err\:XQST0016=A funcionalidade de m\u00F3dulo n\u00E3o \u00E9 suportada
err\:XPST0017="{0}": fun\u00E7\u00E3o desconhecida (ou o n\u00FAmero de argumentos ({1}) est\u00E1 incorreto) {2}
err\:XQST0022=\u00C9 necess\u00E1rio que o atributo da declara\u00E7\u00E3o do namespace seja um literal de cadeia de caracteres
err\:XQST0031="{0}": vers\u00E3o n\u00E3o suportada
err\:XQST0032="{0}": declara\u00E7\u00E3o de URI de base em duplicado
err\:XQST0033="{0}": declara\u00E7\u00E3o de prefixo de namespace em duplicado
err\:XQST0034="{0}": fun\u00E7\u00E3o j\u00E1 declarada ou importada
err\:XQST0035="{0}": nome importado anteriormente
err\:XQST0038="{0}": ordena\u00E7\u00F5es desconhecidas ou v\u00E1rias ordena\u00E7\u00F5es
err\:XQST0039="{0}": nome de par\u00E2metro da fun\u00E7\u00E3o em duplicado
err\:XQST0045=A fun\u00E7\u00E3o "{0}" foi declarada no namespace reservado: "{1}"
err\:XQST0046="{0}": URI ilegal
err\:XQST0047="{0}": namespace de destino em duplicado
err\:XQST0048="{0}": \u00E9 necess\u00E1rio que o nome esteja no namespace de destino do m\u00F3dulo: "{1}"
err\:XQST0049="{0}": nome da vari\u00E1vel em duplicado
err\:XQST0054=A declara\u00E7\u00E3o de "{0}" tem uma express\u00E3o de inicializa\u00E7\u00E3o que depende direta ou indiretamente de "{0}": ({1})
err\:XQST0055=V\u00E1rias declara\u00E7\u00F5es de copy-namespaces
err\:XQST0056="{0}": namespace de destino utilizado pelo m\u00F3dulo de importa\u00E7\u00E3o
err\:XQST0057=N\u00E3o \u00E9 poss\u00EDvel que uma importa\u00E7\u00E3o do schema associe um prefixo quando o namespace est\u00E1 vazio
err\:XQST0058="{0}": namespace de destino em duplicado
err\:XQST0059=N\u00E3o foi poss\u00EDvel encontrar o schema ou o m\u00F3dulo
err\:XQST0060="{0}": n\u00E3o \u00E9 poss\u00EDvel que o nome da fun\u00E7\u00E3o tenha o namespace vazio
err\:XQST0065=V\u00E1rias declara\u00E7\u00F5es de ordena\u00E7\u00E3o por omiss\u00E3o
err\:XQST0066=V\u00E1rias declara\u00E7\u00F5es de namespace de elemento/tipo/fun\u00E7\u00E3o por omiss\u00E3o
err\:XQST0067=V\u00E1rias declara\u00E7\u00F5es de cria\u00E7\u00E3o por omiss\u00E3o
err\:XQST0068=V\u00E1rias declara\u00E7\u00F5es de boundary-space
err\:XQST0069=N\u00E3o \u00E9 poss\u00EDvel que o prolog da consulta contenha mais de uma declara\u00E7\u00E3o de ordem vazia.
err\:XQST0070=Declara\u00E7\u00E3o de namespace inv\u00E1lida.
err\:XQST0071="{0}": atributo da declara\u00E7\u00E3o do namespace em duplicado
err\:XQST0075=A funcionalidade de valida\u00E7\u00E3o n\u00E3o \u00E9 suportada
err\:XQST0076="{0}": ordena\u00E7\u00E3o desconhecida
err\:XQST0077="{0}": pragma desconhecido
err\:XQST0078="{0}": op\u00E7\u00E3o desconhecida
err\:XQST0079=Extens\u00E3o inv\u00E1lida. {0}
err\:XPST0080=O tipo de destino de uma express\u00E3o de convers\u00E3o ou convert\u00EDvel \u00E9 xs:NOTATION ou xs:anyAtomicType
err\:XPST0081=N\u00E3o \u00E9 poss\u00EDvel decifrar o prefixo "{0}" utilizado no nome qualificado "{1}"
err\:XQST0085=Declara\u00E7\u00E3o de namespace vazia para o prefixo : "{0}"
err\:XQST0087=A codifica\u00E7\u00E3o "{0}" na declara\u00E7\u00E3o da vers\u00E3o n\u00E3o \u00E9 v\u00E1lida
err\:XQST0088=Namespace de destino vazio ilegal na declara\u00E7\u00E3o ou importa\u00E7\u00E3o do m\u00F3dulo
err\:XQST0089=A vari\u00E1vel "{0}" associada numa cl\u00E1usula tem o mesmo QName expandido que a respetiva vari\u00E1vel posicional associada
err\:XQST0090=O valor "{0}" n\u00E3o \u00E9 um refer\u00EAncia do car\u00E1cter v\u00E1lido em XML 1.0
err\:XQST0093=Importa\u00E7\u00F5es de m\u00F3dulos circulares. A declara\u00E7\u00E3o de "{0}" tem uma express\u00E3o de inicializa\u00E7\u00E3o que depende direta ou indiretamente de "{0}": ({1})

########## Oracle-specific static exceptions #####################################

ora-err\:XPST0003a=N\u00E3o correspond\u00EAncia do identificador de fim de XML: "{1}" n\u00E3o corresponde a "{0}"
ora-err\:XPST0003b=Utiliza\u00E7\u00E3o ilegal da express\u00E3o "{0}". {1}
ora-err\:XPST0003c=Erro de sintaxe. "{0}" inesperado
ora-err\:XPST0003d=Erro de sintaxe
ora-err\:XPST0005a=O teste do n\u00F3 "{0}" n\u00E3o corresponde a nenhum n\u00F3 da respetiva sequ\u00EAncia de entrada de dados do tipo: {1}
ora-err\:XPST0008a=A vari\u00E1vel "${0}" foi utilizada, mas n\u00E3o foi declarada
ora-err\:XPST0017a="{0}": fun\u00E7\u00E3o externa n\u00E3o associada. {1}
ora-err\:XQST0059a=N\u00E3o foi poss\u00EDvel encontrar o schema em XML {0}. {1}
ora-err\:XQST0059b=N\u00E3o foi poss\u00EDvel encontrar o m\u00F3dulo de biblioteca {0}. {1}
ora-err\:XQST0059c=Schema em XML inv\u00E1lido {0}. {1}
ora-err\:XQST0059d=M\u00F3dulo de biblioteca inv\u00E1lido {0}. {1}
ora-err\:EXT0001="{0}" n\u00E3o \u00E9 um pragma reconhecido
ora-err\:EXT0002=S\u00F3 \u00E9 poss\u00EDvel utilizar o pragma "{0}" num criador de n\u00F3s de atributos ou de elementos
ora-err\:FUNC002=Utiliza\u00E7\u00E3o ilegal do procedimento de efeitos secund\u00E1rios {0} com aridade {1}. N\u00E3o \u00E9 poss\u00EDvel invocar procedimentos de efeitos secund\u00E1rios a partir de um contexto sem efeitos secund\u00E1rios
ora-err\:FUNC003=Foi encontrada uma chamada de fun\u00E7\u00E3o, cujos resultados est\u00E3o a ser exclu\u00EDdos
ora-err\:VAR002="${0}": vari\u00E1vel n\u00E3o inicializada

########## Oracle-specific system exceptions #####################################

ora-err\:TBDSYSTEM=TBD SYSTEM: {0}
ora-err\:SYS001=Esta funcionalidade n\u00E3o foi implementada. {0}
ora-err\:SYS002=Foi detetada uma exce\u00E7\u00E3o de biblioteca: 
ora-err\:SYS003=Exce\u00E7\u00E3o inesperada
ora-err\:SYS004=Interrup\u00E7\u00E3o de runtime
ora-err\:SYS005=Consulta terminada a pedido do utilizador
ora-err\:SYS006=A fun\u00E7\u00E3o \u00E9 {0} recursiva; esta opera\u00E7\u00E3o n\u00E3o \u00E9 suportada.
ora-err\:SYS007=Configura\u00E7\u00E3o de contexto inv\u00E1lida.
ora-err\:SYS008=URI de contexto em duplicado {0}
ora-err\:SYS009=A tentar associar a fun\u00E7\u00E3o externa {0} \u00E0 aridade {1}, mas n\u00E3o \u00E9 poss\u00EDvel encontrar esta fun\u00E7\u00E3o
ora-err\:SYS010=Consulta terminada a pedido do administrador
ora-err\:SYS011=Consulta terminada devido a tempo de espera especificado pelo utilizador
ora-err\:SYS012=Consulta terminada devido a tempo de espera da transa\u00E7\u00E3o
ora-err\:SYS013=A transa\u00E7\u00E3o (xid={0}) foi anulada.
ora-err\:SYS014=Refer\u00EAncia de entidade n\u00E3o expandida no DOM
ora-err\:SYS015=Entrada de dados ilegal: \u00C9 necess\u00E1rio que os n\u00F3s de DOM reconhe\u00E7am o namespace. Se estiver a utilizar um analisador de DOM, certifique-se de que a propriedade de reconhecimento do namespace est\u00E1 definida como "true" (consulte javax.xml.parsers.DocumentBuilderFactory#setNamespaceAware(boolean)). Se estiver a criar o DOM atrav\u00E9s da utiliza\u00E7\u00E3o de m\u00E9todos de cria\u00E7\u00E3o, certifique-se de que s\u00E3o utilizadas as vers\u00F5es de reconhecimento do namespace dos m\u00E9todos (por exemplo, org.w3c.dom.Document#createElementNS(String, String)) 
ora-err\:SYS016=\u00C9 necess\u00E1rio que os n\u00F3s de DOM sejam compar\u00E1veis. org.w3c.dom.Node.compareDocumentPosition(.) devolveu "{0}" para os n\u00F3s "{1}" e "{2}" 
ora-err\:SYS017=O PageManagerPool de SDOM em modo Lazy n\u00E3o est\u00E1 definido
ora-err\:SYS018=A renomea\u00E7\u00E3o de um n\u00F3 de instru\u00E7\u00E3o de processamento de DOM n\u00E3o \u00E9 suportada
ora-err\:SYS019=As implementa\u00E7\u00F5es de DOM nas quais org.w3c.dom.Document.renameNode(...) cria um novo n\u00F3 n\u00E3o s\u00E3o suportadas para express\u00F5es de renomea\u00E7\u00E3o da Atualiza\u00E7\u00E3o de XQuery
ora-err\:SYS020=A declara\u00E7\u00E3o da op\u00E7\u00E3o {0} := "{1}" \u00E9 inv\u00E1lida
ora-err\:SYS021=Ocorr\u00EAncia de erro na avalia\u00E7\u00E3o da consulta din\u00E2mica: {0}.
ora-err\:SYS022=Tipo de suporte n\u00E3o suportado ou inv\u00E1lido: {0}
ora-err\:SYS023=Perfil de l\u00EDngua inv\u00E1lido: {0}
ora-err\:SYS024=Foram devolvidos dados inv\u00E1lidos a partir da implementa\u00E7\u00E3o da SPI fornecida pelo programador. {0}
ora-err\:SYS025=A associa\u00E7\u00E3o de DOM especificada n\u00E3o \u00E9 v\u00E1lida. N\u00E3o \u00E9 poss\u00EDvel modelar os n\u00F3s de DOM Entity, Notation, EntityReference e DocumentType como XDM
ora-err\:SYS026=A associa\u00E7\u00E3o de DOM especificada n\u00E3o \u00E9 v\u00E1lida. N\u00E3o \u00E9 poss\u00EDvel associar n\u00F3s Text e CDATASection vazios, a n\u00E3o ser que n\u00E3o tenham nenhum pai
ora-err\:SYS027=A associa\u00E7\u00E3o de DOM especificada n\u00E3o \u00E9 v\u00E1lida. N\u00E3o \u00E9 poss\u00EDvel associar um n\u00F3 Text se este tiver um irm\u00E3o adjacente que tamb\u00E9m seja Text
ora-err\:SYS028=A associa\u00E7\u00E3o de DOM especificada n\u00E3o \u00E9 v\u00E1lida. \u00C9 necess\u00E1rio que a implementa\u00E7\u00E3o suporte DOM n\u00EDvel 3 (Core e XML)
ora-err\:SYS029=A declara\u00E7\u00E3o da op\u00E7\u00E3o "{0}" n\u00E3o \u00E9 reconhecida
ora-err\:SYS030=O valor "{1}" n\u00E3o \u00E9 suportado para a declara\u00E7\u00E3o da op\u00E7\u00E3o {0}
ora-err\:SYS031=\u00C9 necess\u00E1rio especificar o nome da classe atrav\u00E9s da utiliza\u00E7\u00E3o da op\u00E7\u00E3o {0} para as associa\u00E7\u00F5es de fun\u00E7\u00F5es de Java
ora-err\:SYS032=N\u00E3o foi poss\u00EDvel encontrar o nome da classe especificado: {0}
ora-err\:SYS033=N\u00E3o foi poss\u00EDvel colocar em inst\u00E2ncias a classe especificada: {0}
ora-err\:SYS034=Ocorr\u00EAncia de erro na inicializa\u00E7\u00E3o de argumentos na chamada de fun\u00E7\u00E3o {0}
ora-err\:SYS035=Ocorr\u00EAncia de erro na tentativa de invoca\u00E7\u00E3o do m\u00E9todo est\u00E1tico definido pelo utilizador{0} : {1}
ora-err\:SYS036=Ocorr\u00EAncia de erro no processamento do resultado de um m\u00E9todo est\u00E1tico definido pelo utilizador {0} : {1}
ora-err\:SYS037=\u00C9 necess\u00E1rio que a fun\u00E7\u00E3o decifrada definida pelo utilizador {0} alargue {1}
ora-err\:SYS038=Ocorr\u00EAncia de erro na tentativa de decifra\u00E7\u00E3o da fun\u00E7\u00E3o {0}. {1}
ora-err\:SYS039=Para a fun\u00E7\u00E3o {0}, o decifrador de entidades devolveu um tipo de associa\u00E7\u00E3o de fun\u00E7\u00F5es n\u00E3o suportado: "{1}"
ora-err\:SYS040=Esta consulta foi preparada para an\u00E1lise est\u00E1tica apenas e n\u00E3o \u00E9 poss\u00EDvel execut\u00E1-la
ora-err\:SYS041=A fun\u00E7\u00E3o fn:put n\u00E3o est\u00E1 ativada
ora-err\:SYS042=N\u00E3o \u00E9 poss\u00EDvel encontrar o m\u00E9todo Java que corresponde \u00E0 assinatura da fun\u00E7\u00E3o XQuery fornecida (n\u00E3o correspond\u00EAncia de nome, par\u00E2metro ou tipo de retorno)
ora-err\:SYS043=N\u00E3o \u00E9 poss\u00EDvel encontrar o m\u00E9todo especificado"{0}" da classe "{1}"
ora-err\:SYS044=Tipo de suporte inv\u00E1lido: {0}
ora-err\:SYS045=A entidade do documento \u00E9 inv\u00E1lida: {0}
ora-err\:SYS046=Erro do depurador: {0}
ora-err\:SYS047=N\u00E3o \u00E9 poss\u00EDvel efetuar a opera\u00E7\u00E3o, porque a inst\u00E2ncia est\u00E1 fechada
ora-err\:SYS048=N\u00E3o \u00E9 poss\u00EDvel invocar um m\u00F3dulo de biblioteca diretamente neste contexto. \u00C9 necess\u00E1rio um m\u00F3dulo principal com um corpo de consulta
ora-err\:SYS049=N\u00E3o correspond\u00EAncia do modo de processamento entre uma consulta e um m\u00F3dulo de biblioteca ou entre dois m\u00F3dulos de biblioteca.
ora-err\:SYS050=Acesso recusado. As atualiza\u00E7\u00F5es n\u00E3o est\u00E3o ativadas
ora-err\:SYS051=As atualiza\u00E7\u00F5es n\u00E3o s\u00E3o suportadas para este tipo de origem de dados
ora-err\:SYS052=\u00C9 necess\u00E1rio que as associa\u00E7\u00F5es de SAX suportem a funcionalidade de namespaces
ora-err\:SYS053=N\u00E3o \u00E9 poss\u00EDvel atualizar em simult\u00E2neo duas origens de dados que referenciam os mesmos dados f\u00EDsicos subjacentes. Por exemplo, esta situa\u00E7\u00E3o poder\u00E1 ocorrer se a mesma inst\u00E2ncia de DOM for associada \u00E0 consulta v\u00E1rias vezes
ora-err\:SYS054=A cadeia de caracteres de consulta que faz parte do URI de ordena\u00E7\u00E3o n\u00E3o \u00E9 v\u00E1lida: {0}
ora-err\:SYS055=O ordenador especificado n\u00E3o suporta opera\u00E7\u00F5es de subcadeias de caracteres
ora-err\:SYS056=URI relativo inesperado: {0}
ora-err\:SYS057=\u00C9 necess\u00E1rio que os URIs do documento devolvidos para a recolha sejam exclusivos: {0}
ora-err\:SYS058=A configura\u00E7\u00E3o da convers\u00E3o de conjuntos de informa\u00E7\u00F5es n\u00E3o \u00E9 suportada. Atualmente, a manuten\u00E7\u00E3o de espa\u00E7o em branco insignificante em simult\u00E2neo com a exclus\u00E3o de espa\u00E7o em branco significativo n\u00E3o \u00E9 suportada.
ora-err\:SYS059=A associa\u00E7\u00E3o de DOM especificada n\u00E3o \u00E9 v\u00E1lida. \u00C9 necess\u00E1rio que os n\u00F3s DocumentFragment tenham exatamente um elemento filho
ora-err\:SYS060=n\u00E3o \u00E9 poss\u00EDvel utilizar a inst\u00E2ncia de XQStaticContext, que foi obtida a partir de uma express\u00E3o de consulta, para preparar outras express\u00F5es
ora-err\:XDBC001=Falha de XDBC: {0}

########## Standard type exceptions ###########################################

err\:XPTY0004=Tipo inv\u00E1lido: {0}
err\:FOTY0012=fn:data() aplicada a tipo complexo com conte\u00FAdo complexo n\u00E3o misto {0}
err\:XPTY0018=N\u00E3o \u00E9 poss\u00EDvel que o \u00FAltimo passo na express\u00E3o do percurso contenha n\u00F3s e valores at\u00F3micos
err\:XPTY0019=N\u00E3o \u00E9 poss\u00EDvel que o passo na express\u00E3o do percurso seja um tipo at\u00F3mico
err\:XPTY0020=O item de contexto na express\u00E3o do eixo n\u00E3o \u00E9 um n\u00F3
err\:XQTY0023=N\u00E3o \u00E9 poss\u00EDvel que o criador de elementos contenha um n\u00F3 de documento
err\:XQTY0024=\u00C9 necess\u00E1rio que o criador de elementos tenha os n\u00F3s de atributos antes dos outros
err\:XQTY0030=\u00C9 necess\u00E1rio que o argumento da express\u00E3o de valida\u00E7\u00E3o seja um documento ou elemento
err\:XQST0036=N\u00E3o \u00E9 poss\u00EDvel encontrar o tipo "{0}" do m\u00F3dulo importado "{1}" nas defini\u00E7\u00F5es de schema dentro do \u00E2mbito
err\:XQTY0086=Foi encontrado um valor sens\u00EDvel ao namespace ilegal no modo ''no-preserve'': {0}

########## Standard serialization exceptions ###########################################
err\:SENR0001=Entrada de dados inv\u00E1lida para o serializer: N\u00E3o \u00E9 poss\u00EDvel sequenciar diretamente atributos e namespaces
err\:SESU0007="{0}" n\u00E3o \u00E9 uma codifica\u00E7\u00E3o suportada neste JVM
err\:SESU0011=O formato de normaliza\u00E7\u00E3o "{0}" n\u00E3o \u00E9 suportado
err\:SERE0008=A codifica\u00E7\u00E3o especificada {0} n\u00E3o consegue codificar o texto "{1}"
err\:SEPM0004=\u00C9 um erro especificar o par\u00E2metro doctype-system ou especificar o par\u00E2metro standalone com outro valor que n\u00E3o seja omit, caso a inst\u00E2ncia do modelo de dados contenha n\u00F3s de texto ou v\u00E1rios n\u00F3s de elementos como filhos do n\u00F3 raiz
err\:SEPM0009=Se "omit-xml-declaration" tiver um valor "Yes" (ou true), \u00E9 necess\u00E1rio que "standalone" tenha o valor OMIT
err\:SEPM0016a=O valor do par\u00E2metro "{0}" n\u00E3o \u00E9 suportado
err\:SEPM0016b=O valor do par\u00E2metro "{0}" n\u00E3o \u00E9 suportado. Os valores v\u00E1lidos s\u00E3o: {1}
err\:SEPM0016c=O par\u00E2metro "{0}" n\u00E3o \u00E9 suportado
err\:SEPM0016d=O m\u00E9todo especificado {0} produz uma sa\u00EDda de dados bin\u00E1rios que n\u00E3o \u00E9 poss\u00EDvel escrever como caracteres
err\:SEPM0016e=N\u00E3o \u00E9 poss\u00EDvel que o valor da propriedade doctype-system contenha um ap\u00F3strofo e aspas

########## Standard XQUF exceptions ###########################################
err\:XUST0001=Utiliza\u00E7\u00E3o ilegal de express\u00E3o de atualiza\u00E7\u00E3o (ou sequencial)
err\:XUST0002=\u00C9 necess\u00E1ria uma express\u00E3o de atualiza\u00E7\u00E3o
err\:XUST0003=N\u00E3o \u00E9 poss\u00EDvel que o prolog contenha mais de uma declara\u00E7\u00E3o de revalida\u00E7\u00E3o.
err\:XUTY0004=A sequ\u00EAncia de inser\u00E7\u00E3o da express\u00E3o de inser\u00E7\u00E3o cont\u00E9m um n\u00F3 de atributo a seguir a um n\u00F3 que n\u00E3o \u00E9 um n\u00F3 de atributo
err\:XUTY0005=Numa express\u00E3o de inser\u00E7\u00E3o na qual \u00E9 especificado into, as first into ou as last into, \u00E9 poss\u00EDvel que a express\u00E3o de destino n\u00E3o devolva um resultado n\u00E3o vazio que n\u00E3o seja constitu\u00EDdo por um \u00FAnico n\u00F3 de elemento ou documento.
err\:XUTY0006=Numa express\u00E3o de inser\u00E7\u00E3o na qual \u00E9 especificado before ou after, \u00E9 poss\u00EDvel que a express\u00E3o de destino n\u00E3o devolva um resultado n\u00E3o vazio que n\u00E3o seja constitu\u00EDdo por um \u00FAnico n\u00F3 de elemento, texto, coment\u00E1rio ou instru\u00E7\u00E3o de processamento.
err\:XUTY0007=\u00C9 necess\u00E1rio que a express\u00E3o de destino de uma express\u00E3o de apagamento devolva uma sequ\u00EAncia de zero ou mais n\u00F3s.
err\:XUTY0008=Numa express\u00E3o de substitui\u00E7\u00E3o, \u00E9 necess\u00E1rio que a express\u00E3o de destino devolva um resultado n\u00E3o vazio que seja constitu\u00EDdo por um \u00FAnico n\u00F3 de elemento, atributo, texto, coment\u00E1rio ou instru\u00E7\u00E3o de processamento.
err\:XUDY0009=Numa express\u00E3o de substitui\u00E7\u00E3o na qual o valor of n\u00E3o \u00E9 especificado, \u00E9 necess\u00E1rio que o n\u00F3 devolvido pela express\u00E3o de destino tenha um pai.
err\:XUTY0010=Numa express\u00E3o de substitui\u00E7\u00E3o na qual o valor of n\u00E3o \u00E9 especificado e o destino \u00E9 um n\u00F3 de elemento, texto, coment\u00E1rio ou instru\u00E7\u00E3o de processamento, \u00E9 necess\u00E1rio que a sequ\u00EAncia de substitui\u00E7\u00E3o seja constitu\u00EDda por zero ou mais n\u00F3s de elementos, texto, coment\u00E1rios ou instru\u00E7\u00F5es de processamento.
err\:XUTY0011=Numa express\u00E3o de substitui\u00E7\u00E3o na qual o valor of n\u00E3o \u00E9 especificado e o destino \u00E9 um n\u00F3 de atributo, \u00E9 necess\u00E1rio que a sequ\u00EAncia de substitui\u00E7\u00E3o seja constitu\u00EDda por zero ou mais n\u00F3s de atributos.
err\:XUTY0012=Numa express\u00E3o de renomea\u00E7\u00E3o, \u00E9 necess\u00E1rio que o destino devolva um \u00FAnico n\u00F3 de elemento, atributo ou instru\u00E7\u00E3o de processamento
err\:XUTY0013=Numa express\u00E3o de transforma\u00E7\u00E3o, \u00E9 um erro de tipo se a express\u00E3o de origem na cl\u00E1usula COPY n\u00E3o devolver um \u00FAnico n\u00F3
err\:XUDY0014=Numa express\u00E3o de transforma\u00E7\u00E3o, \u00E9 um erro din\u00E2mico se a cl\u00E1usula MODIFY modificar qualquer n\u00F3 que n\u00E3o tenha sido criado pela cl\u00E1usula COPY
err\:XUDY0015=Um n\u00F3 \u00E9 o destino de mais de uma express\u00E3o de renomea\u00E7\u00E3o na mesma consulta
err\:XUDY0016=Um n\u00F3 \u00E9 o destino de mais de uma express\u00E3o de substitui\u00E7\u00E3o (sem o valor of especificado) na mesma consulta
err\:XUDY0017=Um n\u00F3 \u00E9 o destino de mais de uma express\u00E3o de substitui\u00E7\u00E3o com valor of na mesma consulta.
err\:XUDY0018=Uma fun\u00E7\u00E3o que foi declarada como externa, mas de n\u00E3o atualiza\u00E7\u00E3o, devolve uma lista de atualiza\u00E7\u00F5es pendentes n\u00E3o vazia.
err\:XUDY0019=Uma fun\u00E7\u00E3o que foi declarada como externa e de atualiza\u00E7\u00E3o devolve uma inst\u00E2ncia de modelo de dados n\u00E3o vazia.
err\:XUDY0021=As atualiza\u00E7\u00F5es resultariam num elemento, {0}, com mais de um atributo nomeado {1}
err\:XUTY0022=Uma express\u00E3o de inser\u00E7\u00E3o especifica a inser\u00E7\u00E3o de um n\u00F3 de atributo num n\u00F3 de documento
err\:XUDY0023=Uma express\u00E3o de inser\u00E7\u00E3o, substitui\u00E7\u00E3o ou renomea\u00E7\u00E3o introduz o prefixo "{0}" associado ao URI "{1}" que entra em conflito com uma associa\u00E7\u00E3o existente a "{2}"
err\:XUDY0024=Um conjunto de express\u00F5es de atualiza\u00E7\u00E3o introduz uma associa\u00E7\u00E3o de namespaces que entram em conflito para o prefixo "{0}" e URIs "{1}" e "{2}"
err\:XUST0026=Uma declara\u00E7\u00E3o de revalida\u00E7\u00E3o no Prolog especifica um modo de revalida\u00E7\u00E3o que n\u00E3o \u00E9 suportado
err\:XUDY0027=A express\u00E3o de destino de uma express\u00E3o de inser\u00E7\u00E3o, substitui\u00E7\u00E3o ou renomea\u00E7\u00E3o resulta numa sequ\u00EAncia vazia.
err\:XUST0028=N\u00E3o \u00E9 poss\u00EDvel que uma fun\u00E7\u00E3o de atualiza\u00E7\u00E3o especifique um tipo de retorno
err\:XUDY0029=Numa express\u00E3o de inser\u00E7\u00E3o na qual \u00E9 especificado before ou after, \u00E9 necess\u00E1rio que o n\u00F3 devolvido pela express\u00E3o de destino tenha um pai.
err\:XUDY0030=N\u00E3o \u00E9 poss\u00EDvel que uma express\u00E3o de inser\u00E7\u00E3o especifique a inser\u00E7\u00E3o de um n\u00F3 de atributo antes ou depois do filho de um n\u00F3 de documento
err\:XUDY0031=N\u00E3o \u00E9 poss\u00EDvel que v\u00E1rias chamadas para fn:put no mesmo instant\u00E2neo especifiquem o mesmo URI (ap\u00F3s a decifra\u00E7\u00E3o de URIs relativos)
err\:FOUP0001=O primeiro operando de fn:put n\u00E3o \u00E9 um tipo de n\u00F3 suportado
err\:FOUP0002=O segundo operando de fn:put ({0}) n\u00E3o \u00E9 v\u00E1lido como xs:anyURI 

########## Standard XQSX exceptions ###########################################
err\:SXST0002=N\u00E3o \u00E9 poss\u00EDvel misturar operandos de atualiza\u00E7\u00E3o e operandos sequenciais numa express\u00E3o
err\:SXDY0003=\u00C9 um erro din\u00E2mico se, ap\u00F3s a aplica\u00E7\u00E3o das atualiza\u00E7\u00F5es, o valor associado a qualquer vari\u00E1vel dentro do \u00E2mbito n\u00E3o corresponder ao tipo est\u00E1tico dessa vari\u00E1vel de acordo com as regras de correspond\u00EAncia SequenceType. Tipo inv\u00E1lido: {0}. Era esperado: {1}
err\:SXST0005=\u00C9 um erro est\u00E1tico se duas ou mais vari\u00E1veis declaradas na mesma express\u00E3o de bloco tiverem o mesmo QName expandido: {0}
err\:SXTY0006=Vari\u00E1vel n\u00E3o inicializada: {0}  
err\:SXST0007=Vari\u00E1vel n\u00E3o atribu\u00EDvel: {0}
err\:SXST0008=Categoria ilegal de uma express\u00E3o de corpo da fun\u00E7\u00E3o: {0}. Era esperado {1}
err\:SXST0009=Valor inv\u00E1lido para a op\u00E7\u00E3o ''xqsx:query-mode'': {0}. Era esperado: ''sequential'' ou ''simple''

########## Oracle-specific type exceptions #######################################

ora-err\:TBDTYPE=TBD TYPE: {0}
ora-err\:TYPE001="{0}": tipo n\u00E3o encontrado
ora-err\:TYPE002="{0}": n\u00E3o \u00E9 poss\u00EDvel converter em {1} para atribui\u00E7\u00E3o a {2}
ora-err\:TYPE003=N\u00E3o Correspond\u00EAncia de Tipo de Runtime
ora-err\:TYPE003a=N\u00E3o Correspond\u00EAncia de Tipo de Runtime: foi obtido um valor xdt:untypedAtomic
ora-err\:XPTY0004a=O operador "{0}" n\u00E3o \u00E9 aplic\u00E1vel para argumentos do tipo {1} e {2}
ora-err\:XPTY0004b=Foi encontrada uma n\u00E3o correspond\u00EAncia de tipos na express\u00E3o. A sequ\u00EAncia vazia \u00E9 a \u00FAnica que satisfaz as regras de verifica\u00E7\u00E3o de tipos. Tipo esperado: {0}. Tipo real: {1}
ora-err\:XPTY0004d=N\u00E3o \u00E9 poss\u00EDvel aplicar o operador "{0}" a valores do tipo {1} e {2}
ora-err\:XPTY0004e=Tipo est\u00E1tico inv\u00E1lido: {0}
ora-err\:XPTY0004f="{0}": valor incorreto para o tipo {1}
ora-err\:XPTY0004g=Itens n\u00E3o compar\u00E1veis: os tipos s\u00E3o "{0}" e "{1}"
ora-err\:XPTY0004h=Tipo de n\u00F3 inesperado: {0}

########## Oracle-specific update exceptions #####################################

ora-err\:UPD001=Falha na atualiza\u00E7\u00E3o: anulada: {1}
ora-err\:UPD002=Falha na atualiza\u00E7\u00E3o: compensada: {1}
ora-err\:UPD003=Falha na atualiza\u00E7\u00E3o: resultado misto, erro de atualiza\u00E7\u00E3o despachado (updateid={0}): {1}
ora-err\:UPD004=Atualiza\u00E7\u00E3o pendente devido a falha do sistema recuperada (updateid={0})

########## Oracle-specific mutator exceptions ####################################
# Note: ChoiceFormat options should be translated.

ora-err\:MUT001=\u00C9 necess\u00E1rio que o elemento para atualiza\u00E7\u00E3o ({0}) tenha um tipo complexo, mas o tipo encontrado foi "{1}"
ora-err\:MUT002=O tipo do valor transmitido como argumento ({0}) n\u00E3o corresponde ao tipo de {1,choice,0#element|1#attribute} "{2}" ({3})
ora-err\:MUT003={0,choice,0#Element|1#Attribute} "{1}" foi declarado como tendo um tipo at\u00F3mico simples ("{2}"), mas o valor inserido \u00E9 uma lista
ora-err\:MUT004=N\u00E3o foi poss\u00EDvel compilar o percurso "{0}": {1}
ora-err\:MUT005=O XPath "{0}" n\u00E3o selecionou nenhum n\u00F3
ora-err\:MUT006=O XPath "{0}" selecionou v\u00E1rios n\u00F3s
ora-err\:MUT007=N\u00E3o foi poss\u00EDvel criar um XPath que selecione o n\u00F3 pai para o XPath "{0}"
ora-err\:MUT008=N\u00E3o existem n\u00F3s pai para sele\u00E7\u00E3o: {0}
ora-err\:MUT009=Existem v\u00E1rios n\u00F3s pai para sele\u00E7\u00E3o: {0}
ora-err\:MUT010=N\u00E3o \u00E9 poss\u00EDvel inserir um valor at\u00F3mico, porque n\u00E3o \u00E9 poss\u00EDvel determinar o ponto de inser\u00E7\u00E3o; em vez disso, utilize um n\u00F3 de elemento ou atributo
ora-err\:MUT011=\u00C9 necess\u00E1rio que o argumento "path" ("{0}") aponte para um elemento com conte\u00FAdo complexo para que seja poss\u00EDvel efetuar a inser\u00E7\u00E3o
ora-err\:MUT012=N\u00E3o foi encontrado nenhum {0,choice,0#element|1#attribute}" com o nome "{1}" no tipo "{2}" ou globalmente declarado
ora-err\:MUT013=O elemento "{0}" foi declarado como sendo um tipo simples ("{1}"), mas o elemento inserido n\u00E3o tem conte\u00FAdo simples
ora-err\:MUT014={0,choice,0#Element|1#Attribute} "{1}" j\u00E1 existe
ora-err\:MUT015=Falha na convers\u00E3o de XToken<->SDO: {0}
ora-err\:MUT016=\u00C9 necess\u00E1rio que o elemento cujo valor deve ser substitu\u00EDdo ("{0}") tenha um tipo simples ou um tipo complexo com conte\u00FAdo simples; foi encontrado o tipo: {1}
ora-err\:MUT017=O percurso "{0}" foi indexado, mas n\u00E3o \u00E9 poss\u00EDvel que o {1,choice,0#element|1#attribute} ("{2}") correspondente apare\u00E7a mais de uma vez
ora-err\:MUT018=Foi transmitida uma lista, mas o tipo de {0,choice,0#element|1#attribute} "{1}" ("{2}") n\u00E3o \u00E9 um tipo de lista
ora-err\:MUT019=\u00C9 necess\u00E1rio que o XPath utilizado como argumento seja relativo: {0}
ora-err\:MUT020=N\u00E3o foi poss\u00EDvel converter o valor "{0}" no tipo "{1}" para {2,choice,0#element|1#attribute} "{3}"

