# Default (English) exception messages.
#
# See XQuery*Exception.java for Java-language codes corresponding to these
# QNames.

########## Standard dynamic exceptions ########################################

err\:XPDY0002="{0}": valor de contexto din\u00E1mico no definido
err\:XQDY0025="{0}": atributo duplicado
err\:XQDY0026=La instrucci\u00F3n de procesamiento no puede contener "?>"
err\:XQDY0027=Fallo de validaci\u00F3n: {0}
err\:XQST0040="{0}": atributo duplicado
err\:XQDY0041=No se ha podido convertir a NCName: {0}
err\:XQDY0044=Nombre de atributo no v\u00E1lido
err\:XPDY0050=El tipo din\u00E1mico no coincide con el tipo especificado por la expresi\u00F3n de trato: {0}
err\:XQDY0061=Contenido del nodo de documento no v\u00E1lido
err\:XQDY0062=Restricci\u00F3n de nodo de documento no cumplida
err\:XQDY0064=El nombre de instrucci\u00F3n de procesamiento calculada no puede ser "XML"
err\:XQDY0072=El comentario calculado no puede contener "--" ni terminar con "-"
err\:XQDY0074=No se puede ampliar QName: {0}
err\:XQDY0084=No se ha encontrado el elemento "{0}" mediante las declaraciones de tipo de elemento de \u00E1mbito
err\:XQDY0096=El nombre proporcionado al constructor de elemento calculado no es v\u00E1lido
err\:FOAR0001=Dividir entre cero
err\:FOAR0002="{0}": desbordamiento/subdesbordamiento num\u00E9rico
err\:FOCA0001="{0}": no se puede convertir a decimal
err\:FOCA0002="{0}": valor l\u00E9xico incorrecto
err\:FOCA0004="{0}": no se puede convertir a entero
err\:FOCA0005=NaN proporcionado para valor float/double
err\:FOCH0001=Punto de c\u00F3digo incorrecto: {0}
err\:FOCH0002="{0}": intercalaci\u00F3n no soportada
err\:FOCH0003="{0}": formato de normalizaci\u00F3n no soportado
err\:FOCH0004="{0}": intercalaci\u00F3n no apropiada para esta funci\u00F3n
err\:FODC0001=Sin documento de contexto
err\:FODC0002=Error al recuperar el recurso "{0}": {1}
err\:FODC0004="{0}": argumento no v\u00E1lido para fn:collection()
err\:FODC0005="{0}": argumento no v\u00E1lido para fn:doc()
err\:FODT0001=Desbordamiento en aritm\u00E9tica de fecha/hora
err\:FODT0002=Desbordamiento/subdesbordamiento en operaci\u00F3n de duraci\u00F3n
err\:FODT0003="{0}": zona horaria no v\u00E1lida
err\:FOER0000=Error no identificado
err\:FONS0003="{0}": el prefijo no se ha definido en el contexto est\u00E1tico
err\:FONS0004="{0}": no se ha encontrado el espacio de nombres para este prefijo
err\:FONS0005=El URI base no se ha definido
err\:FORG0001="{0}": valor no v\u00E1lido para conversi\u00F3n/constructor: {1}
err\:FORG0002="{0}": argumento no v\u00E1lido para fn:resolve-uri()
err\:FORG0003=se esperaba cero o un elemento, se han obtenido dos o m\u00E1s elementos
err\:FORG0004=se esperaba uno o m\u00E1s elementos, se han obtenido cero elementos
err\:FORG0005=se esperaba exactamente un elemento, se han obtenido {0} elementos
err\:FORG0006="{0}": tipo de argumento no v\u00E1lido
err\:FORG0008=Ambos argumentos para fn:dateTime tienen una zona horaria especificada: "{0}" y "{1}"
err\:FORG0009=se ha llamado fn:resolve-uri() con el URI base no absoluto "{0}"
err\:FORX0001=Indicadores de expresi\u00F3n regular no v\u00E1lida
err\:FORX0002="{0}": expresi\u00F3n regular no v\u00E1lida
err\:FORX0003=La expresi\u00F3n regular coincide con la cadena de longitud cero: "{0}"
err\:FORX0004="{0}": cadena de sustituci\u00F3n no v\u00E1lida
err\:FOTY0011=El elemento de contexto no es un nodo

########## Oracle-specific dynamic exceptions ####################################

ora-err\:TBDDYNAMIC=TBD DYNAMIC: {0}
ora-err\:XPDY0002a=Se necesita el elemento de contexto, pero no se ha definido (o falta '$' antes de un nombre de variable)
ora-err\:XPDY0002b="{0}": variable externa no enlazada
ora-err\:XPDY0002c="{0}": URI de documento no v\u00E1lido
ora-err\:XQDY0027a=No se ha encontrado el atributo "{0}" para la validaci\u00F3n
ora-err\:XQDY0027b=No se ha encontrado el elemento "{0}" para la validaci\u00F3n
ora-err\:ENT001=No se puede resolver el URI "{0}": esquema desconocido
ora-err\:FODC0002a=Error al analizar el XML de entrada "{0}" {1}
ora-err\:FODC0002b=Error al analizar el XML de entrada: un cursor StAX s\u00F3lo se puede utilizar una vez
ora-err\:FODC0002c=Recopilaci\u00F3n por defecto no definida
ora-err\:FO0001="{0}": argumento no v\u00E1lido para la funci\u00F3n {1}
ora-err\:FO0002="{0}": no tiene el formato esperado {1}
ora-err\:NS0001="{0}": el prefijo ya est\u00E1 enlazado a {1}
ora-err\:FOUD0001=El procedimiento {0} se ha llamado con una entrada incompleta"
ora-err\:MEM0001=La solicitud necesita {0} operadores gestionados por memoria, pero solo hay {1} disponibles

########## Standard static exceptions #########################################

err\:FONC0001=elemento de contexto no definido
err\:XPST0001="{0}": valor de contexto est\u00E1tico no definido
err\:XPST0003=Expresi\u00F3n no v\u00E1lida: {0}
err\:XPST0005=No se puede asignar un tipo que est\u00E1 vac\u00EDo
err\:XPST0008=No se ha encontrado el nombre "{0}" en el contexto est\u00E1tico
err\:XPST0051="{0}": tipo no definido o no at\u00F3mico
err\:XQST0009=Funci\u00F3n de importaci\u00F3n de esquema no soportada
err\:XPST0010=Funci\u00F3n de eje completo no soportada
err\:XQST0012=Esquema no v\u00E1lido {0}. {1}
err\:XQST0013=Contenido de pragma no v\u00E1lido. {0}
err\:XQST0014=Contenido de la extensi\u00F3n no v\u00E1lido. {0}
err\:XQST0016=Funci\u00F3n Module no soportada
err\:XPST0017="{0}": funci\u00F3n desconocida (o el n\u00FAmero de argumentos ({1}) es incorrecto) {2}
err\:XQST0022=El atributo de declaraci\u00F3n de espacio de nombres debe ser un literal de cadena
err\:XQST0031="{0}": versi\u00F3n no soportada
err\:XQST0032="{0}": declaraci\u00F3n de URI base duplicada
err\:XQST0033="{0}": declaraci\u00F3n de prefijo de espacio de nombres duplicada
err\:XQST0034="{0}": la funci\u00F3n ya se ha declarado o importado
err\:XQST0035="{0}": nombre importado anteriormente
err\:XQST0038="{0}": intercalaciones desconocidas o m\u00FAltiples
err\:XQST0039="{0}": nombre del par\u00E1metro de funci\u00F3n duplicado
err\:XQST0045=La funci\u00F3n "{0}" est\u00E1 declarada en el espacio de nombres reservado: "{1}"
err\:XQST0046="{0}": URI no v\u00E1lido
err\:XQST0047="{0}": espacio de nombres de destino duplicado
err\:XQST0048="{0}": el nombre debe estar en el espacio de nombres de destino del m\u00F3dulo: "{1}"
err\:XQST0049="{0}": nombre de variable duplicado
err\:XQST0054=La declaraci\u00F3n de "{0}" tiene una expresi\u00F3n de inicializaci\u00F3n que directa o indirectamente depende de "{0}": ({1})
err\:XQST0055=Varias declaraciones de espacios de nombre de copia
err\:XQST0056="{0}": espacio de nombres de destino utilizado por el m\u00F3dulo de importaci\u00F3n
err\:XQST0057=Puede que una importaci\u00F3n de esquema no enlace un prefijo cuando el espacio de nombres est\u00E1 vac\u00EDo
err\:XQST0058="{0}": espacio de nombres de destino duplicado
err\:XQST0059=No se ha encontrado el esquema o m\u00F3dulo
err\:XQST0060="{0}": el nombre de funci\u00F3n no puede tener un espacio de nombres vac\u00EDo
err\:XQST0065=Varias declaraciones de ordenaci\u00F3n por defecto
err\:XQST0066=Varias declaraciones de espacios de nombres de elemento/tipo/funci\u00F3n por defecto
err\:XQST0067=Varias declaraciones de construcci\u00F3n por defecto
err\:XQST0068=Varias declaraciones de espacio de l\u00EDmite
err\:XQST0069=El pr\u00F3logo de la consulta no puede contener m\u00E1s de una declaraci\u00F3n de orden vac\u00EDa.
err\:XQST0070=Declaraci\u00F3n de espacio de nombres no v\u00E1lida.
err\:XQST0071="{0}": atributo de declaraci\u00F3n de espacio de nombres duplicado
err\:XQST0075=Funci\u00F3n de validaci\u00F3n no soportada
err\:XQST0076="{0}": intercalaci\u00F3n desconocida
err\:XQST0077="{0}": pragma desconocido
err\:XQST0078="{0}": opci\u00F3n desconocida
err\:XQST0079=Extensi\u00F3n no v\u00E1lida. {0}
err\:XPST0080=El tipo de destino de una expresi\u00F3n de conversi\u00F3n o que puede ser de conversi\u00F3n es xs:NOTATION o xs:anyAtomicType
err\:XPST0081=No se puede resolver el prefijo "{0}" utilizado en el nombre cualificado "{1}"
err\:XQST0085=Declaraci\u00F3n de espacio de nombres vac\u00EDa para el prefijo: "{0}"
err\:XQST0087=La codificaci\u00F3n "{0}" de la declaraci\u00F3n de versi\u00F3n no es v\u00E1lida
err\:XQST0088=Espacio de nombres de destino vac\u00EDo no v\u00E1lido en la importaci\u00F3n o declaraci\u00F3n de m\u00F3dulo
err\:XQST0089=La variable "{0}" enlazada para la cl\u00E1usula tiene el mismo QName ampliado que su variable posicional asociada
err\:XQST0090=El valor "{0}" no es una referencia de caracteres v\u00E1lida en XML 1.0
err\:XQST0093=Importaciones de m\u00F3dulo circulares. La declaraci\u00F3n de "{0}" tiene una expresi\u00F3n de inicializaci\u00F3n que directa o indirectamente depende de "{0}": ({1})

########## Oracle-specific static exceptions #####################################

ora-err\:XPST0003a=Etiqueta final de XML no coincidente: "{1}" no coincide con "{0}"
ora-err\:XPST0003b=Uso no v\u00E1lido de la expresi\u00F3n "{0}". {1}
ora-err\:XPST0003c=Error de sintaxis. "{0}" es inesperado
ora-err\:XPST0003d=Error de sintaxis
ora-err\:XPST0005a=La prueba de nodo "{0}" no coincide con ning\u00FAn nodo de esta secuencia de entrada de tipo: {1}
ora-err\:XPST0008a=Se utiliza la variable "${0}", pero no se ha declarado
ora-err\:XPST0017a="{0}": funci\u00F3n externa no enlazada. {1}
ora-err\:XQST0059a=No se ha encontrado el esquema XML {0}. {1}
ora-err\:XQST0059b=No se ha encontrado el m\u00F3dulo de biblioteca {0}. {1}
ora-err\:XQST0059c=Esquema XML no v\u00E1lido {0}. {1}
ora-err\:XQST0059d=M\u00F3dulo de biblioteca no v\u00E1lido {0}. {1}
ora-err\:EXT0001="{0}" no es un pragma reconocido
ora-err\:EXT0002=El pragma "{0}" solo se puede utilizar alrededor de un constructor de nodos de elemento o atributo
ora-err\:FUNC002=Uso no v\u00E1lido del procedimiento con efectos secundarios {0} con el n\u00FAmero de argumentos {1}. Los procedimientos con efectos secundarios no se pueden llamar desde un contexto sin efectos secundarios
ora-err\:FUNC003=Se ha encontrado una llamada de funci\u00F3n, cuyos resultados se han desechado
ora-err\:VAR002="${0}": variable no inicializada

########## Oracle-specific system exceptions #####################################

ora-err\:TBDSYSTEM=TBD SYSTEM: {0}
ora-err\:SYS001=Esta funcionalidad no se ha implantado. {0}
ora-err\:SYS002=Se ha obtenido una excepci\u00F3n de biblioteca: 
ora-err\:SYS003=Excepci\u00F3n inesperada
ora-err\:SYS004=Interrupci\u00F3n de tiempo de ejecuci\u00F3n
ora-err\:SYS005=Consulta terminada por la solicitud de usuario
ora-err\:SYS006=La funci\u00F3n {0} es recursiva; no est\u00E1 soportada.
ora-err\:SYS007=Configuraci\u00F3n de contexto no v\u00E1lida
ora-err\:SYS008=URI de contexto duplicado {0}
ora-err\:SYS009=Se est\u00E1 intentando enlazar la funci\u00F3n externa {0} con el n\u00FAmero de argumentos {1}, pero no se ha encontrado esta funci\u00F3n
ora-err\:SYS010=Consulta terminada por la solicitud de administraci\u00F3n
ora-err\:SYS011=Consulta terminada debido a un timeout especificado por el usuario
ora-err\:SYS012=Consulta terminada debido a un timeout de transacci\u00F3n
ora-err\:SYS013=Se ha realizado un rollback de la transacci\u00F3n (xid={0}).
ora-err\:SYS014=Referencia de entidad no ampliada en DOM
ora-err\:SYS015=Entrada no v\u00E1lida: los nodos DOM deben tener en cuenta los espacios de nombres. Si utiliza un analizador DOM, aseg\u00FArese de que la propiedad de conocimiento de espacios de nombres est\u00E1 definida en "true" (consulte javax.xml.parsers.DocumentBuilderFactory#setNamespaceAware(boolean)). Si construye DOM mediante los m\u00E9todos de creaci\u00F3n, aseg\u00FArese de que se utilizan las versiones de los m\u00E9todos que tienen en cuenta espacios de nombres (por ejemplo, org.w3c.dom.Document#createElementNS(String, String)) 
ora-err\:SYS016=Los nodos DOM tienen que ser comparables. org.w3c.dom.Node.compareDocumentPosition(.) ha devuelto "{0}" para los nodos "{1}" y "{2}" 
ora-err\:SYS017=No se ha definido PageManagerPool de SDOM lento
ora-err\:SYS018=No est\u00E1 soportado el cambio de nombre de un nodo de instrucci\u00F3n de procesamiento de DOM
ora-err\:SYS019=Las implantaciones de DOM donde org.w3c.dom.Document.renameNode(...) crea un nuevo nodo no est\u00E1n soportadas para expresiones de cambio de nombre de actualizaci\u00F3n de XQuery
ora-err\:SYS020=La declaraci\u00F3n de opci\u00F3n {0} := "{1}" no es v\u00E1lida
ora-err\:SYS021=Se ha producido un error al evaluar la consulta din\u00E1mica: {0}
ora-err\:SYS022=Tipo de medio no soportado o no v\u00E1lido: {0}
ora-err\:SYS023=Perfil de idioma no v\u00E1lido: {0}
ora-err\:SYS024=Datos no v\u00E1lidos devueltos de la implantaci\u00F3n de SPI proporcionada por el desarrollador. {0}
ora-err\:SYS025=El enlace de DOM especificado no es v\u00E1lido. Los nodos DOM Entity, Notation, EntityReference y DocumentType no se pueden modelar como XDM
ora-err\:SYS026=El enlace de DOM especificado no es v\u00E1lido. Los nodos de texto vac\u00EDo y CDATASection no se pueden enlazar a menos que no tengan ning\u00FAn principal
ora-err\:SYS027=El enlace de DOM especificado no es v\u00E1lido. Un nodo de texto no se puede enlazar si tiene un hermano adyacente que tambi\u00E9n es de texto
ora-err\:SYS028=El enlace de DOM especificado no es v\u00E1lido. La implantaci\u00F3n debe soportar DOM nivel 3 (Core y XML)
ora-err\:SYS029=No se ha reconocido la declaraci\u00F3n de opci\u00F3n "{0}"
ora-err\:SYS030=Para la declaraci\u00F3n de opci\u00F3n {0}, el valor "{1}" no est\u00E1 soportado
ora-err\:SYS031=Para los enlaces de funci\u00F3n Java, se debe especificar un nombre de clase con la opci\u00F3n {0}
ora-err\:SYS032=No se ha encontrado el nombre de clase especificado: {0}
ora-err\:SYS033=No se ha podido instanciar la clase especificada: {0}
ora-err\:SYS034=Se ha producido un error al inicializar argumentos para la llamada de funci\u00F3n {0}
ora-err\:SYS035=Se ha producido un error al intentar llamar al m\u00E9todo est\u00E1tico definido por el usuario {0}: {1}
ora-err\:SYS036=Se ha producido un error al procesar el resultado de un m\u00E9todo est\u00E1tico definido por el usuario {0}: {1}
ora-err\:SYS037=La funci\u00F3n definida por el usuario {0} resuelta debe ampliar {1}
ora-err\:SYS038=Se ha producido un error al intentar resolver la funci\u00F3n {0}. {1}
ora-err\:SYS039=Para la funci\u00F3n {0}, el sistema de resoluci\u00F3n de entidades ha devuelto un tipo de enlace de funci\u00F3n no soportado: "{1}"
ora-err\:SYS040=Esta consulta se ha preparado para el an\u00E1lisis est\u00E1tico solamente y no se puede ejecutar
ora-err\:SYS041=La funci\u00F3n fn:put no est\u00E1 activada
ora-err\:SYS042=No se ha encontrado el m\u00E9todo Java que coincide con la firma de funci\u00F3n XQuery proporcionada (el nombre, el par\u00E1metro o el tipo de retorno no coincide)
ora-err\:SYS043=No se ha encontrado el m\u00E9todo "{0}" especificado de la clase "{1}"
ora-err\:SYS044=Tipo de medio no v\u00E1lido: {0}
ora-err\:SYS045=La entidad de documento no es v\u00E1lida: {0}
ora-err\:SYS046=Error del depurador: {0}
ora-err\:SYS047=No se puede realizar la operaci\u00F3n puesto que la instancia est\u00E1 cerrada
ora-err\:SYS048=No se puede llamar directamente un m\u00F3dulo de biblioteca en este contexto. Se necesita un m\u00F3dulo principal con un cuerpo de consulta
ora-err\:SYS049=El modo de procesamiento no coincide entre una consulta y un m\u00F3dulo de biblioteca o entre dos m\u00F3dulos de biblioteca.
ora-err\:SYS050=Acceso denegado. Las actualizaciones no est\u00E1n activadas
ora-err\:SYS051=Las actualizaciones no est\u00E1n soportadas para este tipo de origen de datos
ora-err\:SYS052=Los enlaces de SAX deben soportar la funci\u00F3n de espacios de nombres
ora-err\:SYS053=No es posible actualizar simult\u00E1neamente dos or\u00EDgenes de datos que hacen referencia a los mismos datos f\u00EDsicos subyacentes. Por ejemplo, esto puede suceder si la misma instancia de DOM est\u00E1 enlazada a la consulta varias veces
ora-err\:SYS054=La parte de la cadena de consulta del URI de intercalaci\u00F3n no es v\u00E1lida: {0}
ora-err\:SYS055=El intercalador especificado no soporta las operaciones de subcadena
ora-err\:SYS056=URI relativo inesperado: {0}
ora-err\:SYS057=Los URI de documento devueltos para la intercalaci\u00F3n deben ser \u00FAnicos: {0}
ora-err\:SYS058=Configuraci\u00F3n de conversi\u00F3n de juego de informaci\u00F3n no soportada. Actualmente no est\u00E1 soportado conservar espacio en blanco insignificante mientras se desecha espacio en blanco significativo.
ora-err\:SYS059=El enlace de DOM especificado no es v\u00E1lido. Los nodos DocumentFragment deben tener exactamente un elemento secundario
ora-err\:SYS060=no se puede utilizar una instancia de XQStaticContext obtenida a partir de una expresi\u00F3n de consulta para preparar otras expresiones
ora-err\:XDBC001=Fallo de XDBC: {0}

########## Standard type exceptions ###########################################

err\:XPTY0004=Tipo no v\u00E1lido: {0}
err\:FOTY0012=Se ha aplicado fn:data() al tipo complejo con el contexto complejo no mixto {0}
err\:XPTY0018=El \u00FAltimo paso de la expresi\u00F3n de ruta de acceso no puede contener nodos y valores at\u00F3micos
err\:XPTY0019=El paso de una expresi\u00F3n de ruta de acceso no puede ser un tipo at\u00F3mico
err\:XPTY0020=El elemento de contexto de la expresi\u00F3n de eje no es un nodo
err\:XQTY0023=El constructor de elementos no puede contener un nodo de documento
err\:XQTY0024=El constructor de elementos debe tener nodos de atributos antes que otros
err\:XQTY0030=El argumento de la expresi\u00F3n de validaci\u00F3n debe ser un documento o elemento
err\:XQST0036=No se ha encontrado el tipo "{0}" del m\u00F3dulo importado "{1}" en las definiciones de esquema de \u00E1mbito
err\:XQTY0086=Se ha encontrado un valor sensible a espacios de nombres que no es v\u00E1lido en el modo ''no-preserve'': {0}

########## Standard serialization exceptions ###########################################
err\:SENR0001=Entrada no v\u00E1lida al serializador: los atributos y espacios de nombres no se pueden serializar directamente
err\:SESU0007="{0}" no es una codificaci\u00F3n soportada en esta JVM
err\:SESU0011=El formato de normalizaci\u00F3n "{0}" no est\u00E1 soportado
err\:SERE0008=La codificaci\u00F3n especificada {0} no puede codificar el texto "{1}"
err\:SEPM0004=Es un error especificar el par\u00E1metro doctype-system o especificar el par\u00E1metro standalone con un valor que no sea omit, si la instancia del modelo de datos contiene nodos de texto o varios nodos de elemento como secundarios del nodo ra\u00EDz
err\:SEPM0009=Si "omit-xml-declaration" tiene un valor "Yes" (o true), "standalone" debe tener el valor OMIT
err\:SEPM0016a=El valor del par\u00E1metro "{0}" no est\u00E1 soportado
err\:SEPM0016b=El valor del par\u00E1metro "{0}" no est\u00E1 soportado. Los valores v\u00E1lidos son: {1}
err\:SEPM0016c=El par\u00E1metro "{0}" no est\u00E1 soportado
err\:SEPM0016d=El m\u00E9todo especificado {0} produce una salida binaria que no se puede escribir como caracteres
err\:SEPM0016e=El valor de la propiedad doctype-system no puede contener un ap\u00F3strofe y una comilla

########## Standard XQUF exceptions ###########################################
err\:XUST0001=Uso no v\u00E1lido de la expresi\u00F3n de actualizaci\u00F3n (o secuencial)
err\:XUST0002=Se necesita una expresi\u00F3n de actualizaci\u00F3n
err\:XUST0003=El pr\u00F3logo no puede contener m\u00E1s de una declaraci\u00F3n de revalidaci\u00F3n
err\:XUTY0004=La secuencia de inserci\u00F3n de una expresi\u00F3n de inserci\u00F3n contiene un nodo de atributo despu\u00E9s de un nodo que no es un nodo de atributo
err\:XUTY0005=En una expresi\u00F3n de inserci\u00F3n en la que se especifica into, as first into o as last into, la expresi\u00F3n de destino puede no devolver un resultado no vac\u00EDo que no consta de un solo nodo de elemento o documento
err\:XUTY0006=En una expresi\u00F3n de inserci\u00F3n en la que se especifica before o after, la expresi\u00F3n de destino no puede devolver un resultado no vac\u00EDo que no conste de un solo nodo de elemento, texto, comentario o instrucci\u00F3n de procesamiento
err\:XUTY0007=La expresi\u00F3n de destino de una expresi\u00F3n de supresi\u00F3n debe devolver una secuencia de cero o m\u00E1s nodos
err\:XUTY0008=En una expresi\u00F3n de sustituci\u00F3n, la expresi\u00F3n de destino debe devolver un resultado no vac\u00EDo que consta de un solo nodo de elemento, atributo, texto, comentario o instrucci\u00F3n de procesamiento
err\:XUDY0009=En una expresi\u00F3n de sustituci\u00F3n en la que no se especifica el valor of, el nodo devuelto por la expresi\u00F3n de destino debe tener un principal
err\:XUTY0010=En una expresi\u00F3n de sustituci\u00F3n en la que no se especifica el valor of y el destino es un nodo de elemento, texto, comentario o instrucci\u00F3n de procesamiento, la secuencia de sustituci\u00F3n debe constar de cero o m\u00E1s nodos de elemento, texto, comentario o instrucci\u00F3n de procesamiento.
err\:XUTY0011=En una expresi\u00F3n de sustituci\u00F3n en la que no se especifica el valor of y el destino es un nodo de atributo, la secuencia de sustituci\u00F3n debe constar de cero o m\u00E1s nodos de atributo
err\:XUTY0012=En una expresi\u00F3n de cambio de nombre, el destino debe devolver un solo nodo de elemento, atributo o instrucci\u00F3n de procesamiento
err\:XUTY0013=En una expresi\u00F3n de transformaci\u00F3n, es un error de tipo si una expresi\u00F3n de origen de la cl\u00E1usula copy no devuelve un solo nodo
err\:XUDY0014=En una expresi\u00F3n de transformaci\u00F3n, es un error din\u00E1mico si la cl\u00E1usula modify modifica cualquier nodo que no se ha creado con la cl\u00E1usula copy
err\:XUDY0015=Un nodo es el destino de m\u00E1s de una expresi\u00F3n de cambio de nombre en la misma consulta
err\:XUDY0016=Un nodo es el destino de m\u00E1s de una expresi\u00F3n de sustituci\u00F3n (sin especificar el valor of) en la misma consulta
err\:XUDY0017=Un nodo es el destino de m\u00E1s de una expresi\u00F3n de sustituci\u00F3n con el valor of en la misma consulta
err\:XUDY0018=Una funci\u00F3n que se ha declarado como externa pero sin actualizaci\u00F3n devuelve una lista de actualizaciones pendientes no vac\u00EDa
err\:XUDY0019=Una funci\u00F3n que se ha declarado como externa y de actualizaci\u00F3n devuelve una instancia de modelo de datos no vac\u00EDa
err\:XUDY0021=Las actualizaciones generar\u00E1n un elemento, {0}, con m\u00E1s de un atributo denominado {1}
err\:XUTY0022=Una expresi\u00F3n de inserci\u00F3n especifica la inserci\u00F3n de un nodo de atributo en un nodo de documento
err\:XUDY0023=Una expresi\u00F3n de inserci\u00F3n, sustituci\u00F3n o cambio de nombre introduce el prefijo "{0}" enlazado al URI "{1}" que entra en conflicto con un enlace existente a "{2}"
err\:XUDY0024=Un juego de expresiones de actualizaci\u00F3n introduce un enlace de espacio de nombres en conflicto para el prefijo "{0}" y URI "{1}" y "{2}"
err\:XUST0026=Una declaraci\u00F3n de revalidaci\u00F3n en un pr\u00F3logo especifica un modo de revalidaci\u00F3n no soportado
err\:XUDY0027=La expresi\u00F3n de destino de inserci\u00F3n, sustituci\u00F3n o cambio de nombre se eval\u00FAa en una secuencia vac\u00EDa
err\:XUST0028=Una funci\u00F3n de actualizaci\u00F3n no puede especificar un tipo de retorno
err\:XUDY0029=En una expresi\u00F3n de inserci\u00F3n en la que no se especifica before o after, el nodo devuelto por la expresi\u00F3n de destino debe tener un principal
err\:XUDY0030=Una expresi\u00F3n de inserci\u00F3n no puede especificar la inserci\u00F3n de un nodo de atributo antes o despu\u00E9s de un secundario de un nodo de documento
err\:XUDY0031=Varias llamadas a fn:put en la misma instant\u00E1nea no pueden especificar el mismo URI (despu\u00E9s de la resoluci\u00F3n de URI relativos)
err\:FOUP0001=El primer operando de fn:put no es un tipo de nodo soportado
err\:FOUP0002=El segundo operando de fn:put ({0}) no es v\u00E1lido como xs:anyURI 

########## Standard XQSX exceptions ###########################################
err\:SXST0002=No se pueden mezclar operandos de actualizaci\u00F3n y secuenciales en una expresi\u00F3n
err\:SXDY0003=Es un error din\u00E1mico si, despu\u00E9s de aplicar actualizaciones, el valor enlazado a cualquier variable de \u00E1mbito no coincide con el tipo est\u00E1tico de dicha variable seg\u00FAn las reglas de coincidencia de tipo de secuencia. Tipo no v\u00E1lido: {0}. Se esperaba: {1}
err\:SXST0005=Es un error est\u00E1tico si dos o m\u00E1s variables declaradas en la misma expresi\u00F3n de bloque tiene el mismo QName ampliado: {0}
err\:SXTY0006=Variable no inicializada: {0}  
err\:SXST0007=Variable no asignada: {0}
err\:SXST0008=Categor\u00EDa no v\u00E1lida de una expresi\u00F3n de cuerpo de funci\u00F3n: {0}. Se esperaba: {1}
err\:SXST0009=Valor no v\u00E1lido para la opci\u00F3n ''xqsx:query-mode'': {0}. Se esperaba: ''sequential'' o ''simple''

########## Oracle-specific type exceptions #######################################

ora-err\:TBDTYPE=TBD TYPE: {0}
ora-err\:TYPE001="{0}": tipo no encontrado
ora-err\:TYPE002="{0}": no se puede convertir a {1} para la asignaci\u00F3n a {2}
ora-err\:TYPE003=El tipo de tiempo de ejecuci\u00F3n no coincide
ora-err\:TYPE003a=El tipo de tiempo de ejecuci\u00F3n no coincide: se ha obtenido un valor xdt:untypedAtomic
ora-err\:XPTY0004a=El operador "{0}" no se aplica a argumentos de tipo {1} y {2}
ora-err\:XPTY0004b=Se ha encontrado un tipo que no coincide en la expresi\u00F3n. Solo una secuencia vac\u00EDa cumple las reglas de comprobaci\u00F3n de tipos. Tipo esperado: {0}. Tipo real: {1}
ora-err\:XPTY0004d=No se puede aplicar el operador "{0}" en valores de tipo {1} y {2}
ora-err\:XPTY0004e=Tipo est\u00E1tico no v\u00E1lido: {0}
ora-err\:XPTY0004f="{0}": valor incorrecto para el tipo {1}
ora-err\:XPTY0004g=Elementos no comparables: los tipos son "{0}" y "{1}"
ora-err\:XPTY0004h=Tipo de nodo inesperado: {0}

########## Oracle-specific update exceptions #####################################

ora-err\:UPD001=Fallo de actualizaci\u00F3n: se ha realizado un rollback: {1}
ora-err\:UPD002=Fallo de actualizaci\u00F3n: compensado: {1}
ora-err\:UPD003=Fallo de actualizaci\u00F3n: resultado mixto, error de actualizaci\u00F3n distribuido (updateid={0}): {1}
ora-err\:UPD004=Actualizaci\u00F3n pendiente recuperada debido a un fallo del sistema (updateid={0})

########## Oracle-specific mutator exceptions ####################################
# Note: ChoiceFormat options should be translated.

ora-err\:MUT001=El elemento que se va a actualizar ({0}) debe tener un tipo complejo, pero el tipo encontrado es "{1}"
ora-err\:MUT002=El tipo del valor transferido como argumento ({0}) no coincide con el tipo de {1,choice,0#element|1#attribute} "{2}" ({3})
ora-err\:MUT003=Se ha declarado que {0,choice,0#Element|1#Attribute} "{1}" tiene un tipo at\u00F3mico simple ("{2}"), pero el valor insertado es una lista
ora-err\:MUT004=No se ha podido compilar la ruta de acceso "{0}": {1}
ora-err\:MUT005=La XPath "{0}" no ha seleccionado ning\u00FAn nodo
ora-err\:MUT006=La XPath "{0}" ha seleccionado m\u00E1s de un nodo
ora-err\:MUT007=No se ha podido construir una XPath que seleccione el nodo principal para la XPath "{0}"
ora-err\:MUT008=Ning\u00FAn nodo principal para la selecci\u00F3n: {0}
ora-err\:MUT009=M\u00E1s de un nodo principal para la selecci\u00F3n: {0}
ora-err\:MUT010=No se puede insertar un valor at\u00F3mico porque no se puede determinar el punto de inserci\u00F3n; utilice un nodo de elemento o atributo en su lugar
ora-err\:MUT011=El argumento "path" ("{0}") debe apuntar a un elemento con contenido complejo para que la inserci\u00F3n sea posible
ora-err\:MUT012=No se ha encontrado ning\u00FAn {0,choice,0#element|1#attribute}" con el nombre "{1}" en el tipo "{2}" o declarado globalmente
ora-err\:MUT013=Se ha declarado que el elemento "{0}" es un tipo simple ("{1}"), pero el elemento insertado no tiene contenido simple
ora-err\:MUT014={0,choice,0#Element|1#Attribute} "{1}" ya existe
ora-err\:MUT015=Fallo de la conversi\u00F3n XToken<->SDO: {0}
ora-err\:MUT016=El elemento cuyo valor se va sustituir ("{0}") debe tener un tipo simple o complejo con contenido simple, tipo encontrado: {1}
ora-err\:MUT017=La ruta de acceso "{0}" se ha indexado, pero el correspondiente {1,choice,0#element|1#attribute} ("{2}") no puede aparecer m\u00E1s de una vez
ora-err\:MUT018=Se ha transferido una lista, pero el tipo de {0,choice,0#element|1#attribute} "{1}" ("{2}") no es un tipo de lista
ora-err\:MUT019=La XPath utilizada como argumento debe ser relativa: {0}
ora-err\:MUT020=No se ha podido convertir el valor "{0}" al tipo "{1}" para {2,choice,0#element|1#attribute} "{3}"

