# Default (English) exception messages.
#
# See XQuery*Exception.java for Java-language codes corresponding to these
# QNames.

########## Standard dynamic exceptions ########################################

err\:XPDY0002={0}: udefinert dynamisk kontekstverdi
err\:XQDY0025={0}: duplisert attributt
err\:XQDY0026=Behandlingsinstruksjonen kan ikke inneholde ?>
err\:XQDY0027=Validering mislyktes: {0}
err\:XQST0040={0}: duplisert attributt
err\:XQDY0041=Kan ikke tilordne til NCName: {0}
err\:XQDY0044=Ugyldig attributtnavn
err\:XPDY0050=Den dynamiske typen samsvarer ikke med typen som er angitt i tr\u00E5duttrykket: {0}
err\:XQDY0061=Ugyldig innhold p\u00E5 dokumentknutepunkt
err\:XQDY0062=Ikke oppfylt skranke p\u00E5 dokumentknutepunkt
err\:XQDY0064=Navnet p\u00E5 beregnet behandlingsinstruksjon kan ikke v\u00E6re XML
err\:XQDY0072=Beregnet kommentar kan ikke inneholde -- eller slutte med -
err\:XQDY0074=Kan ikke utvide QName: {0}
err\:XQDY0084=Finner ikke elementet {0} med deklarasjonene for elementtype i omfang
err\:XQDY0096=Navnet som er gitt til den beregnede elementkonstrukt\u00F8ren, er ikke gyldig
err\:FOAR0001=Divider med null
err\:FOAR0002={0}: numerisk over-/underflyt
err\:FOCA0001={0}: kan ikke tilordne til desimal
err\:FOCA0002={0}: ugyldig leksikalsk verdi
err\:FOCA0004={0}: kan ikke tilordne til heltall
err\:FOCA0005=NaN er angitt som flyt-/dobbelverdi
err\:FOCH0001=Ugyldig kodepunkt: {0}
err\:FOCH0002={0}: sortering st\u00F8ttes ikke
err\:FOCH0003={0}: normaliseringsformat st\u00F8ttes ikke
err\:FOCH0004={0}: upassende sortering for denne funksjonen
err\:FODC0001=Ikke noe kontekstdokument
err\:FODC0002=Feil under henting av ressursen {0}: {1}
err\:FODC0004={0}: ugyldig argument til fn:collection()
err\:FODC0005={0}: ugyldig argument til fn:doc()
err\:FODT0001=Overflyt i dato-/klokkeslettaritmetikk
err\:FODT0002=Overflyt/underflyt i varighetsoperasjon
err\:FODT0003={0}: ugyldig tidssone
err\:FOER0000=Uidentifisert feil
err\:FONS0003={0}: prefiks ikke definert i statisk kontekst
err\:FONS0004={0}: finner ikke navneomr\u00E5det for dette prefikset
err\:FONS0005=Basis-URI er ikke definert
err\:FORG0001={0}: ugyldig verdi for tilordning/konstrukt\u00F8r: {1}
err\:FORG0002={0}: ugyldig argument til fn:resolve-uri()
err\:FORG0003=forventet null eller ett element, fikk to eller flere elementer
err\:FORG0004=forventet ett eller flere elementer, fikk null elementer
err\:FORG0005=forventet n\u00F8yaktig ett element, fikk {0} elementer
err\:FORG0006={0}: Ugyldig argumenttype
err\:FORG0008=Begge argumentene til fn:dateTime har en angitt tidssone: {0} og {1}
err\:FORG0009=fn:resolve-uri() kalt med ikke-absolutt basis-URI {0}
err\:FORX0001=Ugyldige flagg for regul\u00E6re uttrykk
err\:FORX0002={0}: ugyldig regul\u00E6rt uttrykk
err\:FORX0003=Regul\u00E6rt uttrykk samsvarer med streng med null-lengde: {0}
err\:FORX0004={0}: ugyldig erstatningsstreng
err\:FOTY0011=Kontekstelementet er ikke et knutepunkt

########## Oracle-specific dynamic exceptions ####################################

ora-err\:TBDDYNAMIC=TBD DYNAMIC: {0}
ora-err\:XPDY0002a=Kontekstelement er n\u00F8dvendig, men ikke definert (eller $ mangler f\u00F8r et variabelnavn)
ora-err\:XPDY0002b={0}: ubundet ekstern variabel
ora-err\:XPDY0002c={0}: ugyldig dokument-URI
ora-err\:XQDY0027a=Finner ikke attributtet {0} for validering
ora-err\:XQDY0027b=Finner ikke elementet {0} for validering
ora-err\:ENT001=Kan ikke l\u00F8se URI-en {0}: ukjent skjema
ora-err\:FODC0002a=Feil ved analyse av XML-inndata {0} {1}.
ora-err\:FODC0002b=Feil ved analyse av XML-inndata: En StAX-mark\u00F8r kan bare brukes \u00E9n gang
ora-err\:FODC0002c=Standardsamling ikke definert
ora-err\:FO0001={0}: ugyldig argument til funksjonen {1}
ora-err\:FO0002={0}: har ikke det forventede formatet {1}
ora-err\:NS0001={0}: prefikset er allerede bundet til {1}
ora-err\:FOUD0001=Prosedyren {0} ble startet med ufullstendige inndata
ora-err\:MEM0001=Foresp\u00F8rselen m\u00E5 ha {0} minneadministrerte operatorer, men bare {1} er tilgjengelige

########## Standard static exceptions #########################################

err\:FONC0001=udefinert kontekstelement
err\:XPST0001={0}: statisk kontekstverdi udefinert
err\:XPST0003=Ugyldig uttrykk: {0}
err\:XPST0005=Kan ikke tilordne en type som er tom
err\:XPST0008=Finner ikke navnet {0} i statisk kontekst
err\:XPST0051={0}: typen er udefinert eller ikke atomisk
err\:XQST0009=Skjemaimportfunksjonen st\u00F8ttes ikke
err\:XPST0010=Funksjonen for fullstendig akse st\u00F8ttes ikke
err\:XQST0012=Ugyldig skjema, {0}. {1}
err\:XQST0013=Ugyldig pragmainnhold. {0}
err\:XQST0014=Ugyldig utvidelsesinnhold. {0}
err\:XQST0016=Modulfunksjonen st\u00F8ttes ikke
err\:XPST0017={0}: ukjent funksjon (eller antallet argumenter ({1}) er feil) {2}
err\:XQST0022=Attributtet for navneomr\u00E5dedeklarasjon m\u00E5 v\u00E6re en strengkonstant
err\:XQST0031={0}: Versjonen st\u00F8ttes ikke
err\:XQST0032={0}: duplisert deklarasjon for basis-URI
err\:XQST0033={0}: duplisert deklarasjon for navneomr\u00E5deprefiks
err\:XQST0034={0}: funksjon allerede deklarert eller importert
err\:XQST0035={0}: navn tidligere importert
err\:XQST0038={0}: ukjente eller flere sorteringer
err\:XQST0039={0}: duplisert funksjonsparameternavn
err\:XQST0045=Funksjonen {0} er deklarert i reservert navneomr\u00E5de: {1}
err\:XQST0046={0}: ugyldig URI
err\:XQST0047={0}: duplisert m\u00E5lnavneomr\u00E5de
err\:XQST0048={0}: navnet m\u00E5 v\u00E6re i modulm\u00E5lnavneomr\u00E5det: {1}
err\:XQST0049={0}: duplisert variabelnavn
err\:XQST0054=Deklarasjonen for {0} har et initialiseringsuttrykk som er direkte eller indirekte avhengig av {0}: ({1})
err\:XQST0055=Flere deklarasjoner av kopierte navneomr\u00E5der
err\:XQST0056={0}: M\u00E5lnavneomr\u00E5det brukes i importmodulen
err\:XQST0057=En skjemaimport kan ikke binde et prefiks n\u00E5r navneomr\u00E5det er tomt
err\:XQST0058={0}: duplisert m\u00E5lnavneomr\u00E5de
err\:XQST0059=Finner ikke skjemaet eller modulen
err\:XQST0060={0}: Funksjonsnavnet kan ikke ha et tomt navneomr\u00E5de
err\:XQST0065=Flere deklarasjoner av standardrekkef\u00F8lge
err\:XQST0066=Flere deklarasjoner av standard element/type/funksjonsnavneomr\u00E5de
err\:XQST0067=Flere deklarasjoner av standardkonstruksjon
err\:XQST0068=Flere deklarasjoner av grenseomr\u00E5de
err\:XQST0069=Sp\u00F8rringsprologen kan ikke inneholde flere enn \u00E9n tom rekkef\u00F8lgedeklarasjon.
err\:XQST0070=Ugyldig navneomr\u00E5dedeklarasjon.
err\:XQST0071={0}: duplisert attributt for navneomr\u00E5dedeklarasjon
err\:XQST0075=Valideringsfunksjonen st\u00F8ttes ikke
err\:XQST0076={0}: ukjent sortering
err\:XQST0077={0}: ukjent pragma
err\:XQST0078={0}: ukjent alternativ
err\:XQST0079=Ugyldig utvidelse. {0}
err\:XPST0080=M\u00E5ltypen for en tilordning eller et uttrykk som kan tilordnes, er xs:NOTATION eller xs:anyAtomicType
err\:XPST0081=Prefikset {0} som brukes i det kvalifiserte navnet {1}, kan ikke l\u00F8ses
err\:XQST0085=Tom navneomr\u00E5dedeklarasjon for prefikset: {0}
err\:XQST0087=Kodingen {0} i versjonsdeklarasjonen er ikke gyldig
err\:XQST0088=Ugyldig tomt m\u00E5lnavneomr\u00E5de i modulimport eller deklarasjon
err\:XQST0089=Variabelen {0} som er bundet inn for leddet, har det samme utvidede QName som den tilknyttede posisjonsvariabelen
err\:XQST0090=Verdien {0} er ikke en gyldig tegnreferanse i XML 1.0
err\:XQST0093=Sirkelmodulimport. Deklarasjonen for {0} har et initialiseringsuttrykk som er direkte eller indirekte avhengig av {0}: ({1})

########## Oracle-specific static exceptions #####################################

ora-err\:XPST0003a=Ikke samsvar i XML-sluttkode: {1} samsvarer ikke med {0}
ora-err\:XPST0003b=Ugyldig bruk av {0}-uttrykk. {1}
ora-err\:XPST0003c=Syntaksfeil. {0} er uventet
ora-err\:XPST0003d=Syntaksfeil
ora-err\:XPST0005a=Knutepunkttesten {0} samsvarer ikke med noen knutepunkt fra den tilh\u00F8rende inndatasekvensen av typen: {1}
ora-err\:XPST0008a=Variabelen {0} er brukt, men ikke deklarert
ora-err\:XPST0017a={0}: ubundet ekstern funksjon. {1}
ora-err\:XQST0059a=Finner ikke XML-skjemaet {0}. {1}.
ora-err\:XQST0059b=Finner ikke bibliotekmodulen {0}. {1}.
ora-err\:XQST0059c=Ugyldig XML-skjema, {0}. {1}
ora-err\:XQST0059d=Ugyldig bibliotekmodul, {0}. {1}
ora-err\:EXT0001={0}: er ikke et gjenkjent pragma
ora-err\:EXT0002=Pragmaet {0} kan bare brukes rundt en knutepunktkonstrukt\u00F8r for element eller attributt
ora-err\:FUNC002=Ugyldig bruk av bivirkningsprosedyren {0} med ariteten {1}. Bivirkningsprosedyrer kan ikke startes fra en kontekst uten bivirkninger
ora-err\:FUNC003=Fant et funksjonskall, og resultatene av det forkastes
ora-err\:VAR002=${0}: ikke initialisert variabel

########## Oracle-specific system exceptions #####################################

ora-err\:TBDSYSTEM=TBD SYSTEM: {0}
ora-err\:SYS001=Denne funksjonen er ikke implementert. {0}
ora-err\:SYS002=Et bibliotekunntak ble oppfanget: 
ora-err\:SYS003=Uventet unntak
ora-err\:SYS004=Kj\u00F8retidsavbrudd
ora-err\:SYS005=Sp\u00F8rringen ble avsluttet av brukerforesp\u00F8rsel
ora-err\:SYS006=Funksjonen {0} er rekursivt: dette st\u00F8ttes ikke
ora-err\:SYS007=Ugyldig kontekstkonfigurasjon
ora-err\:SYS008=Duplisert kontekst-URI, {0}
ora-err\:SYS009=Pr\u00F8ver \u00E5 binde den eksterne funksjonen {0} til ariteten {1}, men finner ikke denne funksjonen
ora-err\:SYS010=Sp\u00F8rringen ble avsluttet av administratorforesp\u00F8rsel
ora-err\:SYS011=Sp\u00F8rringen ble avbrutt p\u00E5 grunn av brukerangitt tidsavbrudd
ora-err\:SYS012=Sp\u00F8rringen ble avbrutt p\u00E5 grunn av transaksjonstidsavbrudd
ora-err\:SYS013=Transaksjonen (xid={0}) tilbakestilt.
ora-err\:SYS014=Ikke utvidet entitetsreferanse i DOM
ora-err\:SYS015=Ugyldige inndata: DOM-knutepunkt m\u00E5 ha navneomr\u00E5de aktivert. Hvis du bruker en DOM-analysator, m\u00E5 du kontrollere at egenskapen for aktivering av navneomr\u00E5de er satt til sann (se javax.xml.parsers.DocumentBuilderFactory#setNamespaceAware(boolean)). Hvis du bygger DOM ved hjelp av opprettelsesmetodene, m\u00E5 du kontrollere at metodeversjonene med navneomr\u00E5de aktivert brukes (for eksempel org.w3c.dom.Document#createElementNS(String, String)) 
ora-err\:SYS016=DOM-knutepunkt m\u00E5 v\u00E6re sammenlignbare. org.w3c.dom.Node.compareDocumentPosition(.) returnerte {0} for knutepunktene {1} og {2} 
ora-err\:SYS017=Avventende SDOM PageManagerPool er ikke angitt
ora-err\:SYS018=Det er ikke st\u00F8tte for \u00E5 gi nytt navn til et DOM-behandlingsinstruksjonsknutepunkt
ora-err\:SYS019=DOM-implementeringer der org.w3c.dom.Document.renameNode(...) oppretter et nytt knutepunkt, st\u00F8ttes ikke for rename-uttrykk for XQuery-oppdatering
ora-err\:SYS020=Alternativdeklarasjonen {0} := {1} er ugyldig
ora-err\:SYS021=Det oppstod en feil ved evaluering av den dynamiske sp\u00F8rringen: {0}.
ora-err\:SYS022=Medietypen st\u00F8ttes ikke eller er ugyldig: {0}
ora-err\:SYS023=Ugyldig spr\u00E5kprofil: {0}
ora-err\:SYS024=Ugyldige data ble returnert fra utviklerangitt SPI-implementering. {0}
ora-err\:SYS025=Den angitte DOM-bindingen er ikke gyldig. DOM-knutepunkt av typen Entity, Notation, EntityReference og DocumentType kan ikke modelleres som XDM
ora-err\:SYS026=Den angitte DOM-bindingen er ikke gyldig. Tom tekst og CDATASection-knutepunkt kan ikke bindes med mindre de ikke har noen overordnet
ora-err\:SYS027=Den angitte DOM-bindingen er ikke gyldig. Et tekstknutepunkt kan ikke bindes hvis det har en tilst\u00F8tende sideordnet som ogs\u00E5 er tekst
ora-err\:SYS028=Den angitte DOM-bindingen er ikke gyldig. Implementeringen m\u00E5 st\u00F8tte DOM-niv\u00E5 3 (Core og XML)
ora-err\:SYS029=Alternativdeklarasjonen {0} gjenkjennes ikke
ora-err\:SYS030=Verdien {1} st\u00F8ttes ikke for alternativdeklarasjonen {0}
ora-err\:SYS031=For Java-funksjonsbindinger m\u00E5 et klassenavn angis ved hjelp av alternativet {0}
ora-err\:SYS032=Finner ikke det angitte klassenavnet: {0}
ora-err\:SYS033=Kan ikke starte den angitte klassen: {0}
ora-err\:SYS034=Det oppstod en feil under initialisering av argumenter til funksjonskallet {0}
ora-err\:SYS035=Det oppstod en feil ved fors\u00F8k p\u00E5 \u00E5 starte den brukerdefinerte statiske metoden {0}: {1}
ora-err\:SYS036=Det oppstod en feil under behandling av resultatet av den brukerdefinerte statiske metoden {0}: {1}
ora-err\:SYS037=Den l\u00F8ste brukerdefinerte funksjonen {0} m\u00E5 utvide {1}
ora-err\:SYS038=Det oppstod en feil under fors\u00F8k p\u00E5 \u00E5 l\u00F8se funksjonen {0}. {1}
ora-err\:SYS039=For funksjonen {0} returnerte entitetstolkeren den ikke-st\u00F8ttede funksjonsbindingstypen: {1}
ora-err\:SYS040=Denne sp\u00F8rringen ble klargjort bare for statisk analyse og kan ikke utf\u00F8res
ora-err\:SYS041=Funksjonen fn:put er ikke aktivert
ora-err\:SYS042=Finner ingen Java-metode som samsvarer med den angitte XQuery-funksjonssignaturen (manglende samsvar i navn, parameter eller returtype)
ora-err\:SYS043=Finner ikke den angitte metoden {0} i klassen {1}
ora-err\:SYS044=Ugyldig medietype: {0}
ora-err\:SYS045=Dokumententiteten er ugyldig: {0}
ora-err\:SYS046=Feil i feilleter: {0}
ora-err\:SYS047=Operasjonen kan ikke utf\u00F8res fordi forekomsten er lukket
ora-err\:SYS048=En bibliotekmodul kan ikke startes direkte i denne konteksten. En hovedmodul med en sp\u00F8rringstekst er n\u00F8dvendig
ora-err\:SYS049=Ikke samsvarende behandlingsmodus mellom en sp\u00F8rring og en bibliotekmodul eller mellom to bibliotekmoduler.
ora-err\:SYS050=Ingen tilgang. Oppdateringer er ikke aktivert
ora-err\:SYS051=Oppdateringer st\u00F8ttes ikke for denne typen datakilde
ora-err\:SYS052=SAX-bindinger m\u00E5 st\u00F8tte navneomr\u00E5defunksjonen
ora-err\:SYS053=Det er ikke mulig \u00E5 oppdatere to datakilder som refererer til de samme underliggende fysiske dataene, samtidig. Dette kan for eksempel skje hvis den samme DOM-forekomsten er bundet til sp\u00F8rringen flere ganger
ora-err\:SYS054=Sp\u00F8rrestrengdelen av sorterings-URI-en er ikke gyldig: {0}
ora-err\:SYS055=Den angitte sortereren st\u00F8tter ikke delstrengoperasjoner
ora-err\:SYS056=Uventet relativ URI: {0}
ora-err\:SYS057=Dokument-URI-ene som returneres for samlingen, m\u00E5 v\u00E6re unike: {0}
ora-err\:SYS058=Konfigurasjonen for omgj\u00F8ring av opplysningssett er ikke st\u00F8ttet. Opprettholdelse av ubetydelige blanktegn mens betydelige blanktegn forkastes, st\u00F8ttes ikke for \u00F8yeblikket.
ora-err\:SYS059=Den angitte DOM-bindingen er ikke gyldig. DocumentFragment-knutepunkt m\u00E5 ha n\u00F8yaktig ett underordnet element
ora-err\:SYS060=en forekomst av XQStaticContext som er hentet fra et sp\u00F8rringsuttrykk, kan ikke brukes til \u00E5 klargj\u00F8re andre uttrykk
ora-err\:XDBC001=XDBC-feil: {0}

########## Standard type exceptions ###########################################

err\:XPTY0004=Ugyldig type: {0}
err\:FOTY0012=fn:data() brukt p\u00E5 kompleks type med ikke-blandet komplekst innhold, {0}
err\:XPTY0018=Det siste trinnet i baneuttrykket kan ikke inneholde b\u00E5de knutepunkt og atomiske verdier
err\:XPTY0019=Et trinn i baneuttrykket kan ikke v\u00E6re en atomisk type
err\:XPTY0020=Kontekstelementet i akseuttrykket er ikke et knutepunkt
err\:XQTY0023=Elementkonstrukt\u00F8ren kan ikke inneholde et dokumentknutepunkt
err\:XQTY0024=Elementkonstrukt\u00F8ren m\u00E5 ha attributtknutepunkt f\u00F8r andre
err\:XQTY0030=Argument for valideringsuttrykk m\u00E5 v\u00E6re ett dokument eller element
err\:XQST0036=Typen {0} fra den importerte modulen {1} finnes ikke i skjemadefinisjonene i omfanget
err\:XQTY0086=Fant navneomr\u00E5desensitiv verdi som er ugyldig i Ikke behold-modus: {0}

########## Standard serialization exceptions ###########################################
err\:SENR0001=Ugyldige inndata til serialiserer: Attributter og navneomr\u00E5der kan ikke serialiseres direkte
err\:SESU0007={0} er ikke en koding som st\u00F8ttes i denne JVM-en
err\:SESU0011=Normaliseringsformatet {0} st\u00F8ttes ikke
err\:SERE0008=Den angitte kodingen {0} kan ikke kode teksten {1}
err\:SEPM0004=Det er en feil \u00E5 angi parameteren doctype-system eller \u00E5 angi den frittst\u00E5ende parameteren med en annen verdi enn utelatelse hvis forekomsten av datamodellen inneholder tekstknutepunkt eller flere elementknutepunkt som underordnet av rotknutepunktet
err\:SEPM0009=Hvis omit-xml-declaration har verdien Yes (eller sann), m\u00E5 standalone ha verdien OMIT
err\:SEPM0016a=Parameterverdien {0} st\u00F8ttes ikke
err\:SEPM0016b=Parameterverdien {0} st\u00F8ttes ikke. Gyldige verdier er: {1}
err\:SEPM0016c=Parameteren {0} st\u00F8ttes ikke
err\:SEPM0016d=Den angitte metoden {0} produserer bin\u00E6re utdata som ikke kan skrives som tegn
err\:SEPM0016e=Verdien for egenskapen doctype-system kan ikke inneholde b\u00E5de en apostrof og et anf\u00F8rselstegn

########## Standard XQUF exceptions ###########################################
err\:XUST0001=Ugyldig bruk av oppdateringsuttrykk (sekvensielt uttrykk)
err\:XUST0002=Et oppdateringsuttrykk er n\u00F8dvendig
err\:XUST0003=Prologen kan ikke inneholde flere enn \u00E9n deklarasjon for ny validering
err\:XUTY0004=Innsettingssekvensen i insert-uttrykket inneholder et attributtknutepunkt etter et knutepunkt som ikke er et attributtknutepunkt
err\:XUTY0005=I et insert-uttrykk der i, som f\u00F8rst i eller som sist i, er angitt, kan ikke m\u00E5luttrykket returnere et resultat som ikke er tomt, som ikke best\u00E5r av ett enkelt element- eller dokumentknutepunkt
err\:XUTY0006=I et insert-uttrykk der det er angitt f\u00F8r eller etter, kan ikke m\u00E5luttrykket returnere et resultat som ikke er tomt, som ikke best\u00E5r av ett enkelt element-, tekst-, kommentar- eller behandlingsinstruksjonsknutepunkt
err\:XUTY0007=M\u00E5luttrykket for et delete-uttrykk m\u00E5 returnere en sekvens med null eller flere knutepunkt
err\:XUTY0008=I et replace-uttrykk m\u00E5 m\u00E5luttrykket returnere et resultat som ikke er tomt, som best\u00E5r av ett enkelt element-, attributt-, tekst-, kommentar- eller behandlingsinstruksjonsknutepunkt
err\:XUDY0009=I et replace-uttrykk der verdien for er ikke er angitt, m\u00E5 knutepunktet som returneres av m\u00E5luttrykket, ha et overordnet knutepunkt
err\:XUTY0010=I et replace-uttrykk der verdien for er ikke er angitt, og m\u00E5let er et element-, tekst-, kommentar- eller behandlingsinstruksjonsknutepunkt, m\u00E5 erstatningssekvensen best\u00E5 av null eller flere element-, tekst-, kommentar- eller behandlingsinstruksjonsknutepunkt
err\:XUTY0011=I et replace-uttrykk der verdien for er ikke er angitt og m\u00E5let er et attributtknutepunkt, m\u00E5 erstatningssekvensen best\u00E5 av null eller flere attributtknutepunkt
err\:XUTY0012=I et rename-uttrykk m\u00E5 m\u00E5luttrykket returnere ett enkelt element-, attributt- eller behandlingsinstruksjonsknutepunkt
err\:XUTY0013=I et transform-uttrykk er det en typefeil hvis et kildeutrykk i copy-leddet ikke returnerer ett enkelt knutepunkt
err\:XUDY0014=I et transform-uttrykk er det en dynamisk feil hvis modify-leddet endrer noen knutepunkt som ikke ble opprettet av copy-leddet
err\:XUDY0015=Et knutepunkt er m\u00E5let for mer enn ett rename-uttrykk i den samme sp\u00F8rringen
err\:XUDY0016=Et knutepunkt er m\u00E5let for mer enn ett replace-uttrykk (uten at verdien for er angitt) i den samme sp\u00F8rringen
err\:XUDY0017=Et knutepunkt er m\u00E5let for mer enn \u00E9n replace-verdi for uttrykk i den samme sp\u00F8rringen
err\:XUDY0018=En funksjon som ble deklarert som ekstern, men ikke som en oppdateringsfunksjon, returnerer en liste som ikke er tom, som venter p\u00E5 oppdatering
err\:XUDY0019=En funksjon som ble deklarert som b\u00E5de ekstern og som en oppdateringsfunksjon, returnerer en forekomst av en datamodell som ikke er tom
err\:XUDY0021=Oppdateringer vil f\u00F8re til et element, {0}, med flere attributter med navnet {1}
err\:XUTY0022=Et insert-uttrykk angir innsettingen av et attributtknutepunkt i et dokumentknutepunkt
err\:XUDY0023=Et insert-, replace- eller rename-uttrykk introduserer prefikset {0}, som er bundet til URI-en {1}, som er i konflikt med en eksisterende binding til {2}
err\:XUDY0024=Et sett med oppdateringsuttrykk introduserer en motstridende navneomr\u00E5debinding for prefikset {0} og URI-ene {1} og {2}
err\:XUST0026=En deklarasjon om ny validering i prologen angir en modus for ny validering som ikke st\u00F8ttes
err\:XUDY0027=M\u00E5luttrykket for et insert-, replace- eller rename-uttrykk evalueres til en tom sekvens
err\:XUST0028=En oppdateringsfunksjon kan ikke angi en returtype
err\:XUDY0029=I et insert-uttrykk der f\u00F8r eller etter er angitt, m\u00E5 knutepunktet som returneres av m\u00E5luttrykket, ha en overordnet
err\:XUDY0030=Et insert-uttrykk kan ikke angi innsettingen av et attributtknutepunkt f\u00F8r eller etter en underordnet for et dokumentknutepunkt
err\:XUDY0031=Flere kall til fn:put i det samme stillbildet kan ikke angi den samme URI-en (etter l\u00F8sning av relative URI-er)
err\:FOUP0001=Den f\u00F8rste operanden i fn:put er ikke et knutepunkt av den typen som st\u00F8ttes
err\:FOUP0002=Den andre operanden i fn:put  ({0}) er ikke gyldig som xs:anyURI 

########## Standard XQSX exceptions ###########################################
err\:SXST0002=Kan ikke blande b\u00E5de oppdateringsoperander og sekvensielle operander i et uttrykk
err\:SXDY0003=Det er en dynamisk feil hvis verdien som er bundet til en variabel i omfanget, etter bruk av oppdateringer ikke samsvarer med den statiske typen for denne variabelen i henhold til samsvarsreglene for SequenceType. Ugyldig type: {0}. Forventet: {1}
err\:SXST0005=Det er en statisk feil hvis to eller flere variabler som er deklarert i det samme blokkuttrykket, har samme utvidede QName: {0}.
err\:SXTY0006=Ikke initialisert variabel: {0}  
err\:SXST0007=Variabel som ikke kan tilordnes: {0}
err\:SXST0008=Ugyldig kategori i et funksjonstekstuttrykk: {0}. Forventet: {1}
err\:SXST0009=Ugyldig verdi for alternativet xqsx:query-mode: {0}. Forventet: sequential eller simple

########## Oracle-specific type exceptions #######################################

ora-err\:TBDTYPE=TBD TYPE: {0}
ora-err\:TYPE001={0}: finner ikke typen
ora-err\:TYPE002={0}: kan ikke tilordne til {1} for tilordning til {2}
ora-err\:TYPE003=Ikke samsvarende kj\u00F8retidstype
ora-err\:TYPE003a=Ikke samsvarende kj\u00F8retidstype: fikk en uventet verdi for xdt:untypedAtomic
ora-err\:XPTY0004a=Operatoren {0} gjelder ikke for argumenter av typen {1} og {2}
ora-err\:XPTY0004b=Fant manglende typesamsvar i uttrykk. Bare tom sekvens oppfyller reglene for typekontroll. Forventet type: {0}. Faktisk type: {1}
ora-err\:XPTY0004d=Kan ikke bruke operatoren {0} p\u00E5 verdier av typen {1} og {2}
ora-err\:XPTY0004e=Ugyldig statisk type: {0}
ora-err\:XPTY0004f={0}: ugyldig verdi for typen {1}
ora-err\:XPTY0004g=Elementer kan ikke sammenlignes: typene er {0} og {1}
ora-err\:XPTY0004h=Uventet knutepunkttype: {0}

########## Oracle-specific update exceptions #####################################

ora-err\:UPD001=Oppdateringsfeil: tilbakestilt: {1}
ora-err\:UPD002=Oppdateringsfeil: kompensert: {1}
ora-err\:UPD003=Oppdateringsfeil: blandet resultat, oppdateringsfeil sendt (updateid={0}): {1}
ora-err\:UPD004=Gjenopprettet ventende oppdatering p\u00E5 grunn av systemkrasj (updateid={0})

########## Oracle-specific mutator exceptions ####################################
# Note: ChoiceFormat options should be translated.

ora-err\:MUT001=Elementet som skal oppdateres ({0}), m\u00E5 ha en kompleks type, men typen som ble funnet, er {1}
ora-err\:MUT002=Verditypen som ble sendt inn som argument ({0}), samsvarer ikke med typen for {1,choice,0#element|1#attribute} {2} ({3})
ora-err\:MUT003={0,choice,0#Element|1#Attribute} {1} er deklarert til \u00E5 ha en enkelt atomisk type ({2}), men den innsatte verdien er en liste
ora-err\:MUT004=Kan ikke kompilere banen {0}: {1}
ora-err\:MUT005=XPath {0} valgte ingen knutepunkt
ora-err\:MUT006=XPath {0} valgte flere knutepunkt
ora-err\:MUT007=Kan ikke bygge en XPath som velger det overordnede knutepunktet for XPath {0}
ora-err\:MUT008=Ingen overordnede knutepunkt for valg: {0}
ora-err\:MUT009=Flere overordnede knutepunkt for valg: {0}
ora-err\:MUT010=Kan ikke sette inn en atomisk verdi fordi innsettingspunktet ikke kan fastsettes. Bruk et element- eller attributtknutepunkt i stedet
ora-err\:MUT011=Baneargumentet ({0}) m\u00E5 peke til et element med komplekst innhold for at innsettingen skal v\u00E6re mulig
ora-err\:MUT012=Fant ingen {0,choice,0#element|1#attribute} med navnet {1} i typen {2} eller globalt deklarert
ora-err\:MUT013=Elementet {0} er deklarert til \u00E5 v\u00E6re av en enkel type ({1}), men det innsatte elementet har ikke enkelt innhold
ora-err\:MUT014={0,choice,0#Element|1#Attribute} {1} finnes allerede
ora-err\:MUT015=XToken<->SDO-omgj\u00F8ring mislyktes: {0}
ora-err\:MUT016=Elementet som har verdien som skal erstattes ({0}), m\u00E5 ha en enkel type eller kompleks type med enkelt innhold, fant typen: {1}
ora-err\:MUT017=Banen {0} ble indeksert, men tilsvarende {1,choice,0#element|1#attribute} ({2}) kan ikke forekomme flere ganger
ora-err\:MUT018=En liste er sendt inn, men typen for {0,choice,0#element|1#attribute} {1} ({2}) er ikke en listetype
ora-err\:MUT019=XPath som brukes som argument, m\u00E5 v\u00E6re relativ: {0}
ora-err\:MUT020=Kan ikke omgj\u00F8re verdien {0} til typen {1} for {2,choice,0#element|1#attribute} {3}

