# Default (English) exception messages.
#
# See XQuery*Exception.java for Java-language codes corresponding to these
# QNames.

########## Standard dynamic exceptions ########################################

err\:XPDY0002="{0}": valor de contexto din\u00E2mico indefinido
err\:XQDY0025="{0}": atributo duplicado
err\:XQDY0026=A instru\u00E7\u00E3o de processamento n\u00E3o pode conter "?>"
err\:XQDY0027=Falha de valida\u00E7\u00E3o: {0}
err\:XQST0040="{0}": atributo duplicado
err\:XQDY0041=N\u00E3o \u00E9 poss\u00EDvel converter em NCName: {0}
err\:XQDY0044=nome de atributo ilegal
err\:XPDY0050=O tipo din\u00E2mico n\u00E3o corresponde ao tipo especificado pela express\u00E3o treat: {0}
err\:XQDY0061=conte\u00FAdo de n\u00F3 de documento ilegal
err\:XQDY0062=Restri\u00E7\u00E3o de n\u00F3 de documento n\u00E3o satisfeita
err\:XQDY0064=O nome da instru\u00E7\u00E3o de processamento computada n\u00E3o pode ser "XML"
err\:XQDY0072=O coment\u00E1rio computado n\u00E3o pode conter "--" ou terminar com "-"
err\:XQDY0074=N\u00E3o \u00E9 poss\u00EDvel expandir: {0}
err\:XQDY0084=N\u00E3o \u00E9 poss\u00EDvel localizar o elemento "{0}" usando as declara\u00E7\u00F5es do tipo de elemento no escopo
err\:XQDY0096=O nome fornecido ao construtor de elemento computado n\u00E3o \u00E9 v\u00E1lido
err\:FOAR0001=Dividir por zero
err\:FOAR0002="{0}": over/underflow num\u00E9rico
err\:FOCA0001="{0}": n\u00E3o \u00E9 poss\u00EDvel converter em decimal
err\:FOCA0002="{0}": valor l\u00E9xico inv\u00E1lido
err\:FOCA0004="{0}": n\u00E3o \u00E9 poss\u00EDvel converter em n\u00FAmero inteiro
err\:FOCA0005=NaN fornecido para valor flutuante/duplo
err\:FOCH0001=C\u00F3digo inv\u00E1lido: {0}
err\:FOCH0002="{0}": compara\u00E7\u00E3o n\u00E3o suportada
err\:FOCH0003="{0}": forma de normaliza\u00E7\u00E3o n\u00E3o suportada
err\:FOCH0004="{0}": compara\u00E7\u00E3o inadequada para esta fun\u00E7\u00E3o
err\:FODC0001=Sem documento de contexto
err\:FODC0002=Erro ao recuperar recurso "{0}": {1}
err\:FODC0004="{0}": argumento inv\u00E1lido para fn:collection()
err\:FODC0005="{0}": argumento inv\u00E1lido para fn:doc()
err\:FODT0001=Overflow em aritm\u00E9tica de data/hora
err\:FODT0002=Overflow/underflow em opera\u00E7\u00E3o de dura\u00E7\u00E3o
err\:FODT0003="{0}": fuso hor\u00E1rio inv\u00E1lido
err\:FOER0000=Erro n\u00E3o identificado
err\:FONS0003="{0}": prefixo n\u00E3o definido no contexto est\u00E1tico
err\:FONS0004="{0}": namespace n\u00E3o encontrado para este prefixo
err\:FONS0005=O URI base n\u00E3o foi definido
err\:FORG0001="{0}": valor inv\u00E1lido para convers\u00E3o/construtor: {1}
err\:FORG0002="{0}": argumento inv\u00E1lido para fn:resolve-uri()
err\:FORG0003=esperava-se zero ou um item, mas foi obtido dois ou mais itens
err\:FORG0004=esperava-se um ou mais itens, mas foi obtido zero item
err\:FORG0005=esperava-se exatamente um item, mas foi obtido {0} itens
err\:FORG0006="{0}": Tipo de argumento inv\u00E1lido
err\:FORG0008=Ambos os argumentos para fn:dateTime t\u00EAm um fuso hor\u00E1rio especificado: "{0}" e "{1}"
err\:FORG0009=fn:resolve-uri() chamado com URI base n\u00E3o absoluto "{0}"
err\:FORX0001=Flags de express\u00E3o regular inv\u00E1lida
err\:FORX0002="{0}": express\u00E3o regular inv\u00E1lida
err\:FORX0003=A express\u00E3o regular corresponde \u00E0 string de comprimento zero: "{0}"
err\:FORX0004="{0}": string de substitui\u00E7\u00E3o inv\u00E1lida
err\:FOTY0011=O item de contexto n\u00E3o \u00E9 um n\u00F3

########## Oracle-specific dynamic exceptions ####################################

ora-err\:TBDDYNAMIC=TBD DYNAMIC: {0}
ora-err\:XPDY0002a=Item de contexto necess\u00E1rio, mas n\u00E3o definido (ou est\u00E1 faltando '$' antes de um nome de vari\u00E1vel)
ora-err\:XPDY0002b="{0}": vari\u00E1vel externa desassociada
ora-err\:XPDY0002c="{0}": URI de documento inv\u00E1lido
ora-err\:XQDY0027a=Atributo "{0}" n\u00E3o encontrado para valida\u00E7\u00E3o
ora-err\:XQDY0027b=Elemento "{0}" n\u00E3o encontrado para valida\u00E7\u00E3o
ora-err\:ENT001=N\u00E3o \u00E9 poss\u00EDvel resolver o URI "{0}": Esquema desconhecido
ora-err\:FODC0002a=Erro ao fazer parse do XML de entrada "{0}" {1}
ora-err\:FODC0002b=Erro ao fazer parse do XML de entrada: Um cursor StAX s\u00F3 pode ser usado uma vez
ora-err\:FODC0002c=Conjunto padr\u00E3o n\u00E3o definido
ora-err\:FO0001="{0}": argumento inv\u00E1lido para a fun\u00E7\u00E3o {1}
ora-err\:FO0002="{0}": n\u00E3o est\u00E1 no formato esperado {1}
ora-err\:NS0001="{0}": prefixo j\u00E1 associado a {1}
ora-err\:FOUD0001=O procedimento {0} foi chamado com uma entrada incompleta"
ora-err\:MEM0001=A solicita\u00E7\u00E3o requer {0} operadores gerenciados de mem\u00F3ria, mas apenas {1} est\u00E3o dispon\u00EDveis

########## Standard static exceptions #########################################

err\:FONC0001=item de contexto n\u00E3o definido
err\:XPST0001="{0}": valor de contexto est\u00E1tico n\u00E3o definido
err\:XPST0003=Express\u00E3o inv\u00E1lida: {0}
err\:XPST0005=N\u00E3o \u00E9 poss\u00EDvel designar um tipo que est\u00E1 vazio
err\:XPST0008=Nome "{0}" n\u00E3o encontrado no contexto est\u00E1tico
err\:XPST0051="{0}": tipo indefinido ou n\u00E3o at\u00F4mico
err\:XQST0009=Recurso de importa\u00E7\u00E3o de esquema n\u00E3o suportado
err\:XPST0010=Recurso de eixo completo n\u00E3o suportado
err\:XQST0012=Esquema inv\u00E1lido {0}. {1}
err\:XQST0013=Conte\u00FAdo de pragma inv\u00E1lido. {0}
err\:XQST0014=Conte\u00FAdo de extens\u00E3o inv\u00E1lido. {0}
err\:XQST0016=Recurso de m\u00F3dulo n\u00E3o suportado
err\:XPST0017="{0}": fun\u00E7\u00E3o desconhecida (ou o n\u00FAmero de argumentos ({1}) est\u00E1 errado) {2}
err\:XQST0022=O atributo de declara\u00E7\u00E3o de namespace deve ser um literal de string
err\:XQST0031="{0}": vers\u00E3o n\u00E3o suportada
err\:XQST0032="{0}": declara\u00E7\u00E3o de URI base duplicada
err\:XQST0033="{0}": declara\u00E7\u00E3o de prefixo de namespace duplicado
err\:XQST0034="{0}": fun\u00E7\u00E3o j\u00E1 declarada ou importada
err\:XQST0035="{0}": nome anteriormente importado
err\:XQST0038="{0}": compara\u00E7\u00F5es desconhecidas ou m\u00FAltiplas
err\:XQST0039="{0}": nome de par\u00E2metro de fun\u00E7\u00E3o duplicado
err\:XQST0045=A fun\u00E7\u00E3o "{0}" foi declarada em namespace reservado: "{1}"
err\:XQST0046="{0}": URI ilegal
err\:XQST0047="{0}": namespace de destino duplicado
err\:XQST0048="{0}": o nome deve estar no namespace de destino de m\u00F3dulo: "{1}"
err\:XQST0049="{0}": nome de vari\u00E1vel duplicado
err\:XQST0054=A declara\u00E7\u00E3o para "{0}" tem uma express\u00E3o de inicializa\u00E7\u00E3o que direta ou indiretamente depende de "{0}": ({1})
err\:XQST0055=M\u00FAltiplas declara\u00E7\u00F5es de namespaces de c\u00F3pia
err\:XQST0056="{0}": namespace de destino usado pelo m\u00F3dulo de importa\u00E7\u00E3o
err\:XQST0057=Uma importa\u00E7\u00E3o de esquema n\u00E3o pode vincular um prefixo quando o namespace est\u00E1 vazio
err\:XQST0058="{0}": namespace de destino duplicado
err\:XQST0059=N\u00E3o foi poss\u00EDvel localizar o esquema ou m\u00F3dulo
err\:XQST0060="{0}": o nome da fun\u00E7\u00E3o n\u00E3o pode ter namespace vazio
err\:XQST0065=M\u00FAltiplas declara\u00E7\u00F5es de ordena\u00E7\u00E3o padr\u00E3o
err\:XQST0066=M\u00FAltiplas declara\u00E7\u00F5es de namespace de elemento/tipo/fun\u00E7\u00E3o padr\u00E3o
err\:XQST0067=M\u00FAltiplas declara\u00E7\u00F5es de constru\u00E7\u00E3o padr\u00E3o
err\:XQST0068=M\u00FAltiplas declara\u00E7\u00F5es de espa\u00E7o limite
err\:XQST0069=O pr\u00F3logo da consulta n\u00E3o pode conter mais de uma declara\u00E7\u00E3o de ordem vazia.
err\:XQST0070=Declara\u00E7\u00E3o de namespace inv\u00E1lida.
err\:XQST0071="{0}": atributo de declara\u00E7\u00E3o de namespace duplicado
err\:XQST0075=Recurso de valida\u00E7\u00E3o n\u00E3o suportado
err\:XQST0076="{0}": compara\u00E7\u00E3o desconhecida
err\:XQST0077="{0}": pragma desconhecido
err\:XQST0078="{0}": op\u00E7\u00E3o desconhecida
err\:XQST0079=Extens\u00E3o inv\u00E1lida. {0}
err\:XPST0080=O tipo de destino de uma convers\u00E3o ou express\u00E3o que pode ser convertida \u00E9 xs:NOTATION ou xs:anyAtomicType
err\:XPST0081=O prefixo "{0}" usado no nome qualificado "{1}" n\u00E3o pode ser resolvido
err\:XQST0085=Declara\u00E7\u00E3o de namespace vazia para o prefixo: "{0}"
err\:XQST0087=A codifica\u00E7\u00E3o "{0}" na declara\u00E7\u00E3o de vers\u00E3o n\u00E3o \u00E9 v\u00E1lida
err\:XQST0088=Namespace de destino vazio na importa\u00E7\u00E3o ou declara\u00E7\u00E3o de m\u00F3dulo
err\:XQST0089=A vari\u00E1vel "{0}" associada na cl\u00E1usula for tem o mesmo QName expandido que sua vari\u00E1vel posicional associada
err\:XQST0090=O valor "{0}" n\u00E3o \u00E9 uma refer\u00EAncia de caractere v\u00E1lida em XML 1.0
err\:XQST0093=Importa\u00E7\u00F5es de m\u00F3dulo circular. A declara\u00E7\u00E3o para "{0}" tem uma express\u00E3o de inicializa\u00E7\u00E3o que direta ou indiretamente depende de "{0}": ({1})

########## Oracle-specific static exceptions #####################################

ora-err\:XPST0003a=Tag XML de fim incompat\u00EDvel: "{1}" n\u00E3o corresponde a "{0}"
ora-err\:XPST0003b=uso ilegal da express\u00E3o "{0}". {1}
ora-err\:XPST0003c=Erro de sintaxe. "{0}" \u00E9 inesperado
ora-err\:XPST0003d=Erro de sintaxe
ora-err\:XPST0005a=O teste de n\u00F3 "{0}" n\u00E3o corresponde a nenhum n\u00F3 de sua sequ\u00EAncia de entrada do tipo: {1}
ora-err\:XPST0008a=Vari\u00E1vel "${0}" usada, mas n\u00E3o declarada
ora-err\:XPST0017a="{0}": fun\u00E7\u00E3o externa desassociada. {1}
ora-err\:XQST0059a=N\u00E3o foi poss\u00EDvel encontrar o esquema XML {0}. {1}
ora-err\:XQST0059b=N\u00E3o foi poss\u00EDvel encontrar o m\u00F3dulo de biblioteca {0}. {1}
ora-err\:XQST0059c=Esquema XML inv\u00E1lido {0}. {1}
ora-err\:XQST0059d=M\u00F3dulo de biblioteca inv\u00E1lido {0}. {1}
ora-err\:EXT0001="{0}" n\u00E3o \u00E9 um pragma reconhecido
ora-err\:EXT0002=O pragma "{0}" s\u00F3 pode ser usado para um construtor de n\u00F3 de elemento ou atributo
ora-err\:FUNC002=Uso ilegal do procedimento side-effect {0} com paridade {1}. Procedimentos side-effect n\u00E3o podem ser chamados em um contexto livre de side-effect
ora-err\:FUNC003=Foi encontrada uma chamada de fun\u00E7\u00E3o, cujos resultados est\u00E3o sendo descartados
ora-err\:VAR002="${0}": vari\u00E1vel n\u00E3o inicializada

########## Oracle-specific system exceptions #####################################

ora-err\:TBDSYSTEM=TBD SYSTEM: {0}
ora-err\:SYS001=Essa funcionalidade n\u00E3o foi implementada. {0}
ora-err\:SYS002=Exce\u00E7\u00E3o de biblioteca capturada: 
ora-err\:SYS003=Exce\u00E7\u00E3o inesperada
ora-err\:SYS004=Interrup\u00E7\u00E3o de runtime
ora-err\:SYS005=Consulta encerrada por solicita\u00E7\u00E3o do usu\u00E1rio
ora-err\:SYS006=A fun\u00E7\u00E3o {0} \u00E9 recursiva; isso n\u00E3o \u00E9 suportado.
ora-err\:SYS007=Configura\u00E7\u00E3o de contexto inv\u00E1lida
ora-err\:SYS008=URI de contexto duplicado {0}
ora-err\:SYS009=Tentando vincular a fun\u00E7\u00E3o externa {0} com paridade {1}, mas essa fun\u00E7\u00E3o n\u00E3o pode ser encontrada
ora-err\:SYS010=Consulta encerrada por solicita\u00E7\u00E3o do administrador
ora-err\:SYS011=Consulta encerrada devido a timeout especificado pelo usu\u00E1rio
ora-err\:SYS012=Consulta encerrada devido a timeout de transa\u00E7\u00E3o
ora-err\:SYS013=Transa\u00E7\u00E3o (xid={0}) revertida.
ora-err\:SYS014=Refer\u00EAncia de entidade n\u00E3o expandida no DOM
ora-err\:SYS015=Entrada ilegal: Os n\u00F3s DOM devem reconhecer namespace. Se estiver sendo usado um parser do DOM, verifique se a propriedade de reconhecimento de namespace est\u00E1 definida como "true" (consulte javax.xml.parsers.DocumentBuilderFactory#setNamespaceAware(boolean)). No caso de constru\u00E7\u00E3o do DOM usando os m\u00E9todos de cria\u00E7\u00E3o, verifique se as vers\u00F5es dos m\u00E9todos com reconhecimento de namespace s\u00E3o usadas (por exemplo, org.w3c.dom.Document#createElementNS(String, String)) 
ora-err\:SYS016=Os n\u00F3s DOM devem ser compar\u00E1veis.  org.w3c.dom.Node.compareDocumentPosition(.) retornou "{0}" para os n\u00F3s "{1}" e "{2}" 
ora-err\:SYS017=O PageManagerPool lento do SDOM n\u00E3o foi definido
ora-err\:SYS018=A renomea\u00E7\u00E3o de uma instru\u00E7\u00E3o de processamento do DOM n\u00E3o \u00E9 suportada
ora-err\:SYS019=As implementa\u00E7\u00F5es do DOM, onde org.w3c.dom.Document.renameNode(...) cria um novo n\u00F3, n\u00E3o s\u00E3o suportadas para express\u00F5es de renomea\u00E7\u00E3o de Atualiza\u00E7\u00E3o de XQuery
ora-err\:SYS020=A declara\u00E7\u00E3o de op\u00E7\u00E3o {0} := "{1}" \u00E9 inv\u00E1lida
ora-err\:SYS021=Ocorreu um erro ao avaliar a consulta din\u00E2mica: {0}
ora-err\:SYS022=Tipo de m\u00EDdia n\u00E3o suportado ou inv\u00E1lido: {0}
ora-err\:SYS023=Perfil de idioma inv\u00E1lido: {0}
ora-err\:SYS024=Dados inv\u00E1lidos retornados da implementa\u00E7\u00E3o de SPI fornecida pelo desenvolvedor. {0}
ora-err\:SYS025=A vincula\u00E7\u00E3o de DOM especificada n\u00E3o \u00E9 v\u00E1lida. Os n\u00F3s DOM Entity, Notation, EntityReference e DocumentType n\u00E3o podem ser modelados como XDM
ora-err\:SYS026=A vincula\u00E7\u00E3o de DOM especificada n\u00E3o \u00E9 v\u00E1lida. Os n\u00F3s Texto e CDATASection vazios n\u00E3o podem ser associados, a menos que n\u00E3o tenham pais
ora-err\:SYS027=A vincula\u00E7\u00E3o de DOM especificada n\u00E3o \u00E9 v\u00E1lida. Um n\u00F3 Texto n\u00E3o poder\u00E1 ser associado se tiver um irm\u00E3o adjacente que tamb\u00E9m seja Texto
ora-err\:SYS028=O irm\u00E3o do DOM especificado n\u00E3o \u00E9 v\u00E1lido. A implementa\u00E7\u00E3o deve suportar DOM n\u00EDvel 3 (Principal e XML)
ora-err\:SYS029=A declara\u00E7\u00E3o de op\u00E7\u00E3o "{0}" n\u00E3o foi reconhecida
ora-err\:SYS030=Para a declara\u00E7\u00E3o de op\u00E7\u00E3o {0}, o valor "{1}" n\u00E3o \u00E9 suportado
ora-err\:SYS031=Para vincula\u00E7\u00F5es de fun\u00E7\u00E3o Java, um nome de classe deve ser especificado usando a op\u00E7\u00E3o {0}
ora-err\:SYS032=O nome de classe especificado n\u00E3o p\u00F4de ser encontrado: {0}
ora-err\:SYS033=A classe especificada n\u00E3o p\u00F4de ser instanciada: {0}
ora-err\:SYS034=Ocorreu um erro ao inicializar argumentos para a chamada de fun\u00E7\u00E3o {0}
ora-err\:SYS035=Ocorreu um erro ao tentar chamar o m\u00E9todo est\u00E1tico definido pelo usu\u00E1rio {0} : {1}
ora-err\:SYS036=Ocorreu um erro ao processar o resultado de um m\u00E9todo est\u00E1tico definido pelo usu\u00E1rio {0} : {1}
ora-err\:SYS037=A fun\u00E7\u00E3o resolvida {0} definida pelo usu\u00E1rio deve estender {1}
ora-err\:SYS038=Ocorreu um erro ao tentar resolver a fun\u00E7\u00E3o {0}. {1}
ora-err\:SYS039=Para a fun\u00E7\u00E3o {0}, o resolvedor de entidade retornou um tipo de vincula\u00E7\u00E3o de fun\u00E7\u00E3o n\u00E3o suportado: "{1}"
ora-err\:SYS040=Esta consulta foi preparada para an\u00E1lise est\u00E1tica somente e n\u00E3o pode ser executada
ora-err\:SYS041=A fun\u00E7\u00E3o fn:put n\u00E3o foi ativada
ora-err\:SYS042=N\u00E3o \u00E9 poss\u00EDvel encontrar o m\u00E9todo Java que corresponde \u00E0 assinatura de fun\u00E7\u00E3o XQuery especificada (nome, par\u00E2metro ou tipo de retorno incompat\u00EDvel)
ora-err\:SYS043=N\u00E3o \u00E9 poss\u00EDvel localizar o m\u00E9todo "{0}" especificado da classe "{1}"
ora-err\:SYS044=Tipo de m\u00EDdia inv\u00E1lida: {0}
ora-err\:SYS045=A entidade de documento \u00E9 inv\u00E1lida: {0}
ora-err\:SYS046=Erro do depurador: {0}
ora-err\:SYS047=N\u00E3o \u00E9 poss\u00EDvel executar a opera\u00E7\u00E3o porque a inst\u00E2ncia est\u00E1 fechada
ora-err\:SYS048=Um m\u00F3dulo de biblioteca n\u00E3o pode ser chamado diretamente neste contexto. Um m\u00F3dulo principal com um corpo de consulta \u00E9 necess\u00E1rio.
ora-err\:SYS049=Incompatibilidade de modo de processamento entre uma consulta e um m\u00F3dulo de biblioteca ou entre dois m\u00F3dulos de biblioteca.
ora-err\:SYS050=Acesso negado. Atualiza\u00E7\u00F5es n\u00E3o est\u00E3o ativadas.
ora-err\:SYS051=N\u00E3o s\u00E3o suportadas atualiza\u00E7\u00F5es para este tipo de origem de dados.
ora-err\:SYS052=Vincula\u00E7\u00F5es SAX devem suportar o recurso de namespaces
ora-err\:SYS053=N\u00E3o \u00E9 poss\u00EDvel atualizar simultaneamente duas origens de dados que referenciam os mesmos dados f\u00EDsicos b\u00E1sicos. Por exemplo, isso poder\u00E1 acontecer se a mesma inst\u00E2ncia do DOM for associada \u00E0 consulta diversas vezes.
ora-err\:SYS054=A parte da string de consulta referente ao URI de compara\u00E7\u00E3o n\u00E3o \u00E9 v\u00E1lida: {0}
ora-err\:SYS055=O collator especificado n\u00E3o suporta opera\u00E7\u00F5es de substring
ora-err\:SYS056=URI relativo inesperado: {0}
ora-err\:SYS057=Os URIs de documento retornados para o conjunto devem ser exclusivos: {0}
ora-err\:SYS058=A configura\u00E7\u00E3o de convers\u00E3o do conjunto de informa\u00E7\u00F5es n\u00E3o \u00E9 suportada. A preserva\u00E7\u00E3o de espa\u00E7o em branco insignificante ao descartar espa\u00E7o em branco significativo n\u00E3o \u00E9 suportada atualmente.
ora-err\:SYS059=A vincula\u00E7\u00E3o de DOM especificada n\u00E3o \u00E9 v\u00E1lida. Os n\u00F3s DocumentFragment devem ter exatamente um elemento filho
ora-err\:SYS060=uma inst\u00E2ncia XQStaticContext que foi obtida de uma express\u00E3o de consulta n\u00E3o pode ser utilizada para preparar outras express\u00F5es
ora-err\:XDBC001=Falha de XDBC: {0}

########## Standard type exceptions ###########################################

err\:XPTY0004=Tipo inv\u00E1lido: {0}
err\:FOTY0012=fn:data() aplicado a tipo complexo com conte\u00FAdo complexo n\u00E3o misto {0}
err\:XPTY0018=A \u00FAltima etapa na express\u00E3o de caminho n\u00E3o pode conter n\u00F3s e valores at\u00F4micos
err\:XPTY0019=A etapa na express\u00E3o de caminho n\u00E3o pode ser um tipo at\u00F4mico
err\:XPTY0020=O item de contexto na express\u00E3o de eixo n\u00E3o \u00E9 um n\u00F3
err\:XQTY0023=O construtor de elemento n\u00E3o pode conter um n\u00F3 de documento
err\:XQTY0024=O construtor de elemento deve ter n\u00F3s de atributo antes de outros
err\:XQTY0030=O argumento da express\u00E3o de valida\u00E7\u00E3o deve ser um documento ou elemento
err\:XQST0036=O tipo "{0}" do m\u00F3dulo importado "{1}" n\u00E3o foi encontrado nas defini\u00E7\u00F5es de esquema no escopo
err\:XQTY0086=Foi encontrado um valor com distin\u00E7\u00E3o de namespace que \u00E9 ilegal no modo ''no-preserve'': {0}

########## Standard serialization exceptions ###########################################
err\:SENR0001=Entrada inv\u00E1lida para o serializador: atributos e namespaces n\u00E3o podem ser serializados diretamente
err\:SESU0007="{0}" n\u00E3o \u00E9 uma codifica\u00E7\u00E3o suportada nesta JVM
err\:SESU0011=A normaliza\u00E7\u00E3o de "{0}" n\u00E3o \u00E9 suportada
err\:SERE0008=A codifica\u00E7\u00E3o especificada {0} n\u00E3o \u00E9 capaz de codificar o texto "{1}"
err\:SEPM0004=Ser\u00E1 um erro especificar o par\u00E2metro doctype-system, ou especificar o par\u00E2metro stand-alone com um valor diferente de omiss\u00E3o, se a inst\u00E2ncia do modelo de dados contiver n\u00F3s de texto ou diversos n\u00F3s de elemento como filhos do n\u00F3 raiz
err\:SEPM0009=Se "omit-xml-declaration" tiver um valor igual a "Yes" (ou true), "standalone" dever\u00E1 ter o valor OMIT
err\:SEPM0016a=O valor de par\u00E2metro "{0}" n\u00E3o \u00E9 suportado
err\:SEPM0016b=O valor de par\u00E2metro "{0}" n\u00E3o \u00E9 suportado. Os valores v\u00E1lidos s\u00E3o: {1}
err\:SEPM0016c=O par\u00E2metro "{0}" n\u00E3o \u00E9 suportado
err\:SEPM0016d=O m\u00E9todo especificado {0} gera sa\u00EDda bin\u00E1ria que n\u00E3o pode ser gravada como caracteres.
err\:SEPM0016e=O valor de propriedade doctype-system n\u00E3o pode conter um ap\u00F3strofo e aspas.

########## Standard XQUF exceptions ###########################################
err\:XUST0001=Uso ilegal da express\u00E3o de atualiza\u00E7\u00E3o (ou sequencial)
err\:XUST0002=Uma express\u00E3o de atualiza\u00E7\u00E3o \u00E9 necess\u00E1ria
err\:XUST0003=O pr\u00F3logo n\u00E3o pode conter mais de uma declara\u00E7\u00E3o de revalida\u00E7\u00E3o.
err\:XUTY0004=A sequ\u00EAncia de inser\u00E7\u00E3o da express\u00E3o de inser\u00E7\u00E3o cont\u00E9m um n\u00F3 de atributo que segue um n\u00F3 que n\u00E3o \u00E9 de atributo
err\:XUTY0005=Em uma express\u00E3o de inser\u00E7\u00E3o, na qual \u00E9 especificado inserir primeiro ou inserir por \u00FAltimo, a express\u00E3o de destino n\u00E3o pode retornar um resultado n\u00E3o vazio que n\u00E3o consista em um \u00FAnico n\u00F3 de documento ou elemento
err\:XUTY0006=Em uma express\u00E3o de inser\u00E7\u00E3o, na qual antes ou ap\u00F3s \u00E9 especificado, a express\u00E3o de destino n\u00E3o pode retornar um resultado n\u00E3o vazio que n\u00E3o consista em um \u00FAnico n\u00F3 de elemento, texto, coment\u00E1rio ou instru\u00E7\u00E3o de processamento
err\:XUTY0007=A express\u00E3o de destino de uma express\u00E3o de exclus\u00E3o deve retornar uma sequ\u00EAncia de zero ou mais n\u00F3s
err\:XUTY0008=Em uma express\u00E3o de substitui\u00E7\u00E3o, a express\u00E3o de destino deve retornar um resultado n\u00E3o vazio que consista em um \u00FAnico n\u00F3 de elemento, atributo, texto, coment\u00E1rio ou instru\u00E7\u00E3o de processamento
err\:XUDY0009=Em uma express\u00E3o de substitui\u00E7\u00E3o, na qual o valor n\u00E3o \u00E9 especificado, o n\u00F3 retornado pela express\u00E3o de destino deve ter um pai
err\:XUTY0010=Em uma express\u00E3o de substitui\u00E7\u00E3o, na qual o valor n\u00E3o \u00E9 especificado e o destino \u00E9 um n\u00F3 de elemento, texto, coment\u00E1rio ou instru\u00E7\u00E3o de processamento, a sequ\u00EAncia de substitui\u00E7\u00E3o deve consistir em zero ou mais n\u00F3s de elemento, texto, coment\u00E1rio ou instru\u00E7\u00E3o de processamento.
err\:XUTY0011=Em uma express\u00E3o de substitui\u00E7\u00E3o, na qual o valor n\u00E3o \u00E9 especificado e o destino \u00E9 um n\u00F3 de atributo, a sequ\u00EAncia de substitui\u00E7\u00E3o deve consistir em zero ou mais n\u00F3s de atributo
err\:XUTY0012=Em uma express\u00E3o de renomea\u00E7\u00E3o, o destino deve retornar um \u00FAnico n\u00F3 de elemento, atributo ou instru\u00E7\u00E3o de processamento
err\:XUTY0013=Em uma express\u00E3o de transforma\u00E7\u00E3o, ser\u00E1 um erro de tipo se uma express\u00E3o de origem na cl\u00E1usula copy n\u00E3o retornar um \u00FAnico n\u00F3.
err\:XUDY0014=Em uma express\u00E3o de transforma\u00E7\u00E3o, ser\u00E1 um erro din\u00E2mico se a cl\u00E1usula modify modificar qualquer n\u00F3 que n\u00E3o foi criado pela cl\u00E1usula copy
err\:XUDY0015=Um n\u00F3 \u00E9 o destino de mais de uma express\u00E3o de renomea\u00E7\u00E3o na mesma consulta
err\:XUDY0016=Um n\u00F3 \u00E9 o destino de mais de uma express\u00E3o de substitui\u00E7\u00E3o (sem o valor ser especificado) na mesma consulta.
err\:XUDY0017=Um n\u00F3 \u00E9 o destino de mais de um valor de substitui\u00E7\u00E3o da express\u00E3o na mesma consulta
err\:XUDY0018=Uma fun\u00E7\u00E3o que foi declarada como externa, mas n\u00E3o de atualiza\u00E7\u00E3o, retorna uma lista de atualiza\u00E7\u00F5es pendentes n\u00E3o vazia.
err\:XUDY0019=Uma fun\u00E7\u00E3o que foi declarada como externa e de atualiza\u00E7\u00E3o retorna uma inst\u00E2ncia de modelo de dados n\u00E3o vazia.
err\:XUDY0021=Atualiza\u00E7\u00F5es seriam retornadas em um elemento, {0}, com mais de um atributo com o nome {1}
err\:XUTY0022=Uma express\u00E3o de inser\u00E7\u00E3o especifica a inser\u00E7\u00E3o de um n\u00F3 de atributo em um n\u00F3 de documento
err\:XUDY0023=Uma express\u00E3o de inser\u00E7\u00E3o, substitui\u00E7\u00E3o ou renomea\u00E7\u00E3o introduz o prefixo "{0}" associado ao URI "{1}" que entra em conflito com uma vincula\u00E7\u00E3o existente para "{2}"
err\:XUDY0024=Um conjunto de express\u00F5es de atualiza\u00E7\u00E3o introduz uma vincula\u00E7\u00E3o de namespace em conflito para o prefixo "{0}" e os URIs "{1}" e "{2}"
err\:XUST0026=Uma declara\u00E7\u00E3o de revalida\u00E7\u00E3o no Pr\u00F3logo especifica um modo de revalida\u00E7\u00E3o que n\u00E3o \u00E9 suportado.
err\:XUDY0027=A express\u00E3o de destino de uma express\u00E3o de inser\u00E7\u00E3o, substitui\u00E7\u00E3o ou renomea\u00E7\u00E3o \u00E9 avaliada como uma sequ\u00EAncia vazia.
err\:XUST0028=Uma fun\u00E7\u00E3o de atualiza\u00E7\u00E3o n\u00E3o pode especificar um tipo de retorno
err\:XUDY0029=Em uma express\u00E3o de inser\u00E7\u00E3o, na qual antes ou ap\u00F3s \u00E9 especificado, o n\u00F3 retornado pela express\u00E3o de destino deve ter um pai
err\:XUDY0030=Uma express\u00E3o de inser\u00E7\u00E3o n\u00E3o pode especificar a inser\u00E7\u00E3o de um n\u00F3 de atributo antes ou ap\u00F3s o filho de um n\u00F3 de documento
err\:XUDY0031=Diversas chamadas para fn:put no mesmo snapshot n\u00E3o podem especificar o mesmo URI (ap\u00F3s a resolu\u00E7\u00E3o de URIs relativos)
err\:FOUP0001=O primeiro operando de fn:put n\u00E3o \u00E9 um tipo de n\u00F3 suportado
err\:FOUP0002=O segundo operando de fn:put ({0}) n\u00E3o \u00E9 v\u00E1lido como xs:anyURI 

########## Standard XQSX exceptions ###########################################
err\:SXST0002=N\u00E3o \u00E9 poss\u00EDvel misturar operandos de atualiza\u00E7\u00E3o e sequenciais em uma express\u00E3o
err\:SXDY0003=Ser\u00E1 um erro din\u00E2mico se, depois de aplicar atualiza\u00E7\u00F5es, o valor associado a qualquer vari\u00E1vel no escopo n\u00E3o corresponder ao tipo est\u00E1tico dessa vari\u00E1vel de acordo com as regras de correspond\u00EAncia SequenceType. Tipo inv\u00E1lido: {0}. Esperado: {1}
err\:SXST0005=Ser\u00E1 um erro est\u00E1tico se duas ou mais vari\u00E1veis declaradas na mesma express\u00E3o de bloco tiverem o mesmo QName expandido: {0}
err\:SXTY0006=Vari\u00E1vel n\u00E3o inicializada: {0}  
err\:SXST0007=Vari\u00E1vel n\u00E3o design\u00E1vel: {0}
err\:SXST0008=Categoria ilegal de uma express\u00E3o de corpo de fun\u00E7\u00E3o: {0}. Esperado: {1}
err\:SXST0009=Valor inv\u00E1lido para a op\u00E7\u00E3o ''xqsx:query-mode'': {0}. Esperado: ''sequential'' ou ''simple''.

########## Oracle-specific type exceptions #######################################

ora-err\:TBDTYPE=TBD TYPE: {0}
ora-err\:TYPE001="{0}": tipo n\u00E3o encontrado
ora-err\:TYPE002="{0}": n\u00E3o pode ser convertido em {1} para designa\u00E7\u00E3o a {2}
ora-err\:TYPE003=Incompatibilidade de Tipo de Runtime
ora-err\:TYPE003a=Incompatibilidade de Tipo de Runtime: foi obtido um valor xdt:untypedAtomic
ora-err\:XPTY0004a=O operador "{0}" n\u00E3o \u00E9 aplic\u00E1vel para argumentos do tipo {1} e {2}
ora-err\:XPTY0004b=Foi encontrada uma incompatibilidade de tipo na express\u00E3o. Somente uma sequ\u00EAncia vazia atende \u00E0s regras de verifica\u00E7\u00E3o de tipo. Tipo esperado: {0}. Tipo real: {1}
ora-err\:XPTY0004d=N\u00E3o \u00E9 poss\u00EDvel aplicar o operador "{0}" nos valores de tipo {1} e {2}
ora-err\:XPTY0004e=Tipo est\u00E1tico inv\u00E1lido: {0}
ora-err\:XPTY0004f="{0}": valor inv\u00E1lido para o tipo {1}
ora-err\:XPTY0004g=Itens n\u00E3o compar\u00E1veis: os tipos s\u00E3o "{0}" e "{1}"
ora-err\:XPTY0004h=Tipo de n\u00F3 inesperado: {0}

########## Oracle-specific update exceptions #####################################

ora-err\:UPD001=Falha de atualiza\u00E7\u00E3o: revertida: {1}
ora-err\:UPD002=Falha de atualiza\u00E7\u00E3o: compensada: {1}
ora-err\:UPD003=Falha de atualiza\u00E7\u00E3o: resultado misto, erro de atualiza\u00E7\u00E3o enviado (updateid={0}): {1}
ora-err\:UPD004=Recuperada atualiza\u00E7\u00E3o pendente devido a falha geral do sistema (updateid={0})

########## Oracle-specific mutator exceptions ####################################
# Note: ChoiceFormat options should be translated.

ora-err\:MUT001=O elemento a ser atualizado ({0}) deve ter um tipo complexo, mas o tipo encontrado \u00E9 "{1}"
ora-err\:MUT002=O tipo do valor especificado como argumento ({0}) n\u00E3o corresponde ao tipo do {1,choice,0#element|1#attribute} "{2}" ({3})
ora-err\:MUT003={0,choice,0#Element|1#Attribute} "{1}" \u00E9 declarado como tendo um tipo at\u00F4mico simples ("{2}"), mas o valor inserido \u00E9 uma lista
ora-err\:MUT004=N\u00E3o foi poss\u00EDvel compilar o caminho "{0}": {1}
ora-err\:MUT005=O XPath "{0}" n\u00E3o selecionou nenhum n\u00F3
ora-err\:MUT006=O XPath "{0}" selecionou mais de um n\u00F3
ora-err\:MUT007=N\u00E3o foi poss\u00EDvel construir um XPath que selecionasse o n\u00F3 pai do XPath "{0}"
ora-err\:MUT008=Nenhum n\u00F3 pai para a sele\u00E7\u00E3o {0}
ora-err\:MUT009=Mais de um n\u00F3 pai para a sele\u00E7\u00E3o {0}
ora-err\:MUT010=N\u00E3o \u00E9 poss\u00EDvel inserir um valor at\u00F4mico porque o ponto de inser\u00E7\u00E3o n\u00E3o pode ser determinado; use um n\u00F3 de elemento ou atributo em seu lugar.
ora-err\:MUT011=O argumento "path" ("{0}") deve apontar para um elemento com conte\u00FAdo complexo para que a inser\u00E7\u00E3o seja poss\u00EDvel
ora-err\:MUT012=Nenhum {0,choice,0#element|1#attribute}" com o nome "{1}" foi encontrado no tipo "{2}" ou globalmente declarado
ora-err\:MUT013=O elemento "{0}" foi declarado para ser de um tipo simples ("{1}"), mas o elemento inserido n\u00E3o tem conte\u00FAdo simples.
ora-err\:MUT014={0,choice,0#Element|1#Attribute} "{1}" j\u00E1 existe
ora-err\:MUT015=A convers\u00E3o XToken<->SDO falhou: {0}
ora-err\:MUT016=O elemento cujo valor deve ser substitu\u00EDdo ("{0}") deve ter um tipo simples ou um tipo complexo com conte\u00FAdo simples, mas o tipo encontrado foi {1}.
ora-err\:MUT017=O caminho "{0}" foi indexado, mas o {1,choice,0#element|1#attribute} ("{2}") correspondente n\u00E3o pode aparecer mais de uma vez.
ora-err\:MUT018=Uma lista foi especificada, mas o tipo do {0,choice,0#element|1#attribute} "{1}" ("{2}") n\u00E3o \u00E9 um tipo de lista
ora-err\:MUT019=O XPath usado como argumento deve ser relativo: {0}
ora-err\:MUT020=N\u00E3o foi poss\u00EDvel converter o valor "{0}" no tipo "{1}" para {2,choice,0#element|1#attribute} "{3}"

