/
/ $Header: wptg/xdk/src/java/xquery/resources/oracle/xml/xquery/exceptions/XQJExceptionMessages_ar.properties /generic/6 2014/04/17 03:34:44 gmolloy Exp $
/
/ XQMessages.txt
/
/ Copyright (c) Oracle Corporation 2000. All Rights Reserved.
/
/   NAME
/     XQMessages.properties
/
/   DESCRIPTION
/     <short description of component this file declares/defines>
/
/   NOTES
/     <other useful comments, qualifications, etc.>
/
/   MODIFIED   (MM/DD/YY)
/   morgiyan   04/28/11 - Fix a bug with context item not being allowed to be
/                         rebound in immediate mode
/   jspiegel   03/21/11 - Add debugger error message
/   morgiyan   03/17/11 - Add error for closing resources
/   morgiyan   02/20/11 - Add a missing error message re sequence being past
/                         the end
/   jspiegel   02/15/11 - Fix error message about not supporting any data
/                         source properties
/   morgiyan   01/21/11 - Add a new error message for XmlObjects getter
/   morgiyan   10/01/10 - Creation
/

#---------
# XQJ Errors (XQJ-0601 to XQJ-0900)
XQJ-0600 = \u0644\u0627 \u064A\u0645\u0643\u0646 \u0627\u0633\u062A\u062F\u0639\u0627\u0621 \u0627\u0644\u0623\u0633\u0644\u0648\u0628 XQSequence \u0648\u0641\u0642\u064B\u0627 \u0644\u062A\u0633\u0644\u0633\u0644\u0627\u062A \u063A\u064A\u0631 \u0642\u0627\u0628\u0644\u0629 \u0644\u0644\u062A\u0645\u0631\u064A\u0631
XQJ-0601 = \u0644\u0627 \u064A\u0645\u0643\u0646 \u0627\u0633\u062A\u062F\u0639\u0627\u0621 \u0627\u0644\u0623\u0633\u0644\u0648\u0628 \u062D\u064A\u062B \u062A\u0645 \u0625\u063A\u0644\u0627\u0642 \u0627\u0644\u062A\u0633\u0644\u0633\u0644
XQJ-0602 = \u062A\u0648\u062C\u062F \u062D\u0627\u062C\u0629 \u0644\u0623\u062D\u062F\u0649 \u0637\u0628\u0639\u0627\u062A oracle.xml.parser.v2.XMLNode
XQJ-0603 = \u0644\u0627 \u064A\u0645\u0643\u0646 \u0627\u0633\u062A\u062F\u0639\u0627\u0621 \u0627\u0644\u0623\u0633\u0644\u0648\u0628 \u062D\u064A\u062B \u062A\u0645 \u0625\u063A\u0644\u0627\u0642 \u0627\u0644\u062A\u0633\u0644\u0633\u0644 \u0627\u0644\u0645\u0648\u062C\u0648\u062F \u0628\u0627\u0644\u0630\u0627\u0643\u0631\u0629 \u0627\u0644\u0645\u062E\u0628\u0626\u064A\u0629
XQJ-0604 = \u062A\u0648\u062C\u062F \u062D\u0627\u062C\u0629 \u0644\u0623\u062D\u062F\u0649 \u0637\u0628\u0639\u0627\u062A OXQItem
XQJ-0605 = \u062A\u0648\u062C\u062F \u062D\u0627\u062C\u0629 \u0644\u0637\u0628\u0639\u0629 \u0645\u0646 \u0627\u0644\u0646\u0648\u0639 OXQItemType
XQJ-0606 = \u0644\u0627 \u064A\u062A\u0637\u0627\u0628\u0642 \u0627\u0644\u0646\u0648\u0639 \u0627\u0644\u0630\u064A \u062A\u0645 \u062A\u0645\u0631\u064A\u0631\u0647 \u0645\u0639 \u0627\u0644\u0646\u0648\u0639 \u0627\u0644\u0645\u062A\u0648\u0642\u0639
XQJ-0611 = \u0627\u0644\u0645\u0624\u0634\u0631 \u0644\u064A\u0633 \u0639\u0644\u0649 \u0627\u0644\u0639\u0646\u0635\u0631
XQJ-0612 = XQSequence: \u0627\u0644\u0639\u0646\u0635\u0631 \u0627\u0644\u062D\u0627\u0644\u064A \u0644\u064A\u0633 \u0645\u0646 \u0627\u0644\u0646\u0648\u0639 \u0627\u0644\u0645\u0637\u0644\u0648\u0628
XQJ-0613 = XQSequence: \u064A\u0645\u0643\u0646 \u0633\u062D\u0628 \u0627\u0644\u0639\u0646\u0635\u0631 \u0645\u0631\u0629 \u0648\u0627\u062D\u062F\u0629 \u0641\u0642\u0637 \u0645\u0646 \u062A\u0633\u0644\u0633\u0644 \u063A\u064A\u0631 \u0642\u0627\u0628\u0644 \u0644\u0644\u062A\u0645\u0631\u064A\u0631
XQJ-0614 = XQSequence: \u0639\u0646\u0635\u0631 \u0627\u0644\u0633\u064A\u0627\u0642 \u0644\u064A\u0633 \u0646\u0642\u0637\u0629 \u062A\u0648\u0635\u064A\u0644
XQJ-0615 = XQItem: \u0627\u0644\u0639\u0646\u0635\u0631 \u0644\u064A\u0633 \u0645\u0646 \u0627\u0644\u0646\u0648\u0639 \u0627\u0644\u0645\u0637\u0644\u0648\u0628
XQJ-0616 = XQItem: \u0627\u0644\u0639\u0646\u0635\u0631 \u0644\u064A\u0633 \u0646\u0642\u0637\u0629 \u062A\u0648\u0635\u064A\u0644
XQJ-0617 = \u0644\u0627 \u064A\u0645\u0643\u0646 \u0627\u0633\u062A\u062F\u0639\u0627\u0621 \u0627\u0644\u0623\u0633\u0644\u0648\u0628 \u062D\u064A\u062B \u062A\u0645 \u0625\u063A\u0644\u0627\u0642 \u0627\u0644\u0627\u062A\u0635\u0627\u0644
XQJ-0618 = XQPreparedExpression: \u062A\u0645 \u0625\u063A\u0644\u0627\u0642 \u0627\u0644\u062A\u0639\u0628\u064A\u0631
XQJ-0619 = \u0627\u0644\u0646\u0648\u0639 getStaticVariable \u0641\u064A XQPreparedExpression: \u0644\u0627 \u064A\u0648\u062C\u062F \u0645\u062A\u063A\u064A\u0631 \u062E\u0627\u0631\u062C\u064A \u064A\u062D\u0645\u0644 \u0627\u0644\u0627\u0633\u0645 \u0627\u0644\u0645\u062D\u062F\u062F \u0641\u064A \u0627\u0644\u0633\u064A\u0627\u0642 \u0627\u0644\u062B\u0627\u0628\u062A
XQJ-0620 = setQueryLanguageAndVersion \u0641\u064A XQConnection: ''{0}'' \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645
XQJ-0621 = setUpdatability \u0641\u064A XQConnection: ''{0}'' \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645
XQJ-0622 = bindItem \u0627\u0644\u0645\u0648\u062C\u0648\u062F \u0641\u064A OXQExpression \u064A\u0645\u0643\u0646 \u0623\u0646 \u064A\u0623\u062E\u0630 \u0637\u0628\u0639\u0629 \u0648\u0627\u062D\u062F\u0629 \u0641\u0642\u0637 \u0645\u0646 oracle.xquery.xqj.OXQItem
XQJ-0623 = bindItem \u0627\u0644\u0645\u0648\u062C\u0648\u062F \u0641\u064A OXQPreparedExpression \u064A\u0645\u0643\u0646 \u0623\u0646 \u064A\u0623\u062E\u0630 \u0637\u0628\u0639\u0629 \u0648\u0627\u062D\u062F\u0629 \u0641\u0642\u0637 \u0645\u0646 oracle.xquery.xqj.OXQItem
XQJ-0624 = \u0645\u0634\u0643\u0644\u0629 \u0641\u064A \u0625\u0645\u0643\u0627\u0646\u064A\u0629 \u0627\u0644\u062A\u0634\u063A\u064A\u0644 \u0627\u0644\u062A\u0641\u0627\u0639\u0644\u064A interoperability: \u064A\u0645\u0643\u0646 \u0623\u0646 \u064A\u0623\u062E\u0630 \u0627\u0644\u062A\u0639\u0628\u064A\u0631 OXQExpression \u0641\u0642\u0637 \u0637\u0628\u0639\u0629 \u0645\u0646 oracle.xquery.xqj.OXQItem
XQJ-0625 = bindContextItem \u0627\u0644\u0645\u0648\u062C\u0648\u062F \u0641\u064A OXQPreparedExpression \u064A\u0645\u0643\u0646 \u0623\u0646 \u064A\u0623\u062E\u0630 \u0637\u0628\u0639\u0629 \u0648\u0627\u062D\u062F\u0629 \u0641\u0642\u0637 \u0645\u0646 oracle.xquery.xqj.OXQItem
XQJ-0626 = \u0644\u0627 \u064A\u0645\u0643\u0646 \u0627\u0633\u062A\u062F\u0639\u0627\u0621 \u0627\u0644\u0623\u0633\u0644\u0648\u0628 \u062D\u064A\u062B \u062A\u0645 \u0625\u063A\u0644\u0627\u0642 \u0627\u0644\u062A\u0639\u0628\u064A\u0631 \u0627\u0644\u0630\u064A \u062A\u0645 \u0625\u0639\u062F\u0627\u062F\u0647
XQJ-0627 = \u0644\u0627 \u064A\u0645\u0643\u0646 \u0627\u0633\u062A\u062F\u0639\u0627\u0621 \u0627\u0644\u0623\u0633\u0644\u0648\u0628 \u062D\u064A\u062B \u062A\u0645 \u0625\u063A\u0644\u0627\u0642 \u0627\u0644\u0639\u0646\u0635\u0631
XQJ-0628 = \u062A\u0648\u062C\u062F \u062D\u0627\u062C\u0629 \u0644\u0637\u0628\u0639\u0629 \u0645\u0646 \u0627\u0644\u0646\u0648\u0639 oracle.xquery.xqj.OXQSequence
XQJ-0629 = \u0627\u0644\u0646\u0648\u0639 \u0627\u0644\u0645\u0642\u062F\u0645 \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645 \u0644\u0642\u064A\u0645\u0629 \u0627\u0644\u0625\u062F\u062E\u0627\u0644
XQJ-0630 = \u062A\u0648\u062C\u062F \u062D\u0627\u062C\u0629 \u0644\u0623\u062D\u062F\u0649 \u0637\u0628\u0639\u0627\u062A oracle.xquery.xqj.OXQItem
XQJ-0631 = \u062A\u0648\u062C\u062F \u062D\u0627\u062C\u0629 \u0644\u0637\u0628\u0639\u0629 \u0645\u0646 \u0627\u0644\u0646\u0648\u0639 oracle.xquery.xqj.OXQItem
XQJ-0632 = \u064A\u062F\u0639\u0645 \u0627\u0644\u0645\u0631\u062C\u0639 \u0627\u0644\u0627\u0641\u062A\u0631\u0627\u0636\u064A \u0627\u0644\u0639\u0627\u0645 \u0627\u0644\u0623\u0646\u0648\u0627\u0639 \u0627\u0644\u0623\u0633\u0627\u0633\u064A\u0629 \u0641\u0642\u0637 
XQJ-0633 = \u0644\u0645 \u064A\u062A\u0645 \u062A\u0639\u064A\u064A\u0646 \u0627\u0644\u0645\u0631\u062C\u0639 \u0627\u0644\u0639\u0627\u0645
XQJ-0634 = \u0644\u0627 \u064A\u0645\u0643\u0646 \u0627\u0633\u062A\u062F\u0639\u0627\u0621 \u0627\u0644\u0623\u0633\u0644\u0648\u0628 \u062D\u064A\u062B \u062A\u0645 \u0625\u063A\u0644\u0627\u0642 \u0627\u0644\u062A\u0639\u0628\u064A\u0631
XQJ-0635 = \u0644\u0627 \u062A\u0642\u0639 \u0627\u0644\u0642\u064A\u0645\u0629 \u0627\u0644\u0646\u0627\u062A\u062C\u0629 \u0641\u064A \u0646\u0637\u0627\u0642 \u0646\u0648\u0639 \u0648\u062D\u062F\u0629 \u0628\u0627\u064A\u062A \u062C\u0627\u0641\u0627
XQJ-0636 = \u0644\u0627 \u062A\u0642\u0639 \u0627\u0644\u0642\u064A\u0645\u0629 \u0627\u0644\u0646\u0627\u062A\u062C\u0629 \u0641\u064A \u0646\u0637\u0627\u0642 \u0646\u0648\u0639 \u0627\u0644\u0628\u064A\u0627\u0646\u0627\u062A \u0642\u0635\u064A\u0631 \u0644\u062C\u0627\u0641\u0627
XQJ-0637 = \u0644\u0627 \u062A\u0642\u0639 \u0627\u0644\u0642\u064A\u0645\u0629 \u0627\u0644\u0646\u0627\u062A\u062C\u0629 \u0641\u064A \u0646\u0637\u0627\u0642 \u0646\u0648\u0639 \u0627\u0644\u0628\u064A\u0627\u0646\u0627\u062A \u0639\u062F\u062F \u0635\u062D\u064A\u062D \u0644\u062C\u0627\u0641\u0627
XQJ-0638 = \u0644\u0627 \u062A\u0642\u0639 \u0627\u0644\u0642\u064A\u0645\u0629 \u0627\u0644\u0646\u0627\u062A\u062C\u0629 \u0641\u064A \u0646\u0637\u0627\u0642 \u0646\u0648\u0639 \u0627\u0644\u0628\u064A\u0627\u0646\u0627\u062A \u0637\u0648\u064A\u0644 \u0644\u062C\u0627\u0641\u0627
XQJ-0639 = \u0644\u0627 \u062A\u0642\u0639 \u0627\u0644\u0642\u064A\u0645\u0629 \u0627\u0644\u0646\u0627\u062A\u062C\u0629 \u0641\u064A \u0646\u0637\u0627\u0642 \u0646\u0648\u0639 \u0627\u0644\u0628\u064A\u0627\u0646\u0627\u062A \u0639\u062F\u062F \u0635\u062D\u064A\u062D \u0643\u0628\u064A\u0631 BigInteger  \u0644\u062C\u0627\u0641\u0627
XQJ-0640 = \u0644\u0627 \u064A\u062A\u0637\u0627\u0628\u0642 \u0646\u0648\u0639 \u0639\u0646\u0635\u0631 \u0627\u0644\u0633\u064A\u0627\u0642 \u0645\u0639 \u0646\u0648\u0639 \u0639\u0646\u0635\u0631 \u0627\u0644\u0633\u064A\u0627\u0642 \u0627\u0644\u062B\u0627\u0628\u062A
XQJ-0641 = \u0644\u0627 \u064A\u0645\u0643\u0646 \u062A\u0645\u0631\u064A\u0631 \u0645\u0639\u0644\u0645\u0629 \u062E\u0627\u0644\u064A\u0629 \u0625\u0644\u0649 \u0627\u0644\u062F\u0627\u0644\u0629
XQJ-0642 = \u0644\u0627 \u064A\u0645\u0643\u0646 \u0623\u0646 \u064A\u0642\u0628\u0644 bindSequence \u0633\u0648\u0649 \u0637\u0628\u0639\u0629 \u0645\u0646 oracle.xquery.xqj.OXQSequence
XQJ-0643 = \u0644\u0627 \u064A\u0645\u0643\u0646 \u0623\u0646 \u062A\u0643\u0648\u0646 \u0642\u064A\u0645\u0629 \u0627\u0633\u0645 \u0627\u0644\u0645\u062A\u063A\u064A\u0631 \u0627\u0644\u062E\u0627\u0631\u062C\u064A \u062E\u0627\u0644\u064A\u0629 \u0641\u064A \u0623\u0633\u0644\u0648\u0628 \u0627\u0644\u0631\u0628\u0637
XQJ-0644 = \u0644\u0627 \u064A\u0645\u0643\u0646 \u0627\u0633\u062A\u062F\u0639\u0627\u0621 \u0627\u0644\u0623\u0633\u0644\u0648\u0628 \u0625\u0644\u0627 \u0628\u0646\u0648\u0639 \u0630\u0631\u064A\u060C \u0648\u0644\u064A\u0633 \u0646\u0648\u0639 \u0646\u0642\u0637\u0629 \u062A\u0648\u0635\u064A\u0644
XQJ-0645 = \u0641\u0634\u0644 \u062A\u062D\u0648\u064A\u0644 \u0627\u0644\u0642\u064A\u0645\u0629 \u0625\u0644\u0649 \u0637\u0628\u0639\u0629 XDM
XQJ-0646 = \u0645\u0634\u0643\u0644\u0629 \u0641\u064A \u0625\u0645\u0643\u0627\u0646\u064A\u0629 \u0627\u0644\u062A\u0634\u063A\u064A\u0644 \u0627\u0644\u062A\u0641\u0627\u0639\u0644\u064A interoperability: \u0644\u0627 \u064A\u0639\u0645\u0644 \u0627\u0644\u0639\u0646\u0635\u0631 \u0628\u0634\u0643\u0644 \u062A\u0641\u0627\u0639\u0644\u064A
XQJ-0647 = \u0645\u0634\u0643\u0644\u0629 \u0641\u064A \u0625\u0645\u0643\u0627\u0646\u064A\u0629 \u0627\u0644\u062A\u0634\u063A\u064A\u0644 \u0627\u0644\u062A\u0641\u0627\u0639\u0644\u064A interoperability: \u0644\u0627 \u064A\u0639\u0645\u0644 \u0646\u0648\u0639 \u0639\u0646\u0635\u0631 \u0627\u0644\u0633\u064A\u0627\u0642 \u0627\u0644\u062B\u0627\u0628\u062A \u0628\u0634\u0643\u0644 \u062A\u0641\u0627\u0639\u0644\u064A
XQJ-0648 = \u0644\u0627 \u064A\u0645\u0643\u0646 \u0627\u0633\u062A\u062E\u062F\u0627\u0645 \u0627\u0644\u0646\u0648\u0639 \u0627\u0644\u0645\u0639\u0631\u0641 \u0628\u0648\u0627\u0633\u0637\u0629 \u0627\u0644\u0645\u0633\u062A\u062E\u062F\u0645 \u0644\u0631\u0628\u0637 \u0645\u0633\u062A\u0646\u062F \u0623\u0648 \u062A\u0643\u0648\u064A\u0646\u0647 \u0641\u064A \u0647\u0630\u0627 \u0627\u0644\u062A\u0646\u0641\u064A\u0630. \u062D\u064A\u062B \u064A\u062F\u0639\u0645 \u0647\u0630\u0627 \u0627\u0644\u062A\u0646\u0641\u064A\u0630 \u0641\u0642\u0637 \u0623\u0646\u0648\u0627\u0639 XQuery \u0627\u0644\u0645\u062F\u0645\u062C\u0629.
XQJ-0649 = \u0627\u0644\u0646\u0648\u0639 \u0627\u0644\u0645\u062D\u062F\u062F \u0644\u0631\u0628\u0637 \u0645\u0633\u062A\u0646\u062F \u0623\u0648 \u062A\u0643\u0648\u064A\u0646\u0647 \u0644\u064A\u0633 \u0645\u0646 \u0646\u0648\u0639 \u0639\u0646\u0635\u0631 \u0645\u0633\u062A\u0646\u062F \u0623\u0648 \u0639\u0646\u0635\u0631 \u0645\u062E\u0637\u0637 \u0645\u0633\u062A\u0646\u062F.
XQJ-0650 = \u0627\u0644\u0642\u064A\u0645\u0629 \u0627\u0644\u0645\u062D\u062F\u062F\u0629 \u0644\u0644\u0631\u0628\u0637 \u0623\u0648 \u0627\u0644\u062A\u0643\u0648\u064A\u0646 \u062E\u0627\u0644\u064A\u0629
XQJ-0651 = \u0627\u0644\u0627\u0633\u062A\u0639\u0644\u0627\u0645 \u0627\u0644\u0630\u064A \u062A\u0645 \u0625\u062F\u062E\u0627\u0644\u0647 \u062E\u0627\u0644\u064D
XQJ-0652 = \u062A\u0639\u0630\u0631 \u0631\u0628\u0637 \u0627\u0644\u0639\u0646\u0635\u0631 \u0623\u0648 \u062A\u0643\u0648\u064A\u0646\u0647, \u0646\u0638\u0631\u064B\u0627 \u0644\u0623\u0646 \u0643\u0627\u0626\u0646 \u0627\u0644\u0645\u0635\u062F\u0631 \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645. \u0627\u0644\u0643\u0627\u0626\u0646\u0627\u062A \u0627\u0644\u0645\u062F\u0639\u0648\u0645\u0629 \u0641\u0642\u0637 \u0647\u064A SAXSource \u0648StreamSource \u0648DOMSource.
XQJ-0653 = \u0625\u062D\u062F\u0649 \u0627\u0644\u0645\u0639\u0644\u0645\u0627\u062A \u0627\u0644\u0645\u062D\u062F\u062F\u0629 \u062E\u0627\u0644\u064A\u0629
XQJ-0654 = \u0627\u0644\u0645\u0639\u0644\u0645\u0629 \u0627\u0644\u0645\u062D\u062F\u062F\u0629 \u062E\u0627\u0644\u064A\u0629
XQJ-0655 = \u0645\u0639\u0644\u0645\u0629 os \u0627\u0644\u0645\u062D\u062F\u062F\u0629 \u062E\u0627\u0644\u064A\u0629
XQJ-0656 = \u0645\u0639\u0644\u0645\u0629 ow \u0627\u0644\u0645\u062D\u062F\u062F\u0629 \u062E\u0627\u0644\u064A\u0629
XQJ-0657 = \u0627\u0644\u0646\u0648\u0639 \u0627\u0644\u0623\u0633\u0627\u0633\u064A basetype \u0627\u0644\u0645\u062D\u062F\u062F \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645
XQJ-0658 = \u064A\u0634\u064A\u0631 \u0627\u0633\u0645 \u0627\u0644\u0646\u0648\u0639 typename \u0627\u0644\u0645\u062D\u062F\u062F \u0625\u0644\u0649 \u0646\u0648\u0639 \u0645\u062D\u062F\u062F \u0645\u0633\u0628\u0642\u064B\u0627\u060C \u0644\u0643\u0646\u0647 \u064A\u062E\u062A\u0644\u0641 \u0639\u0646 \u0627\u0644\u0646\u0648\u0639 \u0627\u0644\u0623\u0633\u0627\u0633\u064A basetype
XQJ-0659 = OXQConnection: \u0627\u0644\u062A\u062B\u0628\u064A\u062A \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645
XQJ-0660 = OXQConnection: \u0644\u0645 \u064A\u062A\u0645 \u062A\u0646\u0641\u064A\u0630 \u0627\u0644\u0623\u0633\u0644\u0648\u0628
XQJ-0661 = \u064A\u062A\u0637\u0644\u0628 \u0647\u0630\u0627 \u0627\u0644\u062A\u0646\u0641\u064A\u0630 \u0643\u0627\u0626\u0646 \u0633\u064A\u0627\u0642 Oracle \u062B\u0627\u0628\u062A\u064B\u0627
XQJ-0662 = OXQConnection: \u0625\u0644\u063A\u0627\u0621 \u0627\u0644\u062A\u0639\u062F\u064A\u0644\u0627\u062A \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645
XQJ-0663 = \u062A\u0639\u0630\u0631 \u062A\u062D\u062F\u064A\u062F \u0646\u0648\u0639 \u0627\u0644\u0645\u062F\u0629
XQJ-0664 = \u062A\u0639\u0630\u0631 \u062A\u062D\u062F\u064A\u062F \u0646\u0648\u0639 \u062A\u0642\u0648\u064A\u0645 xml \u0627\u0644\u0645\u064A\u0644\u0627\u062F\u064A
XQJ-0665 = \u0627\u0644\u0643\u0627\u0626\u0646 \u0627\u0644\u0630\u064A \u062A\u0645 \u0625\u062F\u062E\u0627\u0644\u0647 \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645
XQJ-0666 = \u0648\u0633\u064A\u0637\u0629 \u0646\u0648\u0639 \u0627\u0644\u0639\u0646\u0635\u0631 \u062E\u0627\u0644\u064A\u0629
XQJ-0667 = \u062D\u062F\u062B \u062E\u0637\u0623 \u0641\u064A XMLReader \u0623\u062B\u0646\u0627\u0621 \u0627\u0644\u062A\u062D\u0644\u064A\u0644 \u0627\u0644\u0644\u063A\u0648\u064A
XQJ-0668 = \u062A\u0639\u0630\u0631 \u0627\u0633\u062A\u062E\u0631\u0627\u062C \u0646\u0642\u0637\u0629 \u0627\u0644\u062A\u0648\u0635\u064A\u0644 \u0645\u0646 DOMSource\u060C \u0641\u0634\u0644 \u0627\u0644\u062A\u062D\u0648\u064A\u0644 \u0625\u0644\u0649 XDM
XQJ-0669 = \u062A\u0639\u0630\u0631 \u0627\u0633\u062A\u062E\u0631\u0627\u062C \u0645\u0635\u062F\u0631 \u0627\u0644\u0645\u062F\u062E\u0644\u0627\u062A \u0623\u0648 \u0642\u0627\u0631\u0626 xml \u0645\u0646 SAXSource, \u0641\u0634\u0644 \u0627\u0644\u062A\u062D\u0648\u064A\u0644 \u0625\u0644\u0649 XDM
XQJ-0670 = \u062A\u0639\u0630\u0631 \u0627\u0633\u062A\u062E\u0631\u0627\u062C \u0642\u0627\u0631\u0626 \u0623\u0648 \u062A\u062F\u0641\u0642 \u0627\u0644\u0645\u062F\u062E\u0644\u0627\u062A \u0645\u0646 StreamSource, \u0641\u0634\u0644 \u0627\u0644\u062A\u062D\u0648\u064A\u0644 \u0625\u0644\u0649 XDM
XQJ-0671 = \u062D\u062F\u062B \u062E\u0637\u0623 \u0641\u064A createAttributeType() \u0627\u0644\u062E\u0627\u0635 \u0628\u0627\u0644\u0646\u0648\u0639 \u0627\u0644\u0623\u0633\u0627\u0633\u064A OXQDataFactory - baseType \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645
XQJ-0672 = \u062D\u062F\u062B \u062E\u0637\u0623 \u0641\u064A createAttributeType() \u0627\u0644\u062E\u0627\u0635 \u0628\u0640 OXQDataFactory - \u0625\u0630\u0627 \u062A\u0645 \u062A\u062D\u062F\u064A\u062F schemaURI\u060C \u0641\u064A\u062C\u0628 \u0623\u064A\u0636\u064B\u0627 \u062A\u062D\u062F\u064A\u062F \u0627\u0633\u0645 \u0627\u0644\u0646\u0648\u0639 typename
XQJ-0673 = \u062D\u062F\u062B \u062E\u0637\u0623 \u0641\u064A createSchemaAttributeType() \u0627\u0644\u062E\u0627\u0635 \u0628\u0640\u0627\u0644\u0646\u0648\u0639 \u0627\u0644\u0623\u0633\u0627\u0633\u064A OXQDataFactory - baseType \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645
XQJ-0674 = \u062D\u062F\u062B \u062E\u0637\u0623 \u0641\u064A createSchemaAttributeType() \u0627\u0644\u062E\u0627\u0635 \u0628\u0640 OXQDataFactory - \u0644\u0627 \u064A\u0645\u0643\u0646 \u0623\u0646 \u064A\u0643\u0648\u0646 \u0627\u0633\u0645 \u0646\u0642\u0637\u0629 \u0627\u0644\u062A\u0648\u0635\u064A\u0644 nodename \u062E\u0627\u0644\u064A\u064B\u0627
XQJ-0675 = \u062A\u0642\u0628\u0644 \u0627\u0644\u062F\u0627\u0644\u0629 \u0630\u0627\u0643\u0631\u0629 \u0648\u0633\u064A\u0637\u0629 \u062E\u0627\u0644\u064A\u0629 \u0643\u0648\u0633\u064A\u0637\u0629 \u0623\u0648\u0644\u0649
XQJ-0676 = \u0641\u0634\u0644 \u0625\u062D\u0636\u0627\u0631 \u0623\u0648\u0644 \u0639\u0646\u0635\u0631 \u0641\u064A \u0627\u0644\u062A\u0633\u0644\u0633\u0644
XQJ-0677 = \u0646\u0642\u0637\u0629 \u062A\u0648\u0635\u064A\u0644 \u0627\u0644\u0633\u0645\u0629 \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645\u0629 \u0641\u064A \u0639\u0645\u0644\u064A\u0629 \u0627\u0644\u062A\u0633\u0644\u0633\u0644
XQJ-0678 = \u0627\u0644\u0645\u0639\u0644\u0645\u0629 \u0627\u0644\u062A\u064A \u062A\u0645 \u062A\u0645\u0631\u064A\u0631\u0647\u0627 \u0644\u064A\u0633\u062A XQItemType \u0635\u0627\u0644\u062D\u064B\u0627
XQJ-0679 = \u0627\u0644\u0628\u0627\u062F\u0626\u0629 \u063A\u064A\u0631 \u0645\u0639\u0631\u0648\u0641\u0629
XQJ-0680 = \u062D\u062F\u062B \u062E\u0637\u0623 \u0641\u064A createDocumentElementType() \u0627\u0644\u062E\u0627\u0635 \u0628\u0640 OXQDataFactory - \u0644\u0627 \u064A\u0645\u0643\u0646 \u0623\u0646 \u064A\u0643\u0648\u0646 \u0646\u0648\u0639 \u0627\u0644\u0639\u0646\u0635\u0631 elementType \u062E\u0627\u0644\u064A\u064B\u0627
XQJ-0681 = \u062D\u062F\u062B \u062E\u0637\u0623 \u0641\u064A createDocumentElementType() \u0627\u0644\u062E\u0627\u0635 \u0628\u0640 OXQDataFactory - \u0646\u0648\u0639 \u0627\u0644\u0639\u0646\u0635\u0631 elementType \u063A\u064A\u0631 \u0635\u0627\u0644\u062D
XQJ-0682 = \u062D\u062F\u062B \u062E\u0637\u0623 \u0641\u064A createDocumentSchemaElementType() \u0627\u0644\u062E\u0627\u0635 \u0628\u0640 OXQDataFactory - \u0644\u0627 \u064A\u0645\u0643\u0646 \u0623\u0646 \u064A\u0643\u0648\u0646 \u0646\u0648\u0639 \u0627\u0644\u0639\u0646\u0635\u0631 elementType \u062E\u0627\u0644\u064A\u064B\u0627
XQJ-0683 = \u062D\u062F\u062B \u062E\u0637\u0623 \u0641\u064A createDocumentSchemaElementType() \u0627\u0644\u062E\u0627\u0635 \u0628\u0640 OXQDataFactory - \u0646\u0648\u0639 \u0627\u0644\u0639\u0646\u0635\u0631 elementType \u063A\u064A\u0631 \u0635\u0627\u0644\u062D
XQJ-0684 = \u062D\u062F\u062B \u062E\u0637\u0623 \u0641\u064A createElementType() \u0627\u0644\u062E\u0627\u0635 \u0628\u0640 OXQDataFactory - \u0625\u0630\u0627 \u062A\u0645 \u062A\u062D\u062F\u064A\u062F schemaURI\u060C \u064A\u062C\u0628 \u0623\u064A\u0636\u064B\u0627 \u062A\u062D\u062F\u064A\u062F \u0627\u0633\u0645 \u0627\u0644\u0646\u0648\u0639 typename
XQJ-0685 = \u062D\u062F\u062B \u062E\u0637\u0623 \u0641\u064A createSchemaElementType() \u0627\u0644\u062E\u0627\u0635 \u0628\u0640 OXQDataFactory - \u0644\u0627 \u064A\u0645\u0643\u0646 \u0623\u0646 \u064A\u0643\u0648\u0646 \u0627\u0633\u0645 \u0646\u0642\u0637\u0629 \u0627\u0644\u062A\u0648\u0635\u064A\u0644 nodename \u062E\u0627\u0644\u064A\u064B\u0627
XQJ-0686 = \u062D\u062F\u062B \u062E\u0637\u0623 \u0641\u064A createSequenceType() \u0627\u0644\u062E\u0627\u0635 \u0628\u0640 OXQDataFactory \u0646\u0638\u0631\u064B\u0627 \u0644\u0623\u0646 \u0627\u0644\u0639\u0646\u0635\u0631 \u062E\u0627\u0644\u064D \u0648\u0644\u064A\u0633 \u0645\u0646 \u0627\u0644\u0646\u0648\u0639 XQSequenceType.OCC_EMPTY
XQJ-0687 = \u062D\u062F\u062B \u062E\u0637\u0623 \u0641\u064A createSequenceType() \u0627\u0644\u062E\u0627\u0635 \u0628\u0640 OXQDataFactory \u0646\u0638\u0631\u064B\u0627 \u0644\u0623\u0646 \u0627\u0644\u0639\u0646\u0635\u0631 \u0644\u064A\u0633 \u062E\u0627\u0644\u064A\u064B\u0627 \u0648\u0645\u0646 \u0627\u0644\u0646\u0648\u0639 XQSequenceType.OCC_EMPTY
XQJ-0688 = \u062D\u062F\u062B \u062E\u0637\u0623 \u0641\u064A createSequenceType() \u0627\u0644\u062E\u0627\u0635 \u0628\u0640 OXQDataFactory \u0646\u0638\u0631\u064B\u0627 \u0644\u0623\u0646 \u0627\u0644\u062D\u062F\u062B \u0627\u0644\u0645\u062D\u062F\u062F \u063A\u064A\u0631 \u0635\u0627\u0644\u062D
XQJ-0689 = \u062D\u062F\u062B \u062E\u0637\u0623 \u0641\u064A createNdTyp() \u0627\u0644\u062E\u0627\u0635 \u0628\u0627\u0644\u0646\u0648\u0639 \u0627\u0644\u0623\u0633\u0627\u0633\u064A OXQDataFactory - baseType \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645
XQJ-0690 = XQDataSource: getConnection(conn) \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645
XQJ-0691 = \u0644\u0645 \u064A\u062A\u0645 \u0627\u0644\u062A\u0639\u0631\u0641 \u0639\u0644\u0649 \u0627\u0633\u0645 \u0627\u0644\u062E\u0627\u0635\u064A\u0629
XQJ-0692 = \u0642\u064A\u0645 \u0627\u0644\u062E\u0627\u0635\u064A\u0629 \u0627\u0644\u0645\u062D\u062F\u062F\u0629 \u063A\u064A\u0631 \u0635\u0627\u0644\u062D\u0629.  \u0644\u0627 \u064A\u062F\u0639\u0645 \u0647\u0630\u0627 \u0627\u0644\u062A\u0646\u0641\u064A\u0630 \u0623\u064A\u0629 \u062E\u0635\u0627\u0626\u0635
XQJ-0693 = OXQExpression: executeCommand \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645
XQJ-0694 = \u062A\u0639\u0630\u0631 \u0627\u0644\u062A\u0639\u0631\u0641 \u0639\u0644\u0649 \u0643\u0627\u0626\u0646 \u0627\u0644\u0627\u0633\u062A\u0639\u0644\u0627\u0645
XQJ-0695 = oracle.xml.parser.v2.XMLParseException
XQJ-0696 = org.xml.sax.SAXException
XQJ-0697 = \u062A\u0639\u0630\u0631 \u062A\u0643\u0648\u064A\u0646 DatatypeFactory \u0623\u0648 Duration
XQJ-0698 = \u062A\u0639\u0630\u0631 \u062A\u0643\u0648\u064A\u0646 DatatypeFactory
XQJ-0699 = XQStaticContext: \u0628\u0627\u062F\u0626\u0629 \u063A\u064A\u0631 \u0635\u0627\u0644\u062D\u0629 \u0644\u0644\u0623\u0633\u0644\u0648\u0628 getNamespaceURI 
XQJ-0700 = \u0646\u0648\u0639 \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645 \u0641\u064A getObject()
XQJ-0701 = \u0644\u0627 \u064A\u0645\u0643\u0646 \u062A\u062D\u062F\u064A\u062F \u0639\u0644\u0627\u0642\u0629 instanceOf \u0646\u0638\u0631\u064B\u0627 \u0644\u0623\u0646 \u0627\u0644\u0639\u0646\u0635\u0631 \u0627\u0644\u062D\u0627\u0644\u064A \u064A\u0634\u062A\u0645\u0644 \u0639\u0644\u0649 \u0646\u0648\u0639 \u0645\u062E\u0637\u0637 \u0642\u0627\u0639\u062F\u0629 \u0628\u064A\u0627\u0646\u0627\u062A \u0645\u0639\u0631\u0641 \u0628\u0648\u0627\u0633\u0637\u0629 \u0627\u0644\u0645\u0633\u062A\u062E\u062F\u0645. \u0648\u0644\u0627 \u064A\u062F\u0639\u0645 \u0647\u0630\u0627 \u0627\u0644\u062A\u0646\u0641\u064A\u0630 \u0623\u0646\u0648\u0627\u0639 \u0645\u062E\u0637\u0637\u0627\u062A \u0642\u0648\u0627\u0639\u062F \u0627\u0644\u0628\u064A\u0627\u0646\u0627\u062A \u0627\u0644\u0645\u0639\u0631\u0641\u0629 \u0628\u0648\u0627\u0633\u0637\u0629 \u0627\u0644\u0645\u0633\u062A\u062E\u062F\u0645
XQJ-0702 = \u0644\u0627 \u064A\u0645\u0643\u0646 \u062A\u062D\u062F\u064A\u062F \u0639\u0644\u0627\u0642\u0629 instanceOf \u0646\u0638\u0631\u064B\u0627 \u0644\u0623\u0646 \u0646\u0648\u0639 \u0627\u0644\u0645\u062F\u062E\u0644\u0627\u062A \u0647\u0648 \u0646\u0648\u0639 \u0645\u062E\u0637\u0637 \u0642\u0627\u0639\u062F\u0629 \u0628\u064A\u0627\u0646\u0627\u062A \u0645\u0639\u0631\u0641 \u0628\u0648\u0627\u0633\u0637\u0629 \u0627\u0644\u0645\u0633\u062A\u062E\u062F\u0645. \u0648\u0644\u0627 \u064A\u062F\u0639\u0645 \u0647\u0630\u0627 \u0627\u0644\u062A\u0646\u0641\u064A\u0630 \u0623\u0646\u0648\u0627\u0639 \u0645\u062E\u0637\u0637\u0627\u062A \u0642\u0648\u0627\u0639\u062F \u0627\u0644\u0628\u064A\u0627\u0646\u0627\u062A \u0627\u0644\u0645\u0639\u0631\u0641\u0629 \u0628\u0648\u0627\u0633\u0637\u0629 \u0627\u0644\u0645\u0633\u062A\u062E\u062F\u0645
XQJ-0703 = XQItem: \u062E\u0637\u0623 writeItemToSAX
XQJ-0704 = XQItemType.getBaseType(): \u0646\u0648\u0639 \u0627\u0644\u0639\u0646\u0635\u0631 \u063A\u064A\u0631 \u0635\u0627\u0644\u062D
XQJ-0705 = XQItemType.getTypeName(): \u0646\u0648\u0639 \u0627\u0644\u0639\u0646\u0635\u0631 \u063A\u064A\u0631 \u0635\u0627\u0644\u062D
XQJ-0706 = XQItemType.getPIName(): \u0646\u0648\u0639 \u0627\u0644\u0639\u0646\u0635\u0631 \u063A\u064A\u0631 \u0635\u0627\u0644\u062D
XQJ-0707 = XQItemType.getNodeName(): \u0646\u0648\u0639 \u0627\u0644\u0639\u0646\u0635\u0631 \u063A\u064A\u0631 \u0635\u0627\u0644\u062D
XQJ-0708 = \u062A\u0639\u0630\u0631 \u0625\u062D\u0636\u0627\u0631 \u0642\u0627\u0631\u0626 \u0623\u0648 \u062A\u062F\u0641\u0642 \u0627\u0644\u0645\u062F\u062E\u0644\u0627\u062A
XQJ-0709 = XQResultSequence: \u062E\u0637\u0623 writeSequenceToSAX
XQJ-0710 = XQResultSequence: \u062E\u0637\u0623 writeItemToSAX
XQJ-0711 = \u0627\u0644\u0648\u0636\u0639 \u0627\u0644\u0645\u062D\u062F\u062F \u0641\u064A setConstructionMode \u063A\u064A\u0631 \u0635\u0627\u0644\u062D
XQJ-0712 = \u0627\u0644\u0648\u0636\u0639 \u0627\u0644\u0645\u062D\u062F\u062F \u0641\u064A setOrderingMode \u063A\u064A\u0631 \u0635\u0627\u0644\u062D
XQJ-0713 = \u0627\u0644\u062A\u0631\u062A\u064A\u0628 \u0627\u0644\u0645\u062D\u062F\u062F \u0641\u064A setDefaultOrderForEmptySequences \u063A\u064A\u0631 \u0635\u0627\u0644\u062D
XQJ-0714 = \u0627\u0644\u0648\u0636\u0639 \u0627\u0644\u0645\u062D\u062F\u062F \u0641\u064A setBoundarySpacePolicy \u063A\u064A\u0631 \u0635\u0627\u0644\u062D
XQJ-0715 = \u0627\u0644\u0648\u0636\u0639 \u0627\u0644\u0645\u062D\u062F\u062F \u0641\u064A setCopyNamespacesModePreserve \u063A\u064A\u0631 \u0635\u0627\u0644\u062D
XQJ-0716 = \u0627\u0644\u0648\u0636\u0639 \u0627\u0644\u0645\u062D\u062F\u062F \u0641\u064A setCopyNamespacesModeInherit \u063A\u064A\u0631 \u0635\u0627\u0644\u062D
XQJ-0717 = \u0627\u0644\u0648\u0636\u0639 \u0627\u0644\u0645\u062D\u062F\u062F \u0641\u064A setBindingMode \u063A\u064A\u0631 \u0635\u0627\u0644\u062D
XQJ-0718 = \u0627\u0644\u0648\u0636\u0639 \u0627\u0644\u0645\u062D\u062F\u062F \u0641\u064A setHoldability \u063A\u064A\u0631 \u0635\u0627\u0644\u062D
XQJ-0719 = \u0646\u0648\u0639 \u0644\u063A\u0629 langtype \u063A\u064A\u0631 \u0635\u0627\u0644\u062D \u0641\u064A setQueryLanguageTypeAndVersion
XQJ-0720 = \u062A\u0645 \u062A\u062D\u062F\u064A\u062F \u0625\u0645\u0643\u0627\u0646\u064A\u0629 \u062A\u0645\u0631\u064A\u0631 \u063A\u064A\u0631 \u0635\u0627\u0644\u062D\u0629 \u0641\u064A setScrollability
XQJ-0721 = \u0644\u0627 \u064A\u0645\u0643\u0646 \u0623\u0646 \u062A\u0643\u0648\u0646 \u0642\u064A\u0645\u0629 \u0645\u0639\u0644\u0645\u0629 \u0627\u0644\u062B\u0648\u0627\u0646\u064A \u0641\u064A setQueryTimeout \u0635\u0641\u0631\u064B\u0627
XQJ-0722 = OXQUtils:printResult()
XQJ-0723 = OXQUtils.makeOXQItemType - \u0646\u0648\u0639 \u063A\u064A\u0631 \u0645\u0639\u0631\u0648\u0641 1
XQJ-0724 = OXQUtils.makeOXQItemType - \u0646\u0648\u0639 \u063A\u064A\u0631 \u0645\u0639\u0631\u0648\u0641 2
XQJ-0725 = OXQUtils.makeOXQItemType - \u0646\u0648\u0639 \u063A\u064A\u0631 \u0645\u0639\u0631\u0648\u0641 3
XQJ-0726 = OXQUtils:setContextItem - \u0627\u0644\u0639\u0646\u0635\u0631 \u0644\u064A\u0633 OXQItem
XQJ-0727 = \u0646\u0648\u0639 \u062D\u062F\u062B \u062A\u062F\u0641\u0642 XML \u063A\u064A\u0631 \u0645\u0639\u0631\u0648\u0641
XQJ-0728 = \u062D\u062F\u062B\u062A \u0645\u0634\u0643\u0644\u0629 \u0641\u064A OXQUtils.cnvStreamToDOM.
XQJ-0729 = \u0646\u0648\u0639 \u0639\u0646\u0635\u0631 \u0623\u0633\u0627\u0633\u064A baseItemType \u063A\u064A\u0631 \u0645\u0639\u0631\u0648\u0641 \u0641\u064A OXQUtils.normalizeSequence
XQJ-0730 = \u062A\u0639\u0630\u0631 \u062A\u0643\u0648\u064A\u0646 XMLStreamReader
XQJ-0731 = \u0645\u0634\u0643\u0644\u0629 \u0641\u064A \u0625\u0645\u0643\u0627\u0646\u064A\u0629 \u0627\u0644\u062A\u0634\u063A\u064A\u0644 \u0627\u0644\u062A\u0641\u0627\u0639\u0644\u064A interoperability: \u0644\u0627 \u064A\u0639\u0645\u0644 \u0627\u0644\u0646\u0648\u0639 \u0627\u0644\u0645\u0639\u0631\u0641 \u0628\u0648\u0627\u0633\u0637\u0629 \u0627\u0644\u0645\u0633\u062A\u062E\u062F\u0645 \u0628\u0634\u0643\u0644 \u062A\u0641\u0627\u0639\u0644\u064A
XQJ-0732 = \u0644\u0627 \u064A\u0639\u062F \u0645\u0633\u062A\u0646\u062F \u0627\u0644\u0645\u062F\u062E\u0644\u0627\u062A \u063A\u064A\u0631 \u0627\u0644\u0645\u0643\u062A\u0648\u0628\u0629 \u0637\u0628\u0639\u0629 \u0644\u0644\u0646\u0648\u0639 \u0627\u0644\u0645\u062D\u062F\u062F\u060C \u0648\u0630\u0644\u0643 \u0648\u0641\u0642\u064B\u0627 \u0644\u0642\u0648\u0627\u0639\u062F \u0645\u0637\u0627\u0628\u0642\u0629 \u0646\u0648\u0639 \u062A\u0633\u0644\u0633\u0644 XQuery
XQJ-0733 = \u0644\u0627 \u062A\u0639\u062F \u0646\u0642\u0637\u0629 \u062A\u0648\u0635\u064A\u0644 \u0627\u0644\u0645\u062F\u062E\u0644\u0627\u062A \u0637\u0628\u0639\u0629 \u0644\u0644\u0646\u0648\u0639 \u0627\u0644\u0645\u062D\u062F\u062F
XQJ-0734 = \u0646\u0648\u0639 \u0623\u0633\u0627\u0633\u064A \u063A\u064A\u0631 \u0645\u0639\u0631\u0648\u0641
XQJ-0735 = \u0638\u0647\u0631 XQItemType \u064A\u0634\u062A\u0645\u0644 \u0639\u0644\u0649 \u0646\u0648\u0639 \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645
XQJ-0736 = \u062A\u0645 \u0625\u062F\u062E\u0627\u0644 \u0646\u0648\u0639 \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645 \u0644\u0643\u0627\u0626\u0646 \u0627\u0644\u0633\u0644\u0633\u0644\u0629
XQJ-0737 = \u062A\u0639\u0630\u0631 \u0627\u0644\u062D\u0635\u0648\u0644 \u0639\u0644\u0649 \u062A\u0645\u062B\u064A\u0644 XQueryX \u0644\u0627\u0633\u062A\u0639\u0644\u0627\u0645 \u0627\u0644\u0645\u062F\u062E\u0644\u0627\u062A
XQJ-0738 = \u0645\u0639\u0644\u0645\u0629 \u0627\u0644\u0627\u0633\u0645 \u062E\u0627\u0644\u064A\u0629
XQJ-0739 = \u0642\u064A\u0645\u0629 \u0627\u0644\u062E\u0627\u0635\u064A\u0629 \u063A\u064A\u0631 \u0635\u0627\u0644\u062D\u0629
XQJ-0740 = \u062D\u062F\u062B \u062E\u0637\u0623 \u0623\u062B\u0646\u0627\u0621 \u062A\u0643\u0648\u064A\u0646 \u0627\u062A\u0635\u0627\u0644 \u0642\u0627\u0639\u062F\u0629 \u0627\u0644\u0628\u064A\u0627\u0646\u0627\u062A - \u0644\u0645 \u064A\u062A\u0645 \u062A\u0639\u064A\u064A\u0646 \u062C\u0645\u064A\u0639 \u0627\u0644\u062E\u0635\u0627\u0626\u0635 \u0627\u0644\u0644\u0627\u0632\u0645\u0629
XQJ-0741 = \u062A\u0639\u0630\u0631 \u0627\u0644\u062D\u0635\u0648\u0644 \u0639\u0644\u0649 \u062A\u0645\u062B\u064A\u0644 XQueryX \u0644\u0627\u0633\u062A\u0639\u0644\u0627\u0645 \u0627\u0644\u0645\u062F\u062E\u0644\u0627\u062A
XQJ-0742 = \u0645\u062A\u063A\u064A\u0631 \u0627\u0644\u0631\u0628\u0637 ''{0}'' \u063A\u064A\u0631 \u0645\u0639\u0631\u0641
XQJ-0743 = \u0646\u0648\u0639 \u0627\u0644\u0631\u0628\u0637 \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645
XQJ-0744 = \u0644\u0645 \u064A\u062A\u0645 \u0627\u0644\u062A\u0639\u0631\u0641 \u0639\u0644\u0649 \u0627\u0633\u0645 \u0627\u0644\u062E\u0627\u0635\u064A\u0629
XQJ-0745 = \u062D\u062F\u062B \u062E\u0637\u0623 \u0641\u064A \u0627\u0644\u0648\u0635\u0648\u0644 \u0625\u0644\u0649 \u0627\u0644\u0639\u0646\u0635\u0631 \u0627\u0644\u062D\u0627\u0644\u064A
XQJ-0746 = \u0644\u0627 \u064A\u0645\u0643\u0646 \u0627\u0633\u062A\u062F\u0639\u0627\u0621 \u0627\u0644\u0623\u0633\u0644\u0648\u0628 \u0644\u0623\u0646 \u0627\u0644\u062A\u0633\u0644\u0633\u0644 \u064A\u0623\u062A\u064A \u0628\u0639\u062F \u0627\u0644\u0639\u0646\u0635\u0631 \u0627\u0644\u0623\u062E\u064A\u0631
XQJ-0747 = \u062D\u062F\u062B \u062E\u0637\u0623 \u0641\u064A \u0627\u0633\u062A\u0631\u062C\u0627\u0639 \u0627\u0644\u0639\u0646\u0635\u0631 \u0628\u0627\u0639\u062A\u0628\u0627\u0631\u0647 \u0646\u0642\u0637\u0629 \u062A\u0648\u0635\u064A\u0644 DOM
XQJ-0748 = \u064A\u0648\u062C\u062F \u062E\u0637\u0623 \u0641\u064A \u0625\u0646\u0634\u0627\u0621 \u062A\u0633\u0644\u0633\u0644 \u0644\u0644\u0639\u0646\u0635\u0631
XQJ-0749 = \u064A\u0648\u062C\u062F \u062E\u0637\u0623 \u0641\u064A \u0625\u0646\u0634\u0627\u0621 \u062A\u0633\u0644\u0633\u0644 \u0644\u0644\u0633\u0644\u0633\u0644\u0629
XQJ-0750 = \u0627\u0644\u0645\u062A\u063A\u064A\u0631 \u063A\u064A\u0631 \u0645\u0639\u0631\u0641 \u0643\u0645\u062A\u063A\u064A\u0631 \u062E\u0627\u0631\u062C\u064A \u0641\u064A \u0627\u0644\u0627\u0633\u062A\u0639\u0644\u0627\u0645\u060C \u0623\u0648 \u0641\u064A \u062D\u0627\u0644\u0629 \u0631\u0628\u0637 \u0639\u0646\u0635\u0631 \u0627\u0644\u0633\u064A\u0627\u0642\u060C \u0644\u0627 \u064A\u062A\u0645 \u0627\u0633\u062A\u062E\u062F\u0627\u0645 \u0639\u0646\u0635\u0631 \u0627\u0644\u0633\u064A\u0627\u0642 \u0647\u0630\u0627 \u0641\u064A \u0627\u0644\u0627\u0633\u062A\u0639\u0644\u0627\u0645
XQJ-0751 = \u0644\u064A\u0633\u062A \u0643\u0644 \u0627\u0644\u0645\u062A\u063A\u064A\u0631\u0627\u062A \u0627\u0644\u062E\u0627\u0631\u062C\u064A\u0629 \u0645\u0631\u062A\u0628\u0637\u0629
XQJ-0752 = \u0644\u0627 \u064A\u0648\u062C\u062F \u0639\u0646\u0635\u0631 \u0633\u064A\u0627\u0642 \u063A\u064A\u0631 \u0645\u0631\u062A\u0628\u0637 \u0641\u064A \u0627\u0644\u0627\u0633\u062A\u0639\u0644\u0627\u0645
XQJ-0753 = \u0644\u0627 \u064A\u0634\u062A\u0645\u0644 \u062A\u0633\u0644\u0633\u0644 \u0627\u0644\u0625\u062F\u062E\u0627\u0644 \u0639\u0644\u0649 \u0623\u064A\u0629 \u0639\u0646\u0627\u0635\u0631
XQJ-0754 = \u062A\u0639\u0630\u0631 \u0627\u0644\u0639\u062B\u0648\u0631 \u0639\u0644\u0649 \u0627\u0644\u0646\u0648\u0639 \u0627\u0644\u0645\u062D\u062F\u062F \u0627\u0644\u0645\u0639\u0631\u0641 \u0628\u0648\u0627\u0633\u0637\u0629 \u0627\u0644\u0645\u0633\u062A\u062E\u062F\u0645
XQJ-0757 = \u0644\u0645 \u064A\u062A\u0645 \u062A\u0643\u0648\u064A\u0646 \u0627\u0644\u0625\u062F\u062E\u0627\u0644 \u0628\u0635\u0648\u0631\u0629 \u0635\u062D\u064A\u062D\u0629 \u0623\u0648 \u0647\u0646\u0627\u0643 \u0634\u0631\u0637 \u0645\u0639\u0627\u0644\u062C\u0629 \u063A\u064A\u0631 \u0645\u062A\u0648\u0642\u0639\u060C \u0641\u0634\u0644 \u0627\u0644\u062A\u062D\u0648\u064A\u0644 \u0625\u0644\u0649 XDM
XQJ-0759 = \u062D\u062F\u062B \u062E\u0637\u0623 \u0641\u064A \u0627\u0644\u0648\u0635\u0648\u0644 \u0625\u0644\u0649 \u0646\u0648\u0639 \u0627\u0644\u0639\u0646\u0635\u0631
XQJ-0760 = \u0627\u0633\u062A\u062B\u0646\u0627\u0621 \u0645\u0634\u063A\u0644 \u062F\u0627\u062E\u0644\u064A
XQJ-0761 = \u062A\u0645 \u062A\u062D\u062F\u064A\u062F \u0648\u0636\u0639 \u063A\u064A\u0631 \u0635\u0627\u0644\u062D \u0641\u064A setOrderingMode
XQJ-0762 = \u062A\u0645 \u062A\u062D\u062F\u064A\u062F \u0648\u0636\u0639 \u063A\u064A\u0631 \u0635\u0627\u0644\u062D \u0641\u064A setProcessingMode
XQJ-0763 = \u062D\u062F\u062B \u062E\u0637\u0623 \u0641\u064A \u0627\u0633\u062A\u0631\u062C\u0627\u0639 \u0627\u0644\u0639\u0646\u0635\u0631 \u0628\u0627\u0639\u062A\u0628\u0627\u0631\u0647 XmlObject
XQJ-0764 = XQPrepareExpression \u0627\u0644\u0645\u062F\u062E\u064E\u0644 \u0625\u0645\u0627 \u0623\u0646\u0647 \u0642\u062F \u062A\u0645 \u062A\u0646\u0641\u064A\u0630\u0647 \u0623\u0648 \u0623\u0646\u0647 \u064A\u0634\u062A\u0645\u0644 \u0639\u0644\u0649 \u0645\u062A\u063A\u064A\u0631\u0627\u062A \u0645\u0631\u062A\u0628\u0637\u0629\u060C \u0623\u0648 \u0623\u0646\u0647 \u0646\u0633\u062E\u0629 \u0645\u0646 \u062A\u0639\u0628\u064A\u0631 XQPreparedExpression \u0622\u062E\u0631. \u0648\u0645\u0646 \u062B\u0645\u060C \u0644\u0627 \u064A\u0645\u0643\u0646 \u062A\u0643\u0648\u064A\u0646 \u062A\u0639\u0628\u064A\u0631 XQPreparedExpression \u062C\u062F\u064A\u062F \u0625\u0644\u0627 \u0645\u0646 \u062A\u0639\u0628\u064A\u0631 XQPreparedExpression \u0644\u0645 \u064A\u062A\u0645 \u062A\u0646\u0641\u064A\u0630\u0647\u060C \u0648\u0644\u0645 \u064A\u062A\u0645 \u0646\u0633\u062E\u0647 \u0645\u0646 \u062A\u0639\u0628\u064A\u0631 XQPreparedEXpression \u0622\u062E\u0631\u060C \u0648\u0644\u0627 \u064A\u0634\u062A\u0645\u0644 \u0639\u0644\u0649 \u0623\u064A \u0645\u062A\u063A\u064A\u0631\u0627\u062A \u0645\u0631\u062A\u0628\u0637\u0629.
XQJ-0765 = \u064A\u062C\u0628 \u0623\u0646 \u064A\u0643\u0648\u0646 \u0643\u0627\u0626\u0646 \u062A\u0639\u0628\u064A\u0631 XQPreparedExpression \u0645\u0646 \u062A\u0646\u0641\u064A\u0630 \u0627\u0644\u0637\u0628\u0642\u0629 \u0627\u0644\u0648\u0633\u0637\u0649 \u0644\u0640 Oracle XQJ
XQJ-0766 = \u062D\u062F\u062B \u062E\u0637\u0623 \u062F\u0627\u062E\u0644\u064A \u0628\u0627\u0644\u0645\u0634\u063A\u0644 \u0623\u062B\u0646\u0627\u0621 \u062A\u0643\u0648\u064A\u0646 \u0643\u0627\u0626\u0646 \u062A\u0639\u0628\u064A\u0631 XQPreparedExpression \u062C\u062F\u064A\u062F \u0645\u0646 \u0643\u0627\u0626\u0646 \u062A\u0639\u0628\u064A\u0631 XQPreparedExpression \u0622\u062E\u0631
XQJ-0767 = createsNewNodes() \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645\u0629 \u0641\u064A XQPreparedExpression
XQJ-0768 = isContextItemUnbound() \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645\u0629 \u0641\u064A XQPreparedExpression
XQJ-0769 = \u064A\u0634\u062A\u0645\u0644 XQPreparedExpression \u0639\u0644\u0649 \u0641\u0626\u0629 \u062A\u0639\u0628\u064A\u0631 \u063A\u064A\u0631 \u0635\u0627\u0644\u062D\u0629 
XQJ-0770 = getExpressionCategory() \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645\u0629 \u0641\u064A XQPreparedExpression
XQJ-0771 = \u0641\u0634\u0644 \u0627\u0644\u062A\u062D\u0648\u064A\u0644 \u0628\u064A\u0646 XQuery \u0648XQueryX
XQJ-0772 = \u062D\u062F\u062B \u0627\u0633\u062A\u062B\u0646\u0627\u0621 \u0641\u064A \u0645\u062F\u062E\u0644\u0627\u062A/\u0645\u062E\u0631\u062C\u0627\u062A \u062C\u0627\u0641\u0627 \u0639\u0646\u062F \u0645\u0639\u0627\u0644\u062C\u0629 \u0627\u0644\u0645\u062F\u062E\u0644\u0627\u062A
XQJ-0773 = getStaticResultType() \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645\u0629 \u0644\u0640 XQPreparedExpression
XQJ-0774 = getStaticVariableType() \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645\u0629 \u0644\u0640 XQPreparedExpression
XQJ-0775 = \u0627\u0644\u0646\u0633\u062E \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645 \u0628\u0627\u0644\u0646\u0633\u0628\u0629 \u0644\u0640 XQPreparedExpression
XQJ-0776 = \u0627\u0633\u062A\u062F\u0639\u0627\u0621 \u0647\u0630\u0627 \u0627\u0644\u0623\u0633\u0644\u0648\u0628 \u0628\u0639\u062F \u0625\u062D\u0636\u0627\u0631 \u0627\u0644\u0639\u0646\u0635\u0631 \u0628\u0627\u0644\u0641\u0639\u0644 \u0641\u064A \u062A\u0633\u0644\u0633\u0644 \u0623\u0645\u0627\u0645\u064A \u0641\u0642\u0637 \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645
XQJ-0777 = \u062D\u062F\u062B \u062E\u0637\u0623 \u0623\u062B\u0646\u0627\u0621 \u0625\u063A\u0644\u0627\u0642 \u0623\u062D\u062F \u0627\u0644\u0643\u0627\u0626\u0646\u0627\u062A \u0627\u0644\u0642\u0627\u0628\u0644\u0629 \u0644\u0644\u0637\u064A
XQJ-0778 = \u0627\u0644\u0643\u0627\u0626\u0646 \u0627\u0644\u0642\u0627\u0628\u0644 \u0644\u0644\u0637\u064A \u0627\u0644\u0645\u0642\u062F\u0645 \u063A\u064A\u0631 \u0645\u062F\u0639\u0648\u0645 \u0628\u0627\u0644\u0646\u0633\u0628\u0629 \u0644\u0647\u0630\u0627 \u0627\u0644\u0643\u0627\u0626\u0646 \u0627\u0644\u0631\u0626\u064A\u0633\u064A
XQJ-0779 = \u0627\u0644\u0643\u0627\u0626\u0646 \u0627\u0644\u0631\u0626\u064A\u0633\u064A \u0627\u0644\u0645\u0642\u062F\u0645 \u0644\u0627 \u064A\u0645\u0643\u0646 \u0623\u0646 \u064A\u0634\u062A\u0645\u0644 \u0639\u0644\u0649 \u0643\u0627\u0626\u0646\u0627\u062A \u0642\u0627\u0628\u0644\u0629 \u0644\u0644\u0637\u064A
XQJ-0780 = \u0627\u0633\u0645 \u063A\u064A\u0631 \u0645\u0639\u0631\u0648\u0641
XQJ-0781 = \u062A\u0635\u062D\u064A\u062D \u0627\u0644\u0623\u062E\u0637\u0627\u0621 \u063A\u064A\u0631 \u0645\u0645\u0643\u0646 \u0641\u064A \u0647\u0630\u0627 \u0627\u0644\u0627\u062A\u0635\u0627\u0644
XQJ-0782 = \u064A\u062C\u0628 \u062A\u0645\u0643\u064A\u0646 \u0627\u0633\u062A\u062E\u062F\u0627\u0645 \u0627\u0644\u062A\u062E\u0632\u064A\u0646 \u0627\u0644\u062E\u0627\u0631\u062C\u064A \u0641\u064A XQDataSource \u0642\u0628\u0644 \u062A\u0639\u064A\u064A\u0646 PageManager
XQJ-0783 = \u062A\u0645 \u062A\u0645\u0643\u064A\u0646 \u0627\u0633\u062A\u062E\u062F\u0627\u0645 \u0627\u0644\u062A\u062E\u0632\u064A\u0646 \u0627\u0644\u062E\u0627\u0631\u062C\u064A \u0641\u064A XQDataSource \u0648\u0645\u0646 \u062B\u0645 \u064A\u0644\u0632\u0645 \u062A\u062D\u062F\u064A\u062F PageManager \u0642\u0628\u0644 \u062A\u0646\u0641\u064A\u0630 \u0627\u0644\u0627\u0633\u062A\u0639\u0644\u0627\u0645
XQJ-0784 = \u062A\u0645 \u062A\u062D\u062F\u064A\u062F \u0648\u0636\u0639 \u063A\u064A\u0631 \u0635\u0627\u0644\u062D \u0641\u064A setUpdateMode
XQJ-0785 = \u064A\u062C\u0628 \u0623\u0646 \u064A\u0643\u0648\u0646 \u0627\u0644\u0639\u0646\u0635\u0631 \u0627\u0644\u0645\u062D\u062F\u062F \u0646\u0642\u0637\u0629 \u062A\u0648\u0635\u064A\u0644 \u0645\u0633\u062A\u0646\u062F
XQJ-0786 = \u064A\u0645\u0643\u0646 \u062A\u0639\u064A\u064A\u0646 \u0648\u0636\u0639 \u0627\u0644\u062A\u062D\u062F\u064A\u062B \u0641\u0642\u0637 \u0639\u0646\u062F \u062A\u0623\u062C\u064A\u0644 \u0648\u0636\u0639 \u0627\u0644\u0631\u0628\u0637
XQJ-0787 = \u0644\u0627 \u064A\u0645\u0643\u0646 \u0627\u0644\u0648\u0635\u0648\u0644 \u0625\u0644\u0649 \u0627\u0644\u062A\u0633\u0644\u0633\u0644 \u0628\u0639\u062F \u062D\u062F\u0648\u062B \u062E\u0637\u0623
XQJ-0788 = \u062D\u062F\u062B \u062E\u0637\u0623 \u0623\u062B\u0646\u0627\u0621 \u0627\u0633\u062A\u064A\u0631\u0627\u062F \u0645\u062E\u0637\u0637 \u0642\u0627\u0639\u062F\u0629 \u0627\u0644\u0628\u064A\u0627\u0646\u0627\u062A
XQJ-0789 = \u0642\u064A\u0645\u0629 \u0627\u0644\u0645\u0639\u0644\u0645\u0629: {0} \u063A\u064A\u0631 \u0635\u0627\u0644\u062D\u0629
XQJ-0790 = \u0627\u0644\u0646\u0648\u0639 \u0627\u0644\u0645\u0639\u0631\u0641 \u0628\u0648\u0627\u0633\u0637\u0629 \u0627\u0644\u0645\u0633\u062A\u062E\u062F\u0645 \u0628\u0646\u0641\u0633 \u0627\u0644\u0627\u0633\u0645 \u0648\u0644\u0643\u0646 \u0628\u0645\u0639\u0631\u0641 \u0645\u0648\u0627\u062F \u0645\u0646\u062A\u0638\u0645 (URI) \u0645\u062E\u062A\u0644\u0641 \u0644\u0645\u062E\u0637\u0637 \u0642\u0627\u0639\u062F\u0629 \u0627\u0644\u0628\u064A\u0627\u0646\u0627\u062A \u062A\u0645 \u062A\u0633\u062C\u064A\u0644\u0647 \u0628\u0627\u0644\u0641\u0639\u0644 \u0641\u064A \u0627\u0644\u0627\u062A\u0635\u0627\u0644
XQJ-0791 = \u0627\u0644\u0646\u0648\u0639 \u0627\u0644\u0623\u0633\u0627\u0633\u064A \u0627\u0644\u0645\u0642\u062F\u0645 \u063A\u064A\u0631 \u0645\u0637\u0627\u0628\u0642 \u0644\u0644\u0646\u0648\u0639 \u0627\u0644\u0623\u0633\u0627\u0633\u064A \u0627\u0644\u062E\u0627\u0635 \u0628\u0646\u0648\u0639 \u0645\u062E\u0637\u0637 \u0642\u0627\u0639\u062F\u0629 \u0627\u0644\u0628\u064A\u0627\u0646\u0627\u062A\u060C \u0648\u0647\u0648: {0}
XQJ-0792 = \u0644\u0645 \u064A\u062A\u0645 \u0627\u0644\u0639\u062B\u0648\u0631 \u0639\u0644\u0649 \u0627\u0644\u0645\u062A\u063A\u064A\u0631 "{0}"
XQJ-0793 = \u0644\u0645 \u064A\u062A\u0645 \u0627\u0644\u0639\u062B\u0648\u0631 \u0639\u0644\u0649 \u0627\u0633\u062A\u064A\u0631\u0627\u062F \u0645\u0633\u0627\u062D\u0629 \u0627\u0644\u0627\u0633\u0645 "{0}"
XQJ-0794 = \u0627\u0644\u0628\u0627\u062F\u0626\u0629 "{0}" \u063A\u064A\u0631 \u0645\u0639\u0631\u0648\u0641\u0629
XQJ-0795 = \u064A\u062C\u0628 \u0646\u0633\u062E \u062A\u0639\u0628\u064A\u0631 XQPreparedExpression \u0628\u0627\u0633\u062A\u062E\u062F\u0627\u0645 XQConnection \u0627\u0644\u0630\u064A \u0642\u0627\u0645 \u0628\u062A\u0643\u0648\u064A\u0646\u0647
XQJ-0796 = \u0644\u0627 \u064A\u0645\u0643\u0646 \u0627\u0633\u062A\u062F\u0639\u0627\u0621 \u0647\u0630\u0627 \u0627\u0644\u0623\u0633\u0644\u0648\u0628 \u0625\u0644\u0627 \u0641\u064A \u062D\u0627\u0644\u0629 \u062A\u0639\u064A\u064A\u0646 \u0648\u0636\u0639 \u0627\u0644\u0631\u0628\u0637 \u0639\u0644\u0649 \u0645\u0624\u062C\u0644
