/
/ $Header: wptg/xdk/src/java/xquery/resources/oracle/xml/xquery/exceptions/XQJExceptionMessages_ro.properties /generic/6 2014/04/25 05:14:38 gmolloy Exp $
/
/ XQMessages.txt
/
/ Copyright (c) Oracle Corporation 2000. All Rights Reserved.
/
/   NAME
/     XQMessages.properties
/
/   DESCRIPTION
/     <short description of component this file declares/defines>
/
/   NOTES
/     <other useful comments, qualifications, etc.>
/
/   MODIFIED   (MM/DD/YY)
/   morgiyan   04/28/11 - Fix a bug with context item not being allowed to be
/                         rebound in immediate mode
/   jspiegel   03/21/11 - Add debugger error message
/   morgiyan   03/17/11 - Add error for closing resources
/   morgiyan   02/20/11 - Add a missing error message re sequence being past
/                         the end
/   jspiegel   02/15/11 - Fix error message about not supporting any data
/                         source properties
/   morgiyan   01/21/11 - Add a new error message for XmlObjects getter
/   morgiyan   10/01/10 - Creation
/

#---------
# XQJ Errors (XQJ-0601 to XQJ-0900)
XQJ-0600 = metoda XQSequence nu poate fi apelat\u0103 pentru secven\u0163e nederulabile
XQJ-0601 = metoda nu poate fi apelat\u0103 din moment ce secven\u0163a este \u00EEnchis\u0103
XQJ-0602 = este obligatorie o instan\u0163\u0103 oracle.xml.parser.v2.XMLNode
XQJ-0603 = metoda nu poate fi apelat\u0103 din moment ce secven\u0163a din cache este \u00EEnchis\u0103
XQJ-0604 = este obligatorie o instan\u0163\u0103 OXQItem
XQJ-0605 = este obligatorie o instan\u0163\u0103 OXQItemType
XQJ-0606 = tipul transferat nu corespunde cu tipul a\u015Fteptat
XQJ-0611 = cursorul nu este plasat pe element
XQJ-0612 = XQSequence: Tipul elementului curent nu este cel obligatoriu
XQJ-0613 = XQSequence: Elementul poate fi preluat o singur\u0103 dat\u0103 dintr-o secven\u0163\u0103 nederulabil\u0103
XQJ-0614 = XQSequence: Elementul nu este un nod
XQJ-0615 = XQItem: Tipul elementului nu este cel obligatoriu
XQJ-0616 = XQItem: Elementul nu este un nod
XQJ-0617 = metoda nu poate fi apelat\u0103 din moment ce conexiunea este \u00EEnchis\u0103
XQJ-0618 = XQPreparedExpression: Expresia este \u00EEnchis\u0103
XQJ-0619 = getStaticVariableType \u00EEn XQPreparedExpression: \u00CEn contextul static nu exist\u0103 nici o variabil\u0103 extern\u0103 cu numele specificat
XQJ-0620 = setQueryLanguageAndVersion \u00EEn XQConnection: Elementul ''{0}'' nu este acceptat
XQJ-0621 = setUpdatability \u00EEn XQConnection: Elementul ''{0}'' nu este acceptat
XQJ-0622 = bindItem \u00EEn OXQExpression poate prelua numai o instan\u0163\u0103 oracle.xquery.xqj.OXQItem
XQJ-0623 = bindItem \u00EEn OXQPreparedExpression poate prelua numai o instan\u0163\u0103 oracle.xquery.xqj.OXQItem
XQJ-0624 = problem\u0103 de interoperabilitate: OXQExpression poate prelua numai o instan\u0163\u0103 oracle.xquery.xqj.OXQItem
XQJ-0625 = bindContextItem \u00EEn OXQPreparedExpression poate prelua numai o instan\u0163\u0103 oracle.xquery.xqj.OXQItem
XQJ-0626 = metoda nu poate fi apelat\u0103 din moment ce expresia preg\u0103tit\u0103 este \u00EEnchis\u0103
XQJ-0627 = metoda nu poate fi apelat\u0103 din moment ce elementul este \u00EEnchis
XQJ-0628 = este obligatorie o instan\u0163\u0103 oracle.xquery.xqj.OXQSequenceType
XQJ-0629 = tipul specificat nu este acceptat pt. valoarea de intrare
XQJ-0630 = este obligatorie o instan\u0163\u0103 oracle.xquery.xqj.OXQItem
XQJ-0631 = este obligatorie o instan\u0163\u0103 oracle.xquery.xqj.OXQItemType
XQJ-0632 = rutina comun\u0103 prestabilit\u0103 accept\u0103 numai tipurile de baz\u0103 
XQJ-0633 = rutina comun\u0103 nu a fost setat\u0103
XQJ-0634 = metoda nu poate fi apelat\u0103 din moment ce expresia este \u00EEnchis\u0103
XQJ-0635 = valoarea returnat\u0103 nu se \u00EEncadreaz\u0103 \u00EEn intervalul corespunz\u0103tor unui tip Java byte
XQJ-0636 = valoarea returnat\u0103 nu se \u00EEncadreaz\u0103 \u00EEn intervalul corespunz\u0103tor unui tip Java short
XQJ-0637 = valoarea returnat\u0103 nu se \u00EEncadreaz\u0103 \u00EEn intervalul corespunz\u0103tor unui tip Java int
XQJ-0638 = valoarea returnat\u0103 nu se \u00EEncadreaz\u0103 \u00EEn intervalul corespunz\u0103tor unui tip Java long
XQJ-0639 = valoarea returnat\u0103 nu se \u00EEncadreaz\u0103 \u00EEn intervalul corespunz\u0103tor unui tip Java BigInteger
XQJ-0640 = tipul elementului de context nu corespunde tipului de element de context static
XQJ-0641 = nu se poate transfera unei func\u0163ii un parametru de intrare nul
XQJ-0642 = bindSequence poate accepta numai o instan\u0163\u0103 oracle.xquery.xqj.OXQSequence
XQJ-0643 = numele variabilei externe nu poate fi nul \u00EEn metoda de legare
XQJ-0644 = metoda poate fi apelat\u0103 numai cu un tip Atomic, nu cu un tip Nod
XQJ-0645 = a e\u015Fuat conversia valorii la o instan\u0163\u0103 XDM
XQJ-0646 = problem\u0103 de interoperabilitate: elementul nu este interoperabil
XQJ-0647 = problem\u0103 de interoperabilitate: tipul de element de context static nu este interoperabil
XQJ-0648 = tipul definit de utilizator nu poate fi utilizat pentru legarea sau crearea unui document \u00EEn aceast\u0103 implementare. Aceast\u0103 implementare accept\u0103 doar tipuri XQuery integrate.
XQJ-0649 = tipul specificat pentru legarea sau crearea unui document nu este un tip de element pt. document sau un tip de element pt. schema documentului.
XQJ-0650 = valoarea specificat\u0103 pentru legare sau creare este nul\u0103.
XQJ-0651 = interogarea furnizat\u0103 este nul\u0103.
XQJ-0652 = nu s-a putut lega sau crea elementul, deoarece obiectul surs\u0103 nu este acceptat. Sunt acceptate numai SAXSource, StreamSource \u015Fi DOMSource.
XQJ-0653 = cel pu\u0163in unul dintre parametrii specifica\u0163i este nul.
XQJ-0654 = parametrul specificat este nul.
XQJ-0655 = parametrul OS specificat este nul
XQJ-0656 = parametrul OW specificat este nul
XQJ-0657 = tipul de baz\u0103 specificat nu este acceptat
XQJ-0658 = numele specificat pentru tip refer\u0103 un tip predefinit, dar este diferit de tipul de baz\u0103
XQJ-0659 = OXQConnection: confirmarea nu este acceptat\u0103
XQJ-0660 = OXQConnection: metoda nu este implementat\u0103
XQJ-0661 = aceast\u0103 implementare necesit\u0103 un obiect de context static Oracle
XQJ-0662 = OXQConnection: derularea \u00EEnapoi nu este acceptat\u0103
XQJ-0663 = nu s-a putut stabili tipul duratei
XQJ-0664 = nu s-a putut stabili tipul calendarului gregorian xml
XQJ-0665 = obiectul furnizat nu este acceptat
XQJ-0666 = argumentul pentru tipul de element este nul
XQJ-0667 = Eroare XMLReader la interpretare
XQJ-0668 = nu s-a putut extrage nodul din DOMSource; conversia la XDM a e\u015Fuat
XQJ-0669 = nu s-a putut extrage sursa intr\u0103rii sau cititorul xml din SAXSource; conversia la XDM a e\u015Fuat
XQJ-0670 = nu s-a putut extrage fluxul intr\u0103rii sau cititorul din StreamSource; conversia la XDM a e\u015Fuat
XQJ-0671 = eroare la opera\u0163ia createAttributeType() pentru OXQDataFactory - baseType nu este acceptat
XQJ-0672 = eroare la opera\u0163ia createAttributeType() pentru OXQDataFactory - dac\u0103 este specificat schemaURI, trebuie specificat \u015Fi numele tipului
XQJ-0673 = eroare la opera\u0163ia createSchemaAttributeType() pentru OXQDataFactory - baseType nu este acceptat
XQJ-0674 = Eroare la opera\u0163ia createSchemaAttributeType() pentru OXQDataFactory - numele nodului nu poate fi nul
XQJ-0675 = func\u0163ia accept\u0103 un buffer nul ca prim argument
XQJ-0676 = e\u015Fec la preluarea primului element din secven\u0163\u0103
XQJ-0677 = nodul atributului nu este acceptat \u00EEn serializare
XQJ-0678 = parametrul transmis nu este un XQItemType valid
XQJ-0679 = prefixul este necunoscut
XQJ-0680 = eroare la opera\u0163ia createDocumentElementType() pentru OXQDataFactory - tipul de element nu poate fi nul
XQJ-0681 = eroare la opera\u0163ia createDocumentElementType() pentru OXQDataFactory - tipul de element pentru elementType nu este valid
XQJ-0682 = eroare la opera\u0163ia createDocumentSchemaElementType() pentru OXQDataFactory - tipul de element nu poate fi nul
XQJ-0683 = eroare la opera\u0163ia createDocumentSchemaElementType() pentru OXQDataFactory - tipul de element pentru elementType nu este valid
XQJ-0684 = eroare la opera\u0163ia createElementType() pentru OXQDataFactory - dac\u0103 este specificat schemaURI, trebuie specificat \u015Fi numele tipului
XQJ-0685 = eroare la opera\u0163ia createSchemaElementType() pentru OXQDataFactory - numele nodului nu poate fi nul
XQJ-0686 = eroare la opera\u0163ia createSequenceType() pentru OXQDataFactory -  elementul este nul \u015Fi apari\u0163ia nu este XQSequenceType.OCC_EMPTY
XQJ-0687 = eroare la opera\u0163ia createSequenceType() pentru OXQDataFactory -  elementul nu este nul \u015Fi apari\u0163ia este XQSequenceType.OCC_EMPTY
XQJ-0688 = eroare la opera\u0163ia createSequenceType() pentru OXQDataFactory - apari\u0163ia specificat\u0103 nu este valid\u0103
XQJ-0689 = eroare la opera\u0163ia createNdTyp() pentru OXQDataFactory - baseType nu este acceptat
XQJ-0690 = XQDataSource: getConnection(conn) nu este acceptat
XQJ-0691 = numele propriet\u0103\u0163ii nu este recunoscut
XQJ-0692 = valorile propriet\u0103\u0163ii date sunt nevalide. Aceast\u0103 implementare nu accept\u0103 nicio proprietate
XQJ-0693 = OXQExpression: executeCommand nu este acceptat
XQJ-0694 = nu s-a putut identifica obiectul de interogare
XQJ-0695 = oracle.xml.parser.v2.XMLParseException
XQJ-0696 = org.xml.sax.SAXException
XQJ-0697 = nu s-au putut crea DatatypeFactory sau Duration
XQJ-0698 = nu s-a putut crea DatatypeFactory
XQJ-0699 = XQStaticContext: Prefix nevalid pentru metoda getNamespaceURI 
XQJ-0700 = tip neacceptat \u00EEn getObject()
XQJ-0701 = rela\u0163ia instanceOf nu poate fi stabilit\u0103, deoarece elementul curent are un tip de schem\u0103 definit de utilizator. Tipurile de schem\u0103 definite de utilizator nu sunt acceptate de aceast\u0103 implementare
XQJ-0702 = rela\u0163ia instanceOf nu poate fi stabilit\u0103, deoarece tipul de intrare este un tip de schem\u0103 definit de utilizator. Tipurile de schem\u0103 definite de utilizator nu sunt acceptate de aceast\u0103 implementare
XQJ-0703 = XQItem: Eroare writeItemToSAX
XQJ-0704 = XQItemType.getBaseType(): tipul de element nu este valid
XQJ-0705 = XQItemType.getTypeName(): tipul de element nu este valid
XQJ-0706 = XQItemType.getPIName(): tipul de element nu este valid
XQJ-0707 = XQItemType.getNodeName(): tipul de element nu este valid
XQJ-0708 = nu s-a putut prelua cititorul sau fluxul de intrare
XQJ-0709 = XQResultSequence: eroare writeSequenceToSAX
XQJ-0710 = XQResultSequence: eroare writeItemToSAX
XQJ-0711 = a fost specificat un mod nevalid \u00EEn setConstructionMode
XQJ-0712 = a fost specificat un mod nevalid \u00EEn setOrderingMode
XQJ-0713 = a fost specificat\u0103 o ordonare nevalid\u0103 \u00EEn setDefaultOrderForEmptySequences
XQJ-0714 = a fost specificat un mod nevalid \u00EEn setBoundarySpacePolicy
XQJ-0715 = a fost specificat un mod nevalid \u00EEn setCopyNamespacesModePreserve
XQJ-0716 = a fost specificat un mod nevalid \u00EEn setCopyNamespacesModeInherit
XQJ-0717 = a fost specificat un mod nevalid \u00EEn setBindingMode
XQJ-0718 = a fost specificat un mod nevalid \u00EEn setHoldability
XQJ-0719 = tip de limb\u0103 nevalid \u00EEn setQueryLanguageTypeAndVersion
XQJ-0720 = capacitate de derulare nevalid\u0103 \u00EEn setScrollability
XQJ-0721 = parametrul pentru secunde pentru setQueryTimeout nu poate fi 0
XQJ-0722 = OXQUtils:printResult()
XQJ-0723 = OXQUtils.makeOXQItemType - tip necunoscut 1
XQJ-0724 = OXQUtils.makeOXQItemType - tip necunoscut 2
XQJ-0725 = OXQUtils.makeOXQItemType - tip necunoscut 3
XQJ-0726 = OXQUtils:setContextItem - elementul nu este OXQItem
XQJ-0727 = tip necunoscut de eveniment de flux XML
XQJ-0728 = problem\u0103 \u00EEn OXQUtils.cnvStreamToDOM.
XQJ-0729 = baseItemType necunoscut \u00EEn OXQUtils.normalizeSequence
XQJ-0730 = nu s-a putut crea XMLStreamReader
XQJ-0731 = problem\u0103 de interoperabilitate: tipul definit de utilizator nu este interoperabil
XQJ-0732 = documentul de intrare f\u0103r\u0103 tip nu este o instan\u0163\u0103 a tipului specificat, conform regulilor de coresponden\u0163\u0103 pentru tipul de secven\u0163\u0103 XQuery
XQJ-0733 = nodul de intrare nu este o instan\u0163\u0103 a tipului specificat
XQJ-0734 = tip de baz\u0103 necunoscut
XQJ-0735 = XQItemType a survenit cu un tip neacceptat
XQJ-0736 = a fost furnizat un tip neacceptat pentru obiectul \u015Fir
XQJ-0737 = nu s-a putut prelua reprezentarea XQueryX pentru interogarea de intrare
XQJ-0738 = parametrul Nume este null
XQJ-0739 = valoarea pt. proprietate este nevalid\u0103
XQJ-0740 = eroare la crearea unei conexiuni la baza de date - nu sunt setate toate propriet\u0103\u0163ile necesare
XQJ-0741 = nu s-a putut prelua reprezentarea XQueryX pentru interogarea de intrare
XQJ-0742 = variabila de legare ''{0}'' nu este definit\u0103
XQJ-0743 = tip de legare neacceptat
XQJ-0744 = numele propriet\u0103\u0163ii nu este recunoscut
XQJ-0745 = a survenit o eroare la accesarea elementului curent
XQJ-0746 = metoda nu poate fi apelat\u0103, deoarece secven\u0163a este pozi\u0163ionat\u0103 dup\u0103 ultimul element
XQJ-0747 = a survenit o eroare la preluarea elementului ca nod DOM
XQJ-0748 = a survenit o eroare la serializarea elementului
XQJ-0749 = a survenit o eroare la serializarea secven\u0163ei
XQJ-0750 = Variabila nu este declarat\u0103 ca extern\u0103 \u00EEn interogare, sau dac\u0103 este legat un elementul de context, acest element de context nu este utilizat \u00EEn interogare
XQJ-0751 = nu toate variabilele externe sunt legate
XQJ-0752 = nu exist\u0103 niciun element de context nelegat \u00EEn interogare
XQJ-0753 = secven\u0163a de intrare nu are niciun element
XQJ-0754 = nu s-a putut g\u0103si tipul specificat, definit de utilizator
XQJ-0757 = intrarea este formatat\u0103 incorect sau a survenit o condi\u0163ie de procesare nea\u015Fteptat\u0103; conversia la XDM a e\u015Fuat
XQJ-0759 = a survenit o eroare la accesarea tipului elementului
XQJ-0760 = Excep\u0163ie a motorului intern
XQJ-0761 = a fost specificat un mod nevalid \u00EEn setAccessorMode
XQJ-0762 = a fost specificat un mod nevalid \u00EEn setProcessingMode
XQJ-0763 = A survenit o eroare la preluarea elementului ca XmlObject
XQJ-0764 = Expresia de intrare XQPrepareExpression a fost executat\u0103, sau are variabile legate sau este ea \u00EEns\u0103\u015Fi o copie a unei alte expresii XQPreparedExpression. O nou\u0103 expresie XQPreparedExpression se poate crea doar dintr-o expresie XQPreparedExpression care nu a fost executat\u0103, nu a fost copiat\u0103 din alt\u0103 expresie XQPreparedEXpression \u015Fi nu are variabile legate.
XQJ-0765 = Obiectul din XQPreparedExpression trebuie s\u0103 fie dintr-o implementare Oracle XQJ mid-tier
XQJ-0766 = A survenit o eroare a motorului intern la crearea unui nou obiect XQPreparedExpression dintr-un alt obiect XQPreparedExpression
XQJ-0767 = createsNewNodes() nu este acceptat\u0103 \u00EEn aceast\u0103 XQPreparedExpression
XQJ-0768 = isContextItemUnbound() nu este acceptat\u0103 \u00EEn aceast\u0103 XQPreparedExpression
XQJ-0769 = Aceast\u0103 expresie XQPreparedExpression are o categorie nevalid\u0103
XQJ-0770 = getExpressionCategory() nu este acceptat\u0103 \u00EEn aceast\u0103 XQPreparedExpression
XQJ-0771 = E\u015Fec la conversia dintre XQuery \u015Fi XQueryX
XQJ-0772 = A survenit o excep\u0163ie Java I/O la procesarea intr\u0103rii
XQJ-0773 = getStaticResultType() nu este acceptat\u0103 pt. aceast\u0103 XQPreparedExpression
XQJ-0774 = getStaticVariableType() nu este acceptat\u0103 pt. aceast\u0103 XQPreparedExpression
XQJ-0775 = Aceast\u0103 expresie XQPreparedExpression nu permite copierea
XQJ-0776 = Nu este permis\u0103 apelarea acestei metode dup\u0103 ce elementul a fost deja preluat pe o secven\u0163\u0103 doar cu redirec\u0163ionare
XQJ-0777 = A survenit o eroare la \u00EEnchiderea unuia din obiectele ce pot fi \u00EEnchise
XQJ-0778 = Obiectul furnizat (ce poate fi \u00EEnchis) nu este acceptat pt. acest obiect principal
XQJ-0779 = Obiectul principal furnizat nu poate avea obiecte ce pot fi \u00EEnchise
XQJ-0780 = Nume necunoscut
XQJ-0781 = Aceast\u0103 conexiune nu permite depanarea
XQJ-0782 = Trebuie activat\u0103 utilizarea stoc\u0103rii externe pe XQDataSource \u00EEnainte de a seta PageManager
XQJ-0783 = Utilizarea stoc\u0103rii externe este activat\u0103 pe XQDataSource, deci trebuie specificat PageManager \u00EEnainte de a executa interogarea
XQJ-0784 = a fost specificat un mod nevalid \u00EEn setUpdateMode
XQJ-0785 = Elementul specificat trebuie s\u0103 fie un nod de document
XQJ-0786 = Modul de actualizare poate fi setat doar atunci c\u00E2nd este am\u00E2nat modul de legare
XQJ-0787 = Secven\u0163a nu se poate accesa dup\u0103 o eroare
XQJ-0788 = A survenit o eroare la importul schemei
XQJ-0789 = Valoarea {0} este nevalid\u0103 pt. parametru.
XQJ-0790 = Tipul definit de utilizator, cu acela\u015Fi nume dar cu un URI de schem\u0103 diferit, a fost deja \u00EEnregistrat pe conexiune
XQJ-0791 = Tipul de baz\u0103 furnizat nu corespunde celui al tipului de schem\u0103 creat, care este: {0}
XQJ-0792 = Variabila "{0}" nu a fost g\u0103sit\u0103
XQJ-0793 = Importul pt. spa\u0163iul de nume "{0}" nu a fost g\u0103sit
XQJ-0794 = Prefixul "{0}" nu este recunoscut
XQJ-0795 = Expresia XQPreparedExpression trebuie copiat\u0103 utiliz\u00E2ndu-se conexiunea XQConnection care a creat-o
XQJ-0796 = Aceast\u0103 metod\u0103 poate fi apelat\u0103 doar dac\u0103 modul de legare este setat la Am\u00E2nat
