/
/ $Header: wptg/xdk/src/java/xquery/resources/oracle/xml/xquery/exceptions/XQJExceptionMessages_da.properties /generic/6 2014/04/25 07:06:59 gmolloy Exp $
/
/ XQMessages.txt
/
/ Copyright (c) Oracle Corporation 2000. All Rights Reserved.
/
/   NAME
/     XQMessages.properties
/
/   DESCRIPTION
/     <short description of component this file declares/defines>
/
/   NOTES
/     <other useful comments, qualifications, etc.>
/
/   MODIFIED   (MM/DD/YY)
/   morgiyan   04/28/11 - Fix a bug with context item not being allowed to be
/                         rebound in immediate mode
/   jspiegel   03/21/11 - Add debugger error message
/   morgiyan   03/17/11 - Add error for closing resources
/   morgiyan   02/20/11 - Add a missing error message re sequence being past
/                         the end
/   jspiegel   02/15/11 - Fix error message about not supporting any data
/                         source properties
/   morgiyan   01/21/11 - Add a new error message for XmlObjects getter
/   morgiyan   10/01/10 - Creation
/

#---------
# XQJ Errors (XQJ-0601 to XQJ-0900)
XQJ-0600 = XQSequence-metode kan ikke kaldes fra sekvenser, der ikke kan rulles
XQJ-0601 = metode kan ikke kaldes, da sekvensen er lukket
XQJ-0602 = en instans af oracle.xml.parser.v2.XMLNode er p\u00E5kr\u00E6vet
XQJ-0603 = metode kan ikke kaldes, da den cachede sekvens er lukket
XQJ-0604 = en instans af OXQItem er p\u00E5kr\u00E6vet
XQJ-0605 = en instans af OXQItemType er p\u00E5kr\u00E6vet
XQJ-0606 = den sendte type matcher ikke den forventede type
XQJ-0611 = mark\u00F8r er ikke p\u00E5 element
XQJ-0612 = XQSequence: aktuelt element er ikke af den p\u00E5kr\u00E6vede type
XQJ-0613 = XQSequence: element kan kun hentes \u00E9n gang fra en sekvens, der ikke kan rulles
XQJ-0614 = XQSequence: element er ikke en node
XQJ-0615 = XQItem: element er ikke af den p\u00E5kr\u00E6vede type
XQJ-0616 = XQItem: element er ikke en node
XQJ-0617 = metode kan ikke kaldes, da forbindelsen er lukket
XQJ-0618 = XQPreparedExpression: udtryk er lukket
XQJ-0619 = getStaticVariableType i XQPreparedExpression: ingen ekstern variabel med det angivne navn i den statiske kontekst
XQJ-0620 = setQueryLanguageAndVersion i XQConnection: ''{0}'' underst\u00F8ttes ikke
XQJ-0621 = setUpdatability i XQConnection: ''{0}'' underst\u00F8ttes ikke
XQJ-0622 = bindItem i OXQExpression kan kun tage \u00E9n instans af oracle.xquery.xqj.OXQItem
XQJ-0623 = bindItem i OXQPreparedExpression kan kun tage \u00E9n instans af oracle.xquery.xqj.OXQItem
XQJ-0624 = problem med interoperabilitet: OXQExpression kan kun tage \u00E9n instans af oracle.xquery.xqj.OXQItem
XQJ-0625 = bindContextItem i OXQPreparedExpression kan kun tage \u00E9n instans af oracle.xquery.xqj.OXQItem
XQJ-0626 = metode kan ikke kaldes, da det forberedte udtryk er lukket
XQJ-0627 = metode kan ikke kaldes, da elementet er lukket
XQJ-0628 = en instans af oracle.xquery.xqj.OXQSequenceType er p\u00E5kr\u00E6vet
XQJ-0629 = angivet type underst\u00F8ttes ikke for inputv\u00E6rdien
XQJ-0630 = en instans af oracle.xquery.xqj.OXQItem er p\u00E5kr\u00E6vet
XQJ-0631 = en instans af oracle.xquery.xqj.OXQItemType er p\u00E5kr\u00E6vet
XQJ-0632 = almindelig standard-handler underst\u00F8tter kun basistyperne 
XQJ-0633 = almindelig handler er ikke sat
XQJ-0634 = metode kan ikke kaldes, da udtryk er lukket
XQJ-0635 = returv\u00E6rdien ligger ikke inden for intervallet af en Java-byte-type
XQJ-0636 = returv\u00E6rdien ligger ikke inden for intervallet af en Java-short-type
XQJ-0637 = returv\u00E6rdien ligger ikke inden for intervallet af en Java-int-type
XQJ-0638 = returv\u00E6rdien ligger ikke inden for intervallet af en Java-long-type
XQJ-0639 = returv\u00E6rdien ligger ikke inden for intervallet af en Java-BigInteger-type
XQJ-0640 = kontekstelementtypen matcher ikke den statiske kontekstelementtype
XQJ-0641 = kan ikke sende NULL-parameteren til funktionen
XQJ-0642 = bindSequence kan kun acceptere en instans af oracle.xquery.xqj.OXQSequence
XQJ-0643 = navnet p\u00E5 en ekstern variabel kan ikke v\u00E6re NULL i tilknytningsmetoden
XQJ-0644 = metoden kan kun kaldes med en atomisk type, ikke en nodetype
XQJ-0645 = konverteringen af v\u00E6rdi til en XDM-instans fejlede
XQJ-0646 = problem med interoperabilitet: element er ikke interoperabelt
XQJ-0647 = problem med interoperabilitet: statisk kontekstelementtype er ikke interoperabelt
XQJ-0648 = brugerdefineret type kan ikke bruges til binding eller oprettelse af et dokument i denne implementering. Denne implementering underst\u00F8tter kun indbyggede XQuery-typer.
XQJ-0649 = den type, der er angivet til binding eller oprettelse af et dokument, er ikke en dokumentelement- eller dokumentskemaelementtype.
XQJ-0650 = den v\u00E6rdi, der er angivet til binding eller oprettelse, er NULL
XQJ-0651 = den angivne foresp\u00F8rgsel er NULL
XQJ-0652 = kunne ikke oprette eller binde element, da det specifikke kildeobjekt ikke underst\u00F8ttes. Kun SAXSource, StreamSource og DOMSource underst\u00F8ttes.
XQJ-0653 = et af de angivne parametre er NULL
XQJ-0654 = det angivne parameter er NULL
XQJ-0655 = det angivne os-parameter er NULL
XQJ-0656 = det angivne ow-parameter er NULL
XQJ-0657 = den angivne basistype underst\u00F8ttes ikke
XQJ-0658 = det angivne typenavn refererer til en foruddefineret type, men adskiller sig fra basistypen
XQJ-0659 = OXQConnection: commit underst\u00F8ttes ikke
XQJ-0660 = OXQConnection: metode er ikke implementeret
XQJ-0661 = denne implementering kr\u00E6ver et statisk Oracle-kontekstobjekt
XQJ-0662 = OXQConnection: tilbagestilling underst\u00F8ttes ikke
XQJ-0663 = kunne ikke bestemme varighedstypen
XQJ-0664 = kunne ikke bestemme typen af gregoriansk xml-kalender
XQJ-0665 = det angivne objekt underst\u00F8ttes ikke
XQJ-0666 = elementtypeargumentet er NULL
XQJ-0667 = XMLReader-fejl under analyse
XQJ-0668 = kunne ikke udtr\u00E6kke node fra DOMSource, konvertering til XDM fejlede
XQJ-0669 = kunne ikke udtr\u00E6kke inputkilde eller xml-l\u00E6ser fra SAXSource, konvertering til XDM fejlede
XQJ-0670 = kunne ikke udtr\u00E6kke inputstr\u00F8m eller -l\u00E6ser fra StreamSource, konvertering til XDM fejlede
XQJ-0671 = fejl  i createAttributeType() for OXQDataFactory - baseType underst\u00F8ttes ikke
XQJ-0672 = fejl i createAttributeType() for OXQDataFactory - hvis schemaURI er angivet, skal typenavnet ogs\u00E5 angives
XQJ-0673 = fejl i createSchemaAttributeType() for OXQDataFactory - baseType underst\u00F8ttes ikke
XQJ-0674 = Fejl i createSchemaAttributeType() for OXQDataFactory - nodenavn kan ikke v\u00E6re NULL
XQJ-0675 = funktion accepterer en NULL-buffer som det f\u00F8rste argument
XQJ-0676 = kunne ikke hente det f\u00F8rste element i sekvensen
XQJ-0677 = attributnode underst\u00F8ttes ikke i serialisering
XQJ-0678 = den videregivne parameter er ikke en gyldig XQItemType
XQJ-0679 = pr\u00E6fikset er ukendt
XQJ-0680 = fejl i createDocumentElementType() for OXQDataFactory - elementType kan ikke v\u00E6re NULL
XQJ-0681 = fejl i createDocumentElementType() for OXQDataFactory - elementtype i elementType er ikke gyldig
XQJ-0682 = fejl i createDocumentSchemaElementType() for OXQDataFactory - elementType kan ikke v\u00E6re NULL
XQJ-0683 = fejl i createDocumentSchemaElementType() for OXQDataFactory - elementtype i elementType er ikke gyldig
XQJ-0684 = fejl i createElementType() for OXQDataFactory - hvis schemaURI er angivet, skal typenavnet ogs\u00E5 angives
XQJ-0685 = fejl i createSchemaElementType() for OXQDataFactory - nodenavn kan ikke v\u00E6re NULL
XQJ-0686 = fejl i createSequenceType() for OXQDataFactory - element er NULL, og forekomsten er ikke XQSequenceType.OCC_EMPTY
XQJ-0687 = fejl i createSequenceType() for OXQDataFactory - element er ikke NULL, og forekomsten er XQSequenceType.OCC_EMPTY
XQJ-0688 = fejl i createSequenceType() for OXQDataFactory - den angivne forekomst er ikke gyldig
XQJ-0689 = fejl i createNdTyp() for OXQDataFactory - baseType underst\u00F8ttes ikke
XQJ-0690 = XQDataSource: getConnection(conn) underst\u00F8ttes ikke
XQJ-0691 = egenskabens navn genkendes ikke
XQJ-0692 = v\u00E6rdier for den angivne egenskab er ugyldige. Denne implementering underst\u00F8tter ikke nogen egenskaber
XQJ-0693 = OXQExpression: executeCommand underst\u00F8ttes ikke
XQJ-0694 = kunne ikke identificere foresp\u00F8rgselsobjektet
XQJ-0695 = oracle.xml.parser.v2.XMLParseException
XQJ-0696 = org.xml.sax.SAXException
XQJ-0697 = kunne ikke oprette DatatypeFactory eller varighed
XQJ-0698 = kunne ikke oprette DatatypeFactory
XQJ-0699 = XQStaticContext: ugyldigt pr\u00E6fiks for metoden getNamespaceURI 
XQJ-0700 = ikke-underst\u00F8ttet type i getObject()
XQJ-0701 = instanceOf relationship kan ikke bestemmes, da det aktuelle element har en brugerdefineret skematype. Brugerdefineret skematype underst\u00F8ttes ikke af denne implementering
XQJ-0702 = instanceOf relationship kan ikke bestemmes, da inputtypen er en brugerdefineret skematype. Brugerdefineret skematype underst\u00F8ttes  ikke af denne implementering
XQJ-0703 = XQItem: writeItemToSAX-fejl
XQJ-0704 = XQItemType.getBaseType(): Elementtypen er ikke gyldig
XQJ-0705 = XQItemType.getTypeName(): Elementtypen er ikke gyldig
XQJ-0706 = XQItemType.getPIName(): Elementtypen er ikke gyldig
XQJ-0707 = XQItemType.getNodeName(): Elementtypen er ikke gyldig
XQJ-0708 = kunne ikke hente l\u00E6ser eller inputstr\u00F8m
XQJ-0709 = XQResultSequence: writeSequenceToSAX-fejl
XQJ-0710 = XQResultSequence: writeItemToSAX-fejl
XQJ-0711 = ugyldig tilstand er angivet i setConstructionMode
XQJ-0712 = ugyldig tilstand er angivet i setOrderingMode
XQJ-0713 = ugyldig tilstand er angivet i setDefaultOrderForEmptySequences
XQJ-0714 = ugyldig tilstand er angivet i setBoundarySpacePolicy
XQJ-0715 = ugyldig tilstand er angivet i setCopyNamespacesModePreserve
XQJ-0716 = ugyldig tilstand er angivet i setCopyNamespacesModeInherit
XQJ-0717 = ugyldig tilstand er angivet i setBindingMode
XQJ-0718 = ugyldig tilstand er angivet i setHoldability
XQJ-0719 = ugyldig sprogtype i setQueryLanguageTypeAndVersion
XQJ-0720 = ugyldig rullefunktion i setScrollability
XQJ-0721 = sekundparametret for setQueryTimeout kan ikke v\u00E6re 0
XQJ-0722 = OXQUtils:printResult()
XQJ-0723 = OXQUtils.makeOXQItemType - ukendt type1
XQJ-0724 = OXQUtils.makeOXQItemType - ukendt type2
XQJ-0725 = OXQUtils.makeOXQItemType - ukendt type3
XQJ-0726 = OXQUtils:setContextItem - element er ikke OXQItem
XQJ-0727 = ukendt h\u00E6ndelsestype for XML-str\u00F8m
XQJ-0728 = problem i OXQUtils.cnvStreamToDOM.
XQJ-0729 = ukendt baseItemType i OXQUtils.normalizeSequence
XQJ-0730 = kunne ikke oprette XMLStreamReader
XQJ-0731 = problem med interoperabilitet: Brugerdefineret type er ikke interoperabel
XQJ-0732 = ikke-indtastet inputdokument er ikke en instans af den angivne type i henhold til reglerne i XQuery Sequence Type Matching
XQJ-0733 = inputnode er ikke en instans af den angivne type
XQJ-0734 = ukendt basistype
XQJ-0735 = fandt XQItemType med ikke-underst\u00F8ttet type
XQJ-0736 = ikke-underst\u00F8ttet type er angivet for strengobjektet
XQJ-0737 = kunne ikke hente XQueryX-repr\u00E6sentationen for inputforesp\u00F8rgslen
XQJ-0738 = navneparameteren er NULL
XQJ-0739 = egenskabens v\u00E6rdi er ugyldig
XQJ-0740 = fejl under oprettelse af en databaseforbindelse - ikke alle de n\u00F8dvendige egenskaber er sat
XQJ-0741 = kunne ikke hente XQueryX-repr\u00E6sentationen for inputforesp\u00F8rgslen
XQJ-0742 = tilknytningsvariablen ''{0}'' er ikke defineret
XQJ-0743 = ikke-underst\u00F8ttet bindingstype
XQJ-0744 = egenskabens navn genkendes ikke
XQJ-0745 = der opstod en fejl under oprettelse af adgang til det aktuelle element
XQJ-0746 = metode kan ikke kaldes, da sekvens er placeret efter det sidste element
XQJ-0747 = der opstod en fejl under hentning af elementet som en DOM-node
XQJ-0748 = der opstod en fejl under serialisering af elementet
XQJ-0749 = der opstod en fejl under serialisering af sekvensen
XQJ-0750 = variablen er ikke erkl\u00E6ret som ekstern i foresp\u00F8rgslen, eller, hvis kontekstelementet bindes, bruges dette kontekstelement ikke i foresp\u00F8rgslen
XQJ-0751 = ikke alle de eksterne variabler er bundet
XQJ-0752 = der er intet ubundet kontekstelement i foresp\u00F8rgslen
XQJ-0753 = inputsekvensen har ingen elementer
XQJ-0754 = kunne ikke finde den angivne brugerdefinerede type
XQJ-0757 = input er forkert udformet, eller der er en uventet behandlingsbetingelse, konvertering til XDM fejlede
XQJ-0759 = der opstod en fejl under oprettelse af adgang til elementets type
XQJ-0760 = intern undtagelse i programmodul
XQJ-0761 = ugyldig tilstand er angivet i setAccessorMode
XQJ-0762 = ugyldig tilstand er angivet i setProcessingMode
XQJ-0763 = der opstod en fejl under hentning af elementet som et XmlObject
XQJ-0764 = det angivne XQPrepareExpression er udf\u00F8rt eller har bundne variabler eller er selv en kopi af et andet XQPreparedExpression. Nyt XQPreparedExpression kan kun oprettes ud fra et XQPreparedExpression, der ikke er udf\u00F8rt, ikke er kopieret fra et andet XQPreparedEXpression og ikke har nogen bundne variabler.
XQJ-0765 = XQPreparedExpression-objektet skal v\u00E6re fra en Oracle XQJ-midtier-implementering
XQJ-0766 = intern fejl i programmodul under oprettelse af et nyt XQPreparedExpression-objekt ud fra et andet XQPreparedExpression-objekt
XQJ-0767 = createsNewNodes() underst\u00F8ttes ikke i dette XQPreparedExpression
XQJ-0768 = isContextItemUnbound() underst\u00F8ttes ikke i dette XQPreparedExpression
XQJ-0769 = dette XQPreparedExpression havde en ugyldig udtrykskategori 
XQJ-0770 = getExpressionCategory() underst\u00F8ttes ikke i dette XQPreparedExpression
XQJ-0771 = konvertering mellem XQuery og XQueryX fejlede
XQJ-0772 = Java I/O-undtagelse blev fundet under behandling af input
XQJ-0773 = getStaticResultType() underst\u00F8ttes ikke for dette XQPreparedExpression
XQJ-0774 = getStaticVariableType() underst\u00F8ttes ikke for dette XQPreparedExpression
XQJ-0775 = kopiering underst\u00F8ttes ikke for dette XQPreparedExpression
XQJ-0776 = kald af denne metode, efter at elementet allerede er hentet i en sekvens, der kun er fremadg\u00E5ende, underst\u00F8ttes p.t. ikke
XQJ-0777 = der opstod en fejl under lukning af et af de elementer, der kan lukkes
XQJ-0778 = det angivne objekt, der kan lukkes, underst\u00F8ttes ikke for dette hovedobjekt
XQJ-0779 = det angivne hovedobjekt kan ikke have objekter, der kan lukkes
XQJ-0780 = ukendt navn
XQJ-0781 = debugging er ikke aktiveret for denne forbindelse
XQJ-0782 = brug af eksternt lager skal aktiveres i XQDataSource, f\u00F8r der s\u00E6ttes en PageManager
XQJ-0783 = brug af eksternt lager er aktiveret i XQDataSource, s\u00E5 der skal angives en PageManager, f\u00F8r foresp\u00F8rgslen udf\u00F8res
XQJ-0784 = ugyldig tilstand er angivet i setUpdateMode
XQJ-0785 = det angivne element skal v\u00E6re en dokumentnode
XQJ-0786 = opdateringstilstand kan kun s\u00E6ttes, n\u00E5r bindingstilstanden er udskudt
XQJ-0787 = kan ikke f\u00E5 adgang til sekvensen efter en fejl
XQJ-0788 = der opstod en fejl under skemaimport
XQJ-0789 = ugyldig parameterv\u00E6rdi: {0}
XQJ-0790 = brugerdefineret type med det samme navn, men en anden skema-URI (Uniform Resource Identifier) er allerede registeret for forbindelsen
XQJ-0791 = angivet basistype matcher ikke basistypen for den oprettede skematype, som er: {0}
XQJ-0792 = variablen "{0}" findes ikke
XQJ-0793 = importen til navneomr\u00E5det "{0}" findes ikke
XQJ-0794 = pr\u00E6fikset "{0}" er ukendt
XQJ-0795 = XQPreparedExpression skal kopieres ved hj\u00E6lp af den XQConnection, der har oprettet det
XQJ-0796 = denne metode kan kun kaldes, hvis bindingstilstanden er sat til udskudt
