parser.parse.1=Car\u00E1cter incorreto.
parser.parse.2=N\u00FAmero de refer\u00EAncia inv\u00E1lido.
parser.next.1=\u00C9 necess\u00E1rio um car\u00E1cter a seguir a \\.
parser.next.2=N\u00E3o era esperado '?'. '(?:' ou '(?=' ou '(?!' ou '(?<' ou '(?#' ou '(?>'?
parser.next.3=Era esperado '(?<=' ou '(?<!'.
parser.next.4=Um coment\u00E1rio  n\u00E3o foi terminado .
parser.factor.1=Era esperado ')'.
parser.factor.2=Fim inesperado do padr\u00E3o num grupo de modificadores.
parser.factor.3=Era esperado ':'.
parser.factor.4=Fim inesperado do padr\u00E3o num grupo condicional.
parser.factor.5=Era esperada uma refer\u00EAncia anterior, uma \u00E2ncora, um lookahead ou um lookbehind num padr\u00E3o condicional.
parser.factor.6=Existem mais de tr\u00EAs escolhas num grupo condicional.
parser.atom.1=\u00C9 necess\u00E1rio que \\c seja seguido por um car\u00E1cter em U+0040-U+005f.
parser.atom.2=\u00C9 necess\u00E1rio um '{' antes de uma categoria de car\u00E1ter.
parser.atom.3=Um nome de propriedade n\u00E3o est\u00E1 fechado por '}'.
parser.atom.4=Metacar\u00E1cter inesperado.
parser.atom.5=Propriedade desconhecida.
parser.cc.1=\u00C9 necess\u00E1rio que uma classe de caracteres de POSIX seja fechada por ':]'.
parser.cc.2=Fim inesperado do padr\u00E3o numa classe de caracteres.
parser.cc.3=Nome desconhecido para uma classe de caracteres de POSIX.
parser.cc.4='-' \u00E9 inv\u00E1lido aqui.
parser.cc.5=Era esperado ']'.
parser.cc.6='[' \u00E9 inv\u00E1lido numa classe de caracteres. Escreva '\\['.
parser.cc.7=']' \u00E9 inv\u00E1lido numa classe de caracteres. Escreva '\\]'.
parser.cc.8='-' \u00E9 um intervalo de caracteres inv\u00E1lido. Escreva '\\-'.
parser.ope.1=Era esperado '['.
parser.ope.2=Era esperado ')' ou '-[' ou '+[' ou '&['.
parser.ope.3=O ponto de c\u00F3digo de fim do intervalo \u00E9 inferior ao ponto de c\u00F3digo de in\u00EDcio.
parser.descape.1=Nota\u00E7\u00E3o hexadecimal de Unicode inv\u00E1lida.
parser.descape.2=Excesso de dados numa nota\u00E7\u00E3o hexadecimal.
parser.descape.3=\u00C9 necess\u00E1rio que '\\x{' seja fechado por '}'.
parser.descape.4=Ponto de c\u00F3digo de Unicode inv\u00E1lido.
parser.descape.5=N\u00E3o deve existir uma \u00E2ncora aqui.
parser.process.1=Esta express\u00E3o n\u00E3o \u00E9 suportada na defini\u00E7\u00E3o da op\u00E7\u00E3o atual.
parser.quantifier.1=Quantificador inv\u00E1lido. Era esperado um d\u00EDgito.
parser.quantifier.2=Quantificador inv\u00E1lido. Quantidade inv\u00E1lida ou falta um '}'.
parser.quantifier.3=Quantificador inv\u00E1lido. Era esperado um d\u00EDgito ou '}'.
parser.quantifier.4=Quantificador inv\u00E1lido. \u00C9 necess\u00E1rio que uma quantidade m\u00EDn. seja <= \u00E0 quantidade m\u00E1x.
parser.quantifier.5=Quantificador inv\u00E1lido. Excesso de dados no valor da quantidade.
