parser.parse.1=Caracter incorect.
parser.parse.2=Nr. de referin\u0163\u0103 nevalid.
parser.next.1=Este necesar un caracter dup\u0103 \\.
parser.next.2='?' nu este caracterul preconizat. '(?:' sau '(?=' sau '(?!' sau '(?<' sau '(?#' sau '(?>'?
parser.next.3=Se preconiza caracterul '(?<=' sau '(?<!'
parser.next.4=Unul din comentarii nu a fost \u00EEncheiat.
parser.factor.1=Se preconiza ')'
parser.factor.2=Tiparul dintr-un grup de modificatori se \u00EEncheie \u00EEntr-un mod nea\u015Fteptat.
parser.factor.3=Se preconiza ':'
parser.factor.4=A survenit o \u00EEncheiere nea\u015Fteptat\u0103 a tiparului \u00EEntr-un grup condi\u0163ional.
parser.factor.5=\u00CEntr-un tipar condi\u0163ional este a\u015Fteptat\u0103 o referin\u0163\u0103 \u00EEnapoi, o ancor\u0103, un lookahead sau un lookbehind.
parser.factor.6=Exist\u0103 mai mult de trei alegeri \u00EEntr-un grup condi\u0163ional.
parser.atom.1=Dup\u0103 \\c trebuie s\u0103 urmeze un caracter \u00EEn U+0040-U+005f.
parser.atom.2=Este obligatoriu caracterul '{' \u00EEnaintea unei categorii de caractere.
parser.atom.3=Unul din numele de propriet\u0103\u0163i nu se \u00EEncheie cu '}'.
parser.atom.4=Metacaracter nea\u015Fteptat.
parser.atom.5=Proprietate necunoscut\u0103.
parser.cc.1=O clas\u0103 de caractere POSIX trebuie s\u0103 se \u00EEncheie cu ':]'.
parser.cc.2=Tiparul unei clase de caractere se \u00EEncheie \u00EEntr-un mod nea\u015Fteptat.
parser.cc.3=S-a g\u0103sit un nume necunoscut pt. o clas\u0103 de caractere POSIX.
parser.cc.4=Caracterul '-' este nevalid aici.
parser.cc.5=Se preconiza caracterul ']'
parser.cc.6=Caracterul '[' este nevalid \u00EEntr-o clas\u0103 de caractere. \u00CEnlocui\u0163i-l cu '\\['.
parser.cc.7=Caracterul ']' nu este valid \u00EEntr-o clas\u0103 de caractere. \u00CEnlocui\u0163i-l cu '\\]'.
parser.cc.8='-' este un interval de caractere nevalid. \u00CEnlocui\u0163i-l cu '\\-'.
parser.ope.1=Se a\u015Ftepta caracterul '['
parser.ope.2=Se a\u015Ftepta unul din aceste caractere: ')' sau '-[' sau '+[' sau '&['.
parser.ope.3=Codepointul pt. sf\u00E2r\u015Fitul intervalului este mai mic dec\u00E2t cel pt. \u00EEnceputul intervalului.
parser.descape.1=Nota\u0163ia hexazecimal\u0103 Unicode este nevalid\u0103.
parser.descape.2=A ap\u0103rut un overflow \u00EEntr-o nota\u0163ie hexazecimal\u0103.
parser.descape.3='\\x{' trebuie s\u0103 se \u00EEncheie cu caracterul '}'.
parser.descape.4=Codepoint Unicode nevalid.
parser.descape.5=Aici nu trebuie s\u0103 se afle o ancor\u0103.
parser.process.1=Aceast\u0103 expresie nu este acceptat\u0103 \u00EEn setarea curent\u0103 a op\u0163iunii.
parser.quantifier.1=Cuantificator nevalid. Se a\u015Ftepta o cifr\u0103.
parser.quantifier.2=Cuantificator nevalid. Cantitatea este nevalid\u0103 sau lipse\u015Fte o parantez\u0103 de acest tip: '}'.
parser.quantifier.3=Cuantificator nevalid. Se a\u015Ftepta o cifr\u0103 sau caracterul '}'.
parser.quantifier.4=Cuantificator nevalid. O cantitate minim\u0103 trebuie s\u0103 fie mai mic\u0103 dec\u00E2t sau egal\u0103 cu cea maxim\u0103.
parser.quantifier.5=Cuantificator nevalid. A ap\u0103rut un overflow al unei valori de cantitate.
