parser.parse.1=\u0E2D\u0E31\u0E01\u0E02\u0E23\u0E30\u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07
parser.parse.2=\u0E40\u0E25\u0E02\u0E17\u0E35\u0E48\u0E01\u0E32\u0E23\u0E2D\u0E49\u0E32\u0E07\u0E2D\u0E34\u0E07\u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07
parser.next.1=\u0E15\u0E49\u0E2D\u0E07\u0E21\u0E35\u0E2D\u0E31\u0E01\u0E02\u0E23\u0E30\u0E2B\u0E25\u0E31\u0E07\u0E08\u0E32\u0E01 \\
parser.next.2=\u0E44\u0E21\u0E48\u0E15\u0E49\u0E2D\u0E07\u0E01\u0E32\u0E23 '?'  '(?:' \u0E2B\u0E23\u0E37\u0E2D '(?=' \u0E2B\u0E23\u0E37\u0E2D '(?!' \u0E2B\u0E23\u0E37\u0E2D '(?<' \u0E2B\u0E23\u0E37\u0E2D '(?#' \u0E2B\u0E23\u0E37\u0E2D '(?>'?
parser.next.3=\u0E15\u0E49\u0E2D\u0E07\u0E01\u0E32\u0E23 '(?<=' \u0E2B\u0E23\u0E37\u0E2D '(?<!'
parser.next.4=\u0E44\u0E21\u0E48\u0E21\u0E35\u0E40\u0E04\u0E23\u0E37\u0E48\u0E2D\u0E07\u0E2B\u0E21\u0E32\u0E22\u0E1B\u0E34\u0E14\u0E04\u0E27\u0E32\u0E21\u0E40\u0E2B\u0E47\u0E19
parser.factor.1=\u0E15\u0E49\u0E2D\u0E07\u0E01\u0E32\u0E23 ')'
parser.factor.2=\u0E1E\u0E1A\u0E08\u0E38\u0E14\u0E2A\u0E34\u0E49\u0E19\u0E2A\u0E38\u0E14\u0E02\u0E2D\u0E07\u0E23\u0E39\u0E1B\u0E41\u0E1A\u0E1A\u0E43\u0E19\u0E01\u0E25\u0E38\u0E48\u0E21\u0E15\u0E31\u0E27\u0E41\u0E01\u0E49\u0E44\u0E02\u0E42\u0E14\u0E22\u0E44\u0E21\u0E48\u0E04\u0E32\u0E14\u0E2B\u0E21\u0E32\u0E22
parser.factor.3=\u0E15\u0E49\u0E2D\u0E07\u0E01\u0E32\u0E23 ':'
parser.factor.4=\u0E1E\u0E1A\u0E08\u0E38\u0E14\u0E2A\u0E34\u0E49\u0E19\u0E2A\u0E38\u0E14\u0E02\u0E2D\u0E07\u0E23\u0E39\u0E1B\u0E41\u0E1A\u0E1A\u0E43\u0E19\u0E01\u0E25\u0E38\u0E48\u0E21\u0E17\u0E35\u0E48\u0E21\u0E35\u0E40\u0E07\u0E37\u0E48\u0E2D\u0E19\u0E44\u0E02\u0E42\u0E14\u0E22\u0E44\u0E21\u0E48\u0E04\u0E32\u0E14\u0E2B\u0E21\u0E32\u0E22
parser.factor.5=\u0E15\u0E49\u0E2D\u0E07\u0E01\u0E32\u0E23\u0E01\u0E32\u0E23\u0E2D\u0E49\u0E32\u0E07\u0E2D\u0E34\u0E07\u0E01\u0E25\u0E31\u0E1A\u0E2B\u0E23\u0E37\u0E2D\u0E41\u0E2D\u0E07\u0E40\u0E04\u0E2D\u0E23\u0E4C \u0E2B\u0E23\u0E37\u0E2D\u0E01\u0E32\u0E23\u0E2D\u0E48\u0E32\u0E19\u0E25\u0E48\u0E27\u0E07\u0E2B\u0E19\u0E49\u0E32\u0E2B\u0E23\u0E37\u0E2D\u0E01\u0E32\u0E23\u0E2D\u0E48\u0E32\u0E19\u0E22\u0E49\u0E2D\u0E19\u0E01\u0E25\u0E31\u0E1A\u0E43\u0E19\u0E23\u0E39\u0E1B\u0E41\u0E1A\u0E1A\u0E17\u0E35\u0E48\u0E21\u0E35\u0E40\u0E07\u0E37\u0E48\u0E2D\u0E19\u0E44\u0E02
parser.factor.6=\u0E21\u0E35\u0E40\u0E07\u0E37\u0E48\u0E2D\u0E19\u0E44\u0E02\u0E21\u0E32\u0E01\u0E01\u0E27\u0E48\u0E32\u0E2A\u0E32\u0E21\u0E23\u0E32\u0E22\u0E01\u0E32\u0E23\u0E43\u0E19\u0E01\u0E25\u0E38\u0E48\u0E21\u0E17\u0E35\u0E48\u0E21\u0E35\u0E40\u0E07\u0E37\u0E48\u0E2D\u0E19\u0E44\u0E02
parser.atom.1=\u0E2D\u0E31\u0E01\u0E02\u0E23\u0E30\u0E43\u0E19 U+0040-U+005f \u0E15\u0E49\u0E2D\u0E07\u0E15\u0E32\u0E21\u0E2B\u0E25\u0E31\u0E07 \\c
parser.atom.2=\u0E15\u0E49\u0E2D\u0E07\u0E21\u0E35 '{' \u0E01\u0E48\u0E2D\u0E19\u0E0A\u0E19\u0E34\u0E14\u0E2D\u0E31\u0E01\u0E02\u0E23\u0E30
parser.atom.3=\u0E0A\u0E37\u0E48\u0E2D\u0E04\u0E38\u0E13\u0E2A\u0E21\u0E1A\u0E31\u0E15\u0E34\u0E44\u0E21\u0E48\u0E44\u0E14\u0E49\u0E1B\u0E34\u0E14\u0E14\u0E49\u0E27\u0E22 '}'
parser.atom.4=\u0E1E\u0E1A\u0E2D\u0E31\u0E01\u0E02\u0E23\u0E30\u0E40\u0E21\u0E15\u0E30\u0E17\u0E35\u0E48\u0E44\u0E21\u0E48\u0E04\u0E32\u0E14\u0E2B\u0E21\u0E32\u0E22
parser.atom.5=\u0E44\u0E21\u0E48\u0E23\u0E39\u0E49\u0E08\u0E31\u0E01\u0E04\u0E38\u0E13\u0E2A\u0E21\u0E1A\u0E31\u0E15\u0E34
parser.cc.1=\u0E04\u0E25\u0E32\u0E2A\u0E02\u0E2D\u0E07\u0E2D\u0E31\u0E01\u0E02\u0E23\u0E30 POSIX \u0E15\u0E49\u0E2D\u0E07\u0E1B\u0E34\u0E14\u0E14\u0E49\u0E27\u0E22 ':]'
parser.cc.2=\u0E1E\u0E1A\u0E08\u0E38\u0E14\u0E2A\u0E34\u0E49\u0E19\u0E2A\u0E38\u0E14\u0E02\u0E2D\u0E07\u0E23\u0E39\u0E1B\u0E41\u0E1A\u0E1A\u0E43\u0E19\u0E04\u0E25\u0E32\u0E2A\u0E02\u0E2D\u0E07\u0E2D\u0E31\u0E01\u0E02\u0E23\u0E30\u0E42\u0E14\u0E22\u0E44\u0E21\u0E48\u0E04\u0E32\u0E14\u0E2B\u0E21\u0E32\u0E22
parser.cc.3=\u0E44\u0E21\u0E48\u0E23\u0E39\u0E49\u0E08\u0E31\u0E01\u0E0A\u0E37\u0E48\u0E2D\u0E2A\u0E33\u0E2B\u0E23\u0E31\u0E1A\u0E04\u0E25\u0E32\u0E2A\u0E02\u0E2D\u0E07\u0E2D\u0E31\u0E01\u0E02\u0E23\u0E30 POSIX
parser.cc.4='-' \u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07\u0E43\u0E19\u0E2A\u0E48\u0E27\u0E19\u0E19\u0E35\u0E49
parser.cc.5=\u0E15\u0E49\u0E2D\u0E07\u0E01\u0E32\u0E23 ']'
parser.cc.6='[' \u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07\u0E43\u0E19\u0E04\u0E25\u0E32\u0E2A\u0E02\u0E2D\u0E07\u0E2D\u0E31\u0E01\u0E02\u0E23\u0E30 \u0E40\u0E02\u0E35\u0E22\u0E19 '\\['
parser.cc.7=']' \u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07\u0E43\u0E19\u0E04\u0E25\u0E32\u0E2A\u0E02\u0E2D\u0E07\u0E2D\u0E31\u0E01\u0E02\u0E23\u0E30 \u0E40\u0E02\u0E35\u0E22\u0E19 '\\]'
parser.cc.8='-' \u0E40\u0E1B\u0E47\u0E19\u0E0A\u0E48\u0E27\u0E07\u0E02\u0E2D\u0E07\u0E2D\u0E31\u0E01\u0E02\u0E23\u0E30\u0E17\u0E35\u0E48\u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07 \u0E40\u0E02\u0E35\u0E22\u0E19 '\\-'
parser.ope.1=\u0E15\u0E49\u0E2D\u0E07\u0E01\u0E32\u0E23 '['
parser.ope.2=\u0E15\u0E49\u0E2D\u0E07\u0E01\u0E32\u0E23 ')' \u0E2B\u0E23\u0E37\u0E2D '-[' \u0E2B\u0E23\u0E37\u0E2D '+[' \u0E2B\u0E23\u0E37\u0E2D '&['
parser.ope.3=\u0E42\u0E04\u0E49\u0E14\u0E1E\u0E2D\u0E22\u0E15\u0E4C\u0E2A\u0E34\u0E49\u0E19\u0E2A\u0E38\u0E14\u0E02\u0E2D\u0E07\u0E0A\u0E48\u0E27\u0E07\u0E19\u0E49\u0E2D\u0E22\u0E01\u0E27\u0E48\u0E32\u0E42\u0E04\u0E49\u0E14\u0E1E\u0E2D\u0E22\u0E15\u0E4C\u0E40\u0E23\u0E34\u0E48\u0E21\u0E15\u0E49\u0E19
parser.descape.1=\u0E01\u0E32\u0E23\u0E23\u0E30\u0E1A\u0E38\u0E40\u0E25\u0E02\u0E10\u0E32\u0E19\u0E2A\u0E34\u0E1A\u0E2B\u0E01\u0E02\u0E2D\u0E07\u0E22\u0E39\u0E19\u0E34\u0E42\u0E04\u0E49\u0E14\u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07
parser.descape.2=\u0E21\u0E35\u0E42\u0E2D\u0E40\u0E27\u0E2D\u0E23\u0E4C\u0E42\u0E1F\u0E25\u0E27\u0E4C\u0E43\u0E19\u0E01\u0E32\u0E23\u0E23\u0E30\u0E1A\u0E38\u0E40\u0E25\u0E02\u0E10\u0E32\u0E19\u0E2A\u0E34\u0E1A\u0E2B\u0E01
parser.descape.3='\\x{' \u0E15\u0E49\u0E2D\u0E07\u0E1B\u0E34\u0E14\u0E14\u0E49\u0E27\u0E22 '}'
parser.descape.4=\u0E42\u0E04\u0E49\u0E14\u0E1E\u0E2D\u0E22\u0E15\u0E4C\u0E02\u0E2D\u0E07\u0E22\u0E39\u0E19\u0E34\u0E42\u0E04\u0E49\u0E14\u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07
parser.descape.5=\u0E41\u0E2D\u0E07\u0E40\u0E04\u0E2D\u0E23\u0E4C\u0E15\u0E49\u0E2D\u0E07\u0E44\u0E21\u0E48\u0E2D\u0E22\u0E39\u0E48\u0E17\u0E35\u0E48\u0E19\u0E35\u0E48
parser.process.1=\u0E23\u0E30\u0E1A\u0E1A\u0E44\u0E21\u0E48\u0E23\u0E2D\u0E07\u0E23\u0E31\u0E1A\u0E40\u0E2D\u0E47\u0E01\u0E0B\u0E4C\u0E40\u0E1E\u0E23\u0E2A\u0E0A\u0E31\u0E19\u0E19\u0E35\u0E49\u0E43\u0E19\u0E01\u0E32\u0E23\u0E15\u0E31\u0E49\u0E07\u0E04\u0E48\u0E32\u0E15\u0E31\u0E27\u0E40\u0E25\u0E37\u0E2D\u0E01\u0E1B\u0E31\u0E08\u0E08\u0E38\u0E1A\u0E31\u0E19
parser.quantifier.1=\u0E04\u0E27\u0E2D\u0E19\u0E15\u0E34\u0E44\u0E1F\u0E40\u0E2D\u0E2D\u0E23\u0E4C\u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07 \u0E23\u0E30\u0E1A\u0E1A\u0E15\u0E49\u0E2D\u0E07\u0E01\u0E32\u0E23\u0E15\u0E31\u0E27\u0E40\u0E25\u0E02
parser.quantifier.2=\u0E04\u0E27\u0E2D\u0E19\u0E15\u0E34\u0E44\u0E1F\u0E40\u0E2D\u0E2D\u0E23\u0E4C\u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07 \u0E08\u0E33\u0E19\u0E27\u0E19\u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07 \u0E2B\u0E23\u0E37\u0E2D '}' \u0E02\u0E32\u0E14\u0E2B\u0E32\u0E22\u0E44\u0E1B
parser.quantifier.3=\u0E04\u0E27\u0E2D\u0E19\u0E15\u0E34\u0E44\u0E1F\u0E40\u0E2D\u0E2D\u0E23\u0E4C\u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07 \u0E23\u0E30\u0E1A\u0E1A\u0E15\u0E49\u0E2D\u0E07\u0E01\u0E32\u0E23\u0E15\u0E31\u0E27\u0E40\u0E25\u0E02\u0E2B\u0E23\u0E37\u0E2D '}'
parser.quantifier.4=\u0E04\u0E27\u0E2D\u0E19\u0E15\u0E34\u0E44\u0E1F\u0E40\u0E2D\u0E2D\u0E23\u0E4C\u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07 \u0E08\u0E33\u0E19\u0E27\u0E19\u0E15\u0E48\u0E33\u0E2A\u0E38\u0E14\u0E15\u0E49\u0E2D\u0E07\u0E21\u0E35\u0E04\u0E48\u0E32 <= \u0E08\u0E33\u0E19\u0E27\u0E19\u0E2A\u0E39\u0E07\u0E2A\u0E38\u0E14
parser.quantifier.5=\u0E04\u0E27\u0E2D\u0E19\u0E15\u0E34\u0E44\u0E1F\u0E40\u0E2D\u0E2D\u0E23\u0E4C\u0E44\u0E21\u0E48\u0E16\u0E39\u0E01\u0E15\u0E49\u0E2D\u0E07 \u0E04\u0E48\u0E32\u0E02\u0E2D\u0E07\u0E08\u0E33\u0E19\u0E27\u0E19\u0E42\u0E2D\u0E40\u0E27\u0E2D\u0E23\u0E4C\u0E42\u0E1F\u0E25\u0E27\u0E4C
