# Default (English) exception messages.
#
# See XQuery*Exception.java for Java-language codes corresponding to these
# QNames.

########## Standard dynamic exceptions ########################################

err\:XPDY0002="{0}" : valeur de contexte dynamique non d\u00E9finie
err\:XQDY0025="{0}" : attribut en double
err\:XQDY0026=L'instruction de traitement ne peut pas contenir "?>"
err\:XQDY0027=Echec de la validation : {0}
err\:XQST0040="{0}" : attribut en double
err\:XQDY0041=Conversion en NCName impossible : {0}
err\:XQDY0044=Nom d'attribut interdit
err\:XPDY0050=Le type dynamique ne correspond pas au type indiqu\u00E9 par l''expression TREAT : {0}
err\:XQDY0061=Contenu de noeud de document interdit
err\:XQDY0062=Contrainte de noeud de document non satisfaite
err\:XQDY0064=Le nom d'instruction de traitement calcul\u00E9 ne peut pas \u00EAtre "XML"
err\:XQDY0072=Un commentaire calcul\u00E9 ne peut pas contenir "--" ni se terminer par "-"
err\:XQDY0074=Impossible de d\u00E9velopper l''\u00E9l\u00E9ment QName : {0}
err\:XQDY0084=El\u00E9ment "{0}" introuvable \u00E0 l''aide des d\u00E9clarations de type d''\u00E9l\u00E9ment du p\u00E9rim\u00E8tre
err\:XQDY0096=Le nom donn\u00E9 au constructeur d'\u00E9l\u00E9ment calcul\u00E9 n'est pas valide
err\:FOAR0001=Division par z\u00E9ro
err\:FOAR0002="{0}" : soupassement/d\u00E9bordement num\u00E9rique
err\:FOCA0001="{0}" : conversion d\u00E9cimale impossible
err\:FOCA0002="{0}" : valeur lexicale incorrecte
err\:FOCA0004="{0}" : conversion en nombre entier impossible
err\:FOCA0005=NaN fourni en tant que valeur flottante/double
err\:FOCH0001=Point de code incorrect : {0}
err\:FOCH0002="{0}" : classement non pris en charge
err\:FOCH0003="{0}" : forme de normalisation non prise en charge
err\:FOCH0004="{0}" : classement inad\u00E9quat pour cette fonction
err\:FODC0001=Aucun document de contexte
err\:FODC0002=Erreur lors de l''extraction de la ressource "{0}" : {1}
err\:FODC0004="{0}": argument non valide pour fn:collection()
err\:FODC0005="{0}" : argument non valide pour fn:doc()
err\:FODT0001=D\u00E9bordement dans le calcul de la date/de l'heure
err\:FODT0002=Soupassement/d\u00E9bordement dans l'op\u00E9ration de dur\u00E9e
err\:FODT0003="{0}" : fuseau horaire non valide
err\:FOER0000=Erreur non identifi\u00E9e
err\:FONS0003="{0}" : pr\u00E9fixe non d\u00E9fini dans le contexte statique
err\:FONS0004="{0}" : espace de noms introuvable pour ce pr\u00E9fixe
err\:FONS0005=L'URI de base n'a pas \u00E9t\u00E9 d\u00E9fini
err\:FORG0001="{0}" : valeur CAST/valeur de constructeur non valide : {1}
err\:FORG0002="{0}" : argument non valide pour fn:resolve-uri()
err\:FORG0003=attendu : un \u00E9l\u00E9ment ou aucun, obtenu : au moins deux \u00E9l\u00E9ments
err\:FORG0004=attendu : au moins un \u00E9l\u00E9ment, obtenu : aucun \u00E9l\u00E9ment
err\:FORG0005=attendu : exactement un \u00E9l\u00E9ment, obtenu : {0} \u00E9l\u00E9ments
err\:FORG0006="{0}" : type d''argument non valide
err\:FORG0008=Un fuseau horaire est d\u00E9fini pour les deux arguments de fn:dateTime : "{0}" et "{1}"
err\:FORG0009=fn:resolve-uri() appel\u00E9 avec l''URI de base non absolu "{0}"
err\:FORX0001=Indicateurs d'expression r\u00E9guli\u00E8re non valides
err\:FORX0002="{0}" : expression r\u00E9guli\u00E8re non valide
err\:FORX0003=L''expression r\u00E9guli\u00E8re correspond \u00E0 une cha\u00EEne de longueur nulle : "{0}"
err\:FORX0004="{0}" : cha\u00EEne de remplacement non valide
err\:FOTY0011=L'\u00E9l\u00E9ment de contexte n'est pas un noeud

########## Oracle-specific dynamic exceptions ####################################

ora-err\:TBDDYNAMIC=TBD DYNAMIC: {0}
ora-err\:XPDY0002a=El\u00E9ment de contexte requis, mais non d\u00E9fini (ou '$' manquant avant un nom de variable)
ora-err\:XPDY0002b="{0}" : variable externe non li\u00E9e
ora-err\:XPDY0002c="{0}" : URI de document non valide
ora-err\:XQDY0027a=Attribut "{0}" introuvable pour la validation
ora-err\:XQDY0027b=El\u00E9ment "{0}" introuvable pour la validation
ora-err\:ENT001=Impossible de r\u00E9soudre l''URI "{0}" : mod\u00E8le inconnu
ora-err\:FODC0002a=Erreur lors de l''analyse du document XML d''entr\u00E9e "{0}" {1}
ora-err\:FODC0002b=Erreur lors de l'analyse du document XML d'entr\u00E9e : un curseur StAX ne peut \u00EAtre utilis\u00E9 qu'une fois
ora-err\:FODC0002c=Collecte par d\u00E9faut non d\u00E9finie
ora-err\:FO0001="{0}" : argument non valide pour la fonction {1}
ora-err\:FO0002="{0}" n''a pas le format attendu {1}
ora-err\:NS0001="{0}" : le pr\u00E9fixe est d\u00E9j\u00E0 li\u00E9 \u00E0 {1}
ora-err\:FOUD0001=La proc\u00E9dure {0} a \u00E9t\u00E9 appel\u00E9e avec une entr\u00E9e incompl\u00E8te
ora-err\:MEM0001=La demande exige {0} op\u00E9rateurs g\u00E9r\u00E9s par la m\u00E9moire, mais seuls {1} sont disponibles

########## Standard static exceptions #########################################

err\:FONC0001=\u00E9l\u00E9ment de contexte non d\u00E9fini
err\:XPST0001="{0}" : valeur de contexte statique non d\u00E9finie
err\:XPST0003=Expression non valide : {0}
err\:XPST0005=Impossible d'affecter un type vide
err\:XPST0008=Nom "{0}" introuvable dans le contexte statique
err\:XPST0051="{0}" : type non d\u00E9fini ou non atomique
err\:XQST0009=Fonctionnalit\u00E9 d'import de sch\u00E9ma non prise en charge
err\:XPST0010=Fonctionnalit\u00E9 d'axe complet non prise en charge
err\:XQST0012=Sch\u00E9ma non valide {0}. {1}
err\:XQST0013=Contenus pragma non valides. {0}
err\:XQST0014=Contenus d''extension non valides. {0}
err\:XQST0016=Fonctionnalit\u00E9 de module non prise en charge
err\:XPST0017="{0}" : fonction inconnue (ou nombre d''arguments ({1}) incorrect) {2}
err\:XQST0022=L'attribut de d\u00E9claration d'espace de noms doit \u00EAtre un litt\u00E9ral de cha\u00EEne
err\:XQST0031="{0}" : version non prise en charge
err\:XQST0032="{0}" : d\u00E9claration d''URI de base en double
err\:XQST0033="{0}" : d\u00E9claration de pr\u00E9fixe d''espace de noms en double
err\:XQST0034="{0}" : fonction d\u00E9j\u00E0 d\u00E9clar\u00E9e ou import\u00E9e
err\:XQST0035="{0}" : nom d\u00E9j\u00E0 import\u00E9
err\:XQST0038="{0}" : classements inconnus ou multiples
err\:XQST0039="{0}" : nom de param\u00E8tre de fonction en double
err\:XQST0045=La fonction "{0}" est d\u00E9clar\u00E9e dans l''espace de noms r\u00E9serv\u00E9 : "{1}"
err\:XQST0046="{0}" : URI interdit
err\:XQST0047="{0}" : espace de noms cible en double
err\:XQST0048="{0}" : le nom doit \u00EAtre dans l''espace de noms cible du module : "{1}"
err\:XQST0049="{0}" : nom de variable en double
err\:XQST0054=La d\u00E9claration de l''\u00E9l\u00E9ment "{0}" comporte une expression d''initialisation qui d\u00E9pend directement ou indirectement de l''\u00E9l\u00E9ment "{0}" : ({1})
err\:XQST0055=Plusieurs d\u00E9clarations copy-namespaces
err\:XQST0056="{0}" : espace de noms cible utilis\u00E9 en important le module
err\:XQST0057=Un import de sch\u00E9ma ne peut pas lier un pr\u00E9fixe si l'espace de noms est vide
err\:XQST0058="{0}" : espace de noms cible en double
err\:XQST0059=Sch\u00E9ma ou module introuvable
err\:XQST0060="{0}" : le nom de fonction ne peut pas avoir un espace de noms vide
err\:XQST0065=Plusieurs d\u00E9clarations de classement par d\u00E9faut
err\:XQST0066=Plusieurs d\u00E9clarations d'espace de noms d'\u00E9l\u00E9ment/de type/de fonction par d\u00E9faut
err\:XQST0067=Plusieurs d\u00E9clarations de construction par d\u00E9faut
err\:XQST0068=Plusieurs d\u00E9clarations boundary-space
err\:XQST0069=Le prologue de requ\u00EAte ne peut pas contenir plusieurs d\u00E9clarations de classement vides.
err\:XQST0070=D\u00E9claration d'espace de noms non valide.
err\:XQST0071="{0}" : attribut de d\u00E9claration d''espace de noms en double
err\:XQST0075=Fonctionnalit\u00E9 de validation non prise en charge
err\:XQST0076="{0}" : classement inconnu
err\:XQST0077="{0}" : valeur pragma inconnue
err\:XQST0078="{0}" : option inconnue
err\:XQST0079=Extension non valide. {0}
err\:XPST0080=Le type de cible d'une expression CAST ou CASTABLE est xs:NOTATION ou xs:anyAtomicType
err\:XPST0081=Impossible de r\u00E9soudre le pr\u00E9fixe "{0}" utilis\u00E9 dans le nom qualifi\u00E9 "{1}"
err\:XQST0085=D\u00E9claration d''espace de noms vide pour le pr\u00E9fixe : "{0}"
err\:XQST0087=L''encodage "{0}" de la d\u00E9claration de version n''est pas valide
err\:XQST0088=Espace de noms cible vide interdit dans une d\u00E9claration ou un import de module
err\:XQST0089=La variable "{0}" li\u00E9e pour la clause poss\u00E8de le m\u00EAme QName d\u00E9velopp\u00E9 que la variable de position associ\u00E9e
err\:XQST0090=La valeur "{0}" n''est pas une r\u00E9f\u00E9rence de caract\u00E8re valide dans XML 1.0
err\:XQST0093=Imports de module circulaires. La d\u00E9claration de l''\u00E9l\u00E9ment "{0}" comporte une expression d''initialisation qui d\u00E9pend directement ou indirectement de l''\u00E9l\u00E9ment "{0}" : ({1})

########## Oracle-specific static exceptions #####################################

ora-err\:XPST0003a=Balise de fin XML non concordante : "{1}" ne correspond pas \u00E0 "{0}"
ora-err\:XPST0003b=Utilisation interdite de l''expression "{0}". {1}
ora-err\:XPST0003c=Erreur de syntaxe. L''\u00E9l\u00E9ment "{0}" est inattendu
ora-err\:XPST0003d=Erreur de syntaxe
ora-err\:XPST0005a=Le test de noeud "{0}" ne concorde avec aucun noeud de sa s\u00E9quence d''entr\u00E9e de type : {1}
ora-err\:XPST0008a=Variable "${0}" utilis\u00E9e mais pas d\u00E9clar\u00E9e
ora-err\:XPST0017a="{0}" : fonction externe non li\u00E9e. {1}
ora-err\:XQST0059a=Sch\u00E9ma XML {0} introuvable. {1}
ora-err\:XQST0059b=Module de biblioth\u00E8que {0} introuvable. {1}
ora-err\:XQST0059c=Sch\u00E9ma XML {0} non valide. {1}
ora-err\:XQST0059d=Module de biblioth\u00E8que {0} non valide. {1}
ora-err\:EXT0001="{0}" n''est pas une valeur pragma reconnue
ora-err\:EXT0002=La valeur pragma "{0}" ne peut \u00EAtre utilis\u00E9e que pour un constructeur de noeud d''\u00E9l\u00E9ment ou d''attribut
ora-err\:FUNC002=Utilisation interdite de la proc\u00E9dure d''effet de bord {0} avec le nombre d''arguments {1}. Il est impossible d''appeler les proc\u00E9dures d''effet de bord \u00E0 partir d''un contexte d\u00E9pourvu d''effets de bord
ora-err\:FUNC003=Appel de fonction trouv\u00E9, r\u00E9sultats en cours de suppression
ora-err\:VAR002="${0}" : variable non initialis\u00E9e

########## Oracle-specific system exceptions #####################################

ora-err\:TBDSYSTEM=TBD SYSTEM: {0}
ora-err\:SYS001=Cette fonctionnalit\u00E9 n''est pas impl\u00E9ment\u00E9e. {0}
ora-err\:SYS002=Exception de biblioth\u00E8que d\u00E9tect\u00E9e : 
ora-err\:SYS003=Exception inattendue
ora-err\:SYS004=Interruption d'ex\u00E9cution
ora-err\:SYS005=Requ\u00EAte interrompue \u00E0 la demande de l'utilisateur
ora-err\:SYS006=La fonction {0} est r\u00E9cursive ; ce cas n''est pas pris en charge.
ora-err\:SYS007=Configuration de contexte non valide
ora-err\:SYS008=URI de contexte en double {0}
ora-err\:SYS009=Tentative de liaison de la fonction externe {0} avec le nombre d''arguments {1}, mais cette fonction est introuvable
ora-err\:SYS010=Requ\u00EAte interrompue \u00E0 la demande de l'administrateur
ora-err\:SYS011=Requ\u00EAte interrompue en raison d'une expiration sp\u00E9cifi\u00E9e par l'utilisateur
ora-err\:SYS012=Requ\u00EAte interrompue en raison de l'expiration de la transaction
ora-err\:SYS013=Transaction (xid={0}) annul\u00E9e (rollback).
ora-err\:SYS014=R\u00E9f\u00E9rence d'entit\u00E9 non d\u00E9velopp\u00E9e dans le DOM
ora-err\:SYS015=Entr\u00E9e interdite : les noeuds DOM doivent reconna\u00EEtre les espaces de noms. Si vous utilisez un analyseur DOM, v\u00E9rifiez que la propri\u00E9t\u00E9 de reconnaissance des espaces de noms est d\u00E9finie sur True (voir javax.xml.parsers.DocumentBuilderFactory#setNamespaceAware(boolean)). Si vous construisez un DOM \u00E0 l'aide des m\u00E9thodes de cr\u00E9ation, veillez \u00E0 utiliser les versions de ces m\u00E9thodes qui reconnaissent les espaces de noms (par exemple, org.w3c.dom.Document#createElementNS(String, String)) 
ora-err\:SYS016=Les noeuds DOM doivent \u00EAtre comparables. L''\u00E9l\u00E9ment org.w3c.dom.Node.compareDocumentPosition(.) a renvoy\u00E9 "{0}" pour les noeuds "{1}" et "{2}" 
ora-err\:SYS017=PageManagerPool SDOM lazy n'est pas d\u00E9fini
ora-err\:SYS018=Le changement de nom d'un noeud d'instruction de traitement DOM n'est pas pris en charge
ora-err\:SYS019=Les impl\u00E9mentations DOM pour lesquelles org.w3c.dom.Document.renameNode(...) cr\u00E9e un noeud ne sont pas prises en charge par les expressions de changement de nom XQuery Update
ora-err\:SYS020=La d\u00E9claration d''option {0} := "{1}" n''est pas valide
ora-err\:SYS021=Une erreur est survenue lors de l''\u00E9valuation de la requ\u00EAte dynamique : {0}
ora-err\:SYS022=Type de support non pris en charge ou non valide : {0}
ora-err\:SYS023=Profil de langue non valide : {0}
ora-err\:SYS024=Donn\u00E9es non valides renvoy\u00E9es par l''impl\u00E9mentation SPI effectu\u00E9e par le d\u00E9veloppeur. {0}
ora-err\:SYS025=La liaison DOM indiqu\u00E9e n'est pas valide. Les noeuds DOM d'entit\u00E9, de notation, de r\u00E9f\u00E9rence d'entit\u00E9 et de type de document ne peuvent pas \u00EAtre mod\u00E9lis\u00E9s en tant que XDM
ora-err\:SYS026=La liaison DOM indiqu\u00E9e n'est pas valide. Les noeuds de texte vide et les noeuds CDATASection ne peuvent \u00EAtre li\u00E9s que s'ils n'ont aucun parent
ora-err\:SYS027=La liaison DOM indiqu\u00E9e n'est pas valide. Impossible de lier un noeud de texte s'il a un fr\u00E8re adjacent qui est \u00E9galement un noeud de texte
ora-err\:SYS028=La liaison DOM indiqu\u00E9e n'est pas valide. L'impl\u00E9mentation doit prendre en charge le DOM de niveau 3 (principal et XML)
ora-err\:SYS029=La d\u00E9claration d''option "{0}" n''est pas reconnue
ora-err\:SYS030=Pour la d\u00E9claration d''option {0}, la valeur "{1}" n''est pas prise en charge
ora-err\:SYS031=Pour les liaisons de fonctions Java, vous devez indiquer un nom de classe \u00E0 l''aide de l''option {0}
ora-err\:SYS032=Nom de classe indiqu\u00E9 introuvable : {0}
ora-err\:SYS033=Impossible d''instancier la classe indiqu\u00E9e : {0}
ora-err\:SYS034=Erreur lors de l''initialisation des arguments pour l''appel de fonction {0}
ora-err\:SYS035=Erreur lors de la tentative d''appel de la m\u00E9thode statique d\u00E9finie par l''utilisateur {0} : {1}
ora-err\:SYS036=Erreur lors du traitement du r\u00E9sultat d''une m\u00E9thode statique d\u00E9finie par l''utilisateur {0} : {1}
ora-err\:SYS037=La fonction r\u00E9solue {0} d\u00E9finie par l''utilisateur doit \u00E9tendre {1}
ora-err\:SYS038=Erreur lors de la tentative de r\u00E9solution de la fonction {0}. {1}
ora-err\:SYS039=Pour la fonction {0}, le r\u00E9solveur d''entit\u00E9 a renvoy\u00E9 un type de liaison de fonction non pris en charge : "{1}"
ora-err\:SYS040=Cette requ\u00EAte a \u00E9t\u00E9 pr\u00E9par\u00E9e \u00E0 des fins d'analyse statique uniquement et ne peut pas \u00EAtre ex\u00E9cut\u00E9e
ora-err\:SYS041=La fonction fn:put n'est pas activ\u00E9e
ora-err\:SYS042=Impossible de trouver une m\u00E9thode Java correspondant \u00E0 la signature de fonction XQuery indiqu\u00E9e (non-concordance des noms, des param\u00E8tres ou des types renvoy\u00E9s)
ora-err\:SYS043=La m\u00E9thode "{0}" de classe "{1}" indiqu\u00E9e est introuvable
ora-err\:SYS044=Type de support non valide : {0}
ora-err\:SYS045=L''entit\u00E9 du document n''est pas valide : {0}
ora-err\:SYS046=Erreur du d\u00E9bogueur : {0}
ora-err\:SYS047=Impossible d'ex\u00E9cuter l'op\u00E9ration car l'instance est ferm\u00E9e
ora-err\:SYS048=Impossible d'appeler directement un module de biblioth\u00E8que dans ce contexte. Un module principal avec un corps de requ\u00EAte est obligatoire
ora-err\:SYS049=Non-concordance du mode de traitement entre une requ\u00EAte et un module de biblioth\u00E8que ou entre deux modules de biblioth\u00E8que.
ora-err\:SYS050=Acc\u00E8s refus\u00E9. Les mises \u00E0 jour ne sont pas activ\u00E9es
ora-err\:SYS051=Les mises \u00E0 jour ne sont pas prises en charge pour ce type de source de donn\u00E9es
ora-err\:SYS052=Les liaisons SAX doivent prendre en charge la fonctionnalit\u00E9 d'espace de noms
ora-err\:SYS053=Il n'est pas possible de mettre \u00E0 jour simultan\u00E9ment deux sources de donn\u00E9es qui font r\u00E9f\u00E9rence aux m\u00EAme donn\u00E9es physiques sous-jacentes. Cela se produit parfois si une m\u00EAme instance de DOM est li\u00E9e plusieurs fois \u00E0 la requ\u00EAte
ora-err\:SYS054=La partie cha\u00EEne de la requ\u00EAte de l''URI de classement n''est pas valide : {0}
ora-err\:SYS055=Le collator indiqu\u00E9 ne prend pas en charge les op\u00E9rations de sous-cha\u00EEne
ora-err\:SYS056=URI relatif inattendu : {0}
ora-err\:SYS057=Les URI de document renvoy\u00E9s pour la collecte doivent \u00EAtre uniques : {0}
ora-err\:SYS058=La configuration de la conversion d'ensemble d'informations n'est pas prise en charge. La conservation des espaces superflus lors de la suppression des espaces pertinents n'est actuellement pas prise en charge.
ora-err\:SYS059=La liaison DOM indiqu\u00E9e n'est pas valide. Les noeuds DocumentFragment doivent contenir exactement un \u00E9l\u00E9ment enfant
ora-err\:SYS060=L'instance XQStaticContext obtenue \u00E0 partir d'une expression de requ\u00EAte ne peut pas \u00EAtre utilis\u00E9e pour pr\u00E9parer d'autres expressions
ora-err\:XDBC001=Echec XDBC : {0}

########## Standard type exceptions ###########################################

err\:XPTY0004=Type non valide : {0}
err\:FOTY0012=fonction fn:data() appliqu\u00E9e au type complexe avec contenu complexe non mixte {0}
err\:XPTY0018=La derni\u00E8re \u00E9tape de l'expression de chemin ne peut pas contenir \u00E0 la fois des noeuds et des valeurs atomiques
err\:XPTY0019=L'\u00E9tape de l'expression de chemin ne peut pas \u00EAtre un type atomique
err\:XPTY0020=L'\u00E9l\u00E9ment de contexte de l'expression d'axe n'est pas un noeud
err\:XQTY0023=Le constructeur d'\u00E9l\u00E9ment ne peut pas contenir un noeud de document
err\:XQTY0024=Dans le constructeur d'\u00E9l\u00E9ment, les noeuds d'attribut doivent figurer avant les autres
err\:XQTY0030=L'argument de l'expression de validation doit \u00EAtre un document ou un \u00E9l\u00E9ment
err\:XQST0036=Le type "{0}" du module import\u00E9 "{1}" est introuvable dans les d\u00E9finitions de sch\u00E9ma du p\u00E9rim\u00E8tre
err\:XQTY0086=Une valeur d\u00E9pendante de l''espace de noms et interdite en mode ''no-preserve'' a \u00E9t\u00E9 trouv\u00E9e : {0}

########## Standard serialization exceptions ###########################################
err\:SENR0001=Entr\u00E9e non valide dans le serializer : impossible de s\u00E9rialiser directement les attributs et les espaces de noms
err\:SESU0007="{0}" n''est pas un encodage pris en charge dans cette Java Virtual Machine (JVM)
err\:SESU0011=La forme de normalisation "{0}" n''est pas prise en charge
err\:SERE0008=L''encodage {0} indiqu\u00E9 ne peut pas coder le texte "{1}"
err\:SEPM0004=C'est une erreur d'indiquer le param\u00E8tre doctype-system, ou d'indiquer le param\u00E8tre autonome avec une valeur autre que OMIT, si l'instance du mod\u00E8le de donn\u00E9es contient des noeuds de texte ou des noeuds \u00E0 plusieurs \u00E9l\u00E9ments en tant qu'enfants du noeud racine
err\:SEPM0009=Si la valeur de "omit-xml-declaration" est YES (ou True), "standalone" doit avoir la valeur OMIT
err\:SEPM0016a=La valeur de param\u00E8tre "{0}" n''est pas prise en charge
err\:SEPM0016b=La valeur de param\u00E8tre "{0}" n''est pas prise en charge. Valeurs valides : {1}
err\:SEPM0016c=Le param\u00E8tre "{0}" n''est pas pris en charge
err\:SEPM0016d=La m\u00E9thode {0} indiqu\u00E9e produit une sortie binaire impossible \u00E0 \u00E9crire sous forme de caract\u00E8res
err\:SEPM0016e=La valeur de la propri\u00E9t\u00E9 doctype-system ne peut pas contenir \u00E0 la fois une apostrophe et un point d'interrogation

########## Standard XQUF exceptions ###########################################
err\:XUST0001=Utilisation interdite de l'expression de mise \u00E0 jour (ou s\u00E9quentielle)
err\:XUST0002=Une expression de mise \u00E0 jour est obligatoire
err\:XUST0003=Le prologue ne peut pas contenir plusieurs d\u00E9clarations de revalidation
err\:XUTY0004=La s\u00E9quence d'insertion de l'expression d'insertion contient un noeud d'attribut \u00E0 la suite d'un noeud qui n'est pas un noeud d'attribut
err\:XUTY0005=Dans une expression d'insertion dans laquelle "dans", comme "le premier dans" ou "le dernier dans" est indiqu\u00E9, l'expression cible ne peut pas renvoyer un r\u00E9sultat non vide ne comprenant pas noeud de document ou d'\u00E9l\u00E9ment unique.
err\:XUTY0006=Dans une expression d'insertion dans laquelle "avant" ou "apr\u00E8s" est indiqu\u00E9, l'expression cible ne peut pas renvoyer un r\u00E9sultat non vide ne comprenant pas un \u00E9l\u00E9ment, un texte, un commentaire ou un noeud d'instruction de traitement unique
err\:XUTY0007=L'expression cible d'une expression de suppression doit renvoyer une s\u00E9quence contenant plusieurs noeuds (ou aucun)
err\:XUTY0008=Dans une expression de remplacement, l'expression cible doit renvoyer un r\u00E9sultat non vide comprenant un \u00E9l\u00E9ment, un attribut, un texte, un commentaire ou un noeud d'instruction de traitement unique
err\:XUDY0009=Dans une expression de remplacement dans laquelle "valeur de" n'est pas indiqu\u00E9, le noeud renvoy\u00E9 par l'expression cible doit avoir un parent
err\:XUTY0010=Dans une expression de remplacement dans laquelle "valeur de" n'est pas indiqu\u00E9 et o\u00F9 la cible est un noeud d'\u00E9l\u00E9ment, de texte, de commentaire ou d'instruction de traitement, la s\u00E9quence de remplacement doit contenir plusieurs noeuds d'\u00E9l\u00E9ment, de texte, de commentaire ou d'instruction de traitement (ou aucun).
err\:XUTY0011=Dans une expression de remplacement dans laquelle "valeur de" n'est pas indiqu\u00E9 et o\u00F9 la cible est un noeud d'attribut, la s\u00E9quence de remplacement doit comprendre plusieurs noeuds d'attribut (ou aucun)
err\:XUTY0012=Dans une expression de changement de nom, l'expression cible doit renvoyer un \u00E9l\u00E9ment, un attribut ou un noeud d'instruction de traitement unique
err\:XUTY0013=Dans une expression de transformation, il s'agit d'une erreur de type si une expression source de la clause de copie ne renvoie pas de noeud unique
err\:XUDY0014=Dans une expression de transformation, il s'agit d'une erreur dynamique si la clause de modification modifie tout noeud non cr\u00E9\u00E9 par la clause de copie
err\:XUDY0015=Un noeud est la cible de plusieurs expressions de changement de nom dans la m\u00EAme requ\u00EAte
err\:XUDY0016=Un noeud est la cible de plusieurs expressions de remplacement ("valeur de" n'\u00E9tant pas indiqu\u00E9) dans la m\u00EAme requ\u00EAte
err\:XUDY0017=Un noeud est la cible de plusieurs expressions "valeur de" de remplacement dans la m\u00EAme requ\u00EAte
err\:XUDY0018=Une fonction d\u00E9clar\u00E9e comme externe, mais pas de mise \u00E0 jour, renvoie une liste non vide de mises \u00E0 jour en attente
err\:XUDY0019=Une fonction d\u00E9clar\u00E9e comme \u00E0 la fois externe et de mise \u00E0 jour renvoie une instance de mod\u00E8le de donn\u00E9es non vide
err\:XUDY0021=Les mises \u00E0 jour g\u00E9n\u00E8reraient un \u00E9l\u00E9ment, {0}, dont plusieurs attributs seraient nomm\u00E9s {1}
err\:XUTY0022=Une expression d'insertion sp\u00E9cifie l'insertion d'un noeud d'attribut dans un noeud de document
err\:XUDY0023=Une expression d''insertion, de remplacement ou de changement de nom introduit le pr\u00E9fixe "{0}" li\u00E9 \u00E0 l''URI "{1}", qui est en conflit avec une liaison existante \u00E0 "{2}"
err\:XUDY0024=Un ensemble d''expressions de mise \u00E0 jour introduit une liaison d''espace de noms en conflit pour le pr\u00E9fixe "{0}" et les URI "{1}" et "{2}"
err\:XUST0026=Une d\u00E9claration de revalidation dans le prologue indique un mode de revalidation non pris en charge
err\:XUDY0027=L'expression cible d'une expression d'insertion, de remplacement ou de changement de nom renvoie une s\u00E9quence vide
err\:XUST0028=Une fonction de mise \u00E0 jour ne peut pas indiquer un type de valeur renvoy\u00E9e
err\:XUDY0029=Dans une expression d'insertion dans laquelle "avant" ou "apr\u00E8s" est indiqu\u00E9, le noeud renvoy\u00E9 par l'expression cible doit avoir un parent
err\:XUDY0030=Une expression d'insertion ne peut pas sp\u00E9cifier l'insertion d'un noeud d'attribut avant ou apr\u00E8s l'enfant d'un noeud de document
err\:XUDY0031=Plusieurs appels \u00E0 fn:put dans le m\u00EAme clich\u00E9 ne peuvent pas indiquer le m\u00EAme URI (apr\u00E8s r\u00E9solution des URI relatifs)
err\:FOUP0001=Le premier op\u00E9rande de fn:put n'est pas un type de noeud pris en charge
err\:FOUP0002=Le deuxi\u00E8me op\u00E9rande de fn:put ({0}) n''est pas valide en tant que xs:anyURI 

########## Standard XQSX exceptions ###########################################
err\:SXST0002=Une expression ne peut pas contenir \u00E0 la fois des op\u00E9randes de mise \u00E0 jour et des op\u00E9randes s\u00E9quentiels
err\:SXDY0003=Erreur dynamique si, apr\u00E8s l''application des mises \u00E0 jour, la valeur li\u00E9e \u00E0 toute variable du p\u00E9rim\u00E8tre ne correspond pas au type statique de cette variable selon les r\u00E8gles de concordance des types de s\u00E9quence. Type non valide : {0}. Attendu : {1}
err\:SXST0005=Erreur statique si plusieurs variables d\u00E9clar\u00E9es dans la m\u00EAme expression de bloc ont le m\u00EAme QName d\u00E9velopp\u00E9 : {0}
err\:SXTY0006=Variable non initialis\u00E9e : {0}  
err\:SXST0007=Variable non affectable : {0}
err\:SXST0008=Cat\u00E9gorie interdite d''expression de corps de fonction : {0}. Valeur attendue : {1}
err\:SXST0009=Valeur non valide pour l''option ''xqsx:query-mode'' : {0}. Valeur attendue : ''sequential'' ou ''simple''

########## Oracle-specific type exceptions #######################################

ora-err\:TBDTYPE=TBD TYPE: {0}
ora-err\:TYPE001="{0}" : type introuvable
ora-err\:TYPE002="{0}" : conversion en {1} impossible pour l''affectation \u00E0 {2}
ora-err\:TYPE003=Non-concordance de type d'ex\u00E9cution
ora-err\:TYPE003a=Non-concordance de type d'ex\u00E9cution : valeur xdt:untypedAtomic obtenue
ora-err\:XPTY0004a=Impossible d''appliquer l''op\u00E9rateur {0} \u00E0 des arguments de type {1} et {2}
ora-err\:XPTY0004b=Non-concordance de types d\u00E9tect\u00E9e dans l''expression. Seule la s\u00E9quence vide est conforme aux r\u00E8gles de v\u00E9rification de type. Type attendu : {0}. Type r\u00E9el : {1}
ora-err\:XPTY0004d=Impossible d''appliquer l''op\u00E9rateur "{0}" aux valeurs de type {1} et {2}
ora-err\:XPTY0004e=Type statique non valide : {0}
ora-err\:XPTY0004f="{0}" : valeur incorrecte pour le type {1}
ora-err\:XPTY0004g=El\u00E9ments non comparables : les types sont "{0}" et "{1}"
ora-err\:XPTY0004h=Type de noeud inattendu : {0}

########## Oracle-specific update exceptions #####################################

ora-err\:UPD001=Echec de la mise \u00E0 jour : annulation (rollback) : {1}
ora-err\:UPD002=Echec de la mise \u00E0 jour : compensation : {1}
ora-err\:UPD003=Echec de la mise \u00E0 jour : r\u00E9sultat mixte, erreur de mise \u00E0 jour r\u00E9partie (updateid={0}) : {1}
ora-err\:UPD004=Une mise \u00E0 jour en attente suite \u00E0 une panne du syst\u00E8me (updateid={0}) a \u00E9t\u00E9 r\u00E9cup\u00E9r\u00E9e

########## Oracle-specific mutator exceptions ####################################
# Note: ChoiceFormat options should be translated.

ora-err\:MUT001=L''\u00E9l\u00E9ment \u00E0 mettre \u00E0 jour ({0}) doit \u00EAtre de type complexe, mais le type trouv\u00E9 est "{1}"
ora-err\:MUT002=Le type de la valeur transmise en tant qu''argument ({0}) ne correspond pas au type de {1,choice,0#element|1#attribute} "{2}" ({3})
ora-err\:MUT003=El\u00E9ment {0,choice,0#Element|1#Attribute} "{1}" d\u00E9clar\u00E9 comme \u00E9tant de type atomique simple ("{2}"), mais la valeur ins\u00E9r\u00E9e est une liste
ora-err\:MUT004=Impossible de compiler le chemin "{0}" : {1}
ora-err\:MUT005=XPath "{0}" n''a s\u00E9lectionn\u00E9 aucun noeud
ora-err\:MUT006=XPath "{0}" a s\u00E9lectionn\u00E9 plusieurs noeuds
ora-err\:MUT007=Impossible de construire une valeur XPath qui s\u00E9lectionne le noeud parent pour XPath "{0}"
ora-err\:MUT008=Aucun noeud parent pour la s\u00E9lection : {0}
ora-err\:MUT009=Plusieurs noeuds parent pour la s\u00E9lection : {0}
ora-err\:MUT010=Impossible d'ins\u00E9rer une valeur atomique car le point d'insertion est introuvable. Utilisez plut\u00F4t un noeud d'\u00E9l\u00E9ment ou d'attribut
ora-err\:MUT011=L''argument "path" ("{0}") doit pointer vers un \u00E9l\u00E9ment au contenu complexe pour que l''insertion soit possible
ora-err\:MUT012=Aucun \u00E9l\u00E9ment {0,choice,0#element|1#attribute}" portant le nom "{1}" n''a \u00E9t\u00E9 trouv\u00E9 dans le type "{2}" ni d\u00E9clar\u00E9 globalement
ora-err\:MUT013=L''\u00E9l\u00E9ment "{0}" est d\u00E9clar\u00E9 comme \u00E9tant un type simple ("{1}"), mais l''\u00E9l\u00E9ment ins\u00E9r\u00E9 n''a pas de contenu simple
ora-err\:MUT014=L''\u00E9l\u00E9ment {0,choice,0#Element|1#Attribute} "{1}" existe d\u00E9j\u00E0
ora-err\:MUT015=Echec de la conversion XToken<->SDO : {0}
ora-err\:MUT016=L''\u00E9l\u00E9ment avec la valeur \u00E0 remplacer ("{0}") doit avoir un type simple ou un type complexe avec un contenu simple. Type trouv\u00E9 : {1}
ora-err\:MUT017=Le chemin "{0}" \u00E9tait index\u00E9, mais l''\u00E9l\u00E9ment {1,choice,0#element|1#attribute} ("{2}") correspondant ne peut pas appara\u00EEtre plusieurs fois
ora-err\:MUT018=Une liste a \u00E9t\u00E9 transmise, mais le type de l''\u00E9l\u00E9ment {0,choice,0#element|1#attribute} "{1}" ("{2}") n''est pas un type de liste
ora-err\:MUT019=La valeur XPath utilis\u00E9e comme argument doit \u00EAtre relative : {0}
ora-err\:MUT020=Impossible de convertir la valeur "{0}" en type "{1}" pour l''\u00E9l\u00E9ment {2,choice,0#element|1#attribute} "{3}"

