# Default (English) exception messages.
#
# See XQuery*Exception.java for Java-language codes corresponding to these
# QNames.

########## Standard dynamic exceptions ########################################

err\:XPDY0002="{0}": Valoare context dinamic nedefinit\u0103
err\:XQDY0025="{0}": Atribut duplicat
err\:XQDY0026=Instruc\u0163iunea de procesare nu poate con\u0163ine "?>"
err\:XQDY0027=Validare e\u015Fuat\u0103: {0}
err\:XQST0040="{0}": Atribut duplicat
err\:XQDY0041=Nu se poate efectua cast la NCName: {0}
err\:XQDY0044=Nume de atribut ilegal
err\:XPDY0050=Tipul dinamic nu corespunde tipului specificat de expresia de tratare: {0}
err\:XQDY0061=Con\u0163inut ilegal al nodului de documente
err\:XQDY0062=Restric\u0163ia nodului de documente nu a fost respectat\u0103
err\:XQDY0064=Numele instruc\u0163iunii de procesare calculate nu poate fi "XML"
err\:XQDY0072=Comentariul calculat nu poate s\u0103 con\u0163in\u0103 "--" sau s\u0103 se \u00EEncheie cu "-"
err\:XQDY0074=Nu se poate extinde QName: {0}
err\:XQDY0084=Nu a putut fi g\u0103sit elementul "{0}" utiliz\u00E2nd declara\u0163iile de tipuri de elemente din domeniu
err\:XQDY0096=Numele dat constructorului de element calculat nu este valid
err\:FOAR0001=\u00CEmp\u0103r\u0163ire la zero
err\:FOAR0002="{0}": over/underflow numeric
err\:FOCA0001="{0}": Nu se poate face cast la zecimale
err\:FOCA0002="{0}": Valoare lexical\u0103 gre\u015Fit\u0103
err\:FOCA0004="{0}": nu se poate efectua cast pe nr. \u00EEntreg
err\:FOCA0005=NaN dat pt. o valoare float sau dubl\u0103
err\:FOCH0001=Codepoint gre\u015Fit: {0}
err\:FOCH0002="{0}": asamblare neacceptat\u0103
err\:FOCH0003="{0}": formular de normalizare neacceptat
err\:FOCH0004="{0}": Asamblarea nu este acceptat\u0103 pentru aceast\u0103 func\u0163ie
err\:FODC0001=Niciun document de context
err\:FODC0002=Eroare la preluarea resursei "{0}": {1}
err\:FODC0004="{0}": Argument nevalid pentru fn:collection()
err\:FODC0005="{0}": Argument nevalid pentru fn:doc()
err\:FODT0001=Overflow \u00EEn aritmetica pt. dat\u0103/or\u0103
err\:FODT0002=Overflow/underflow \u00EEn opera\u0163ia de durat\u0103
err\:FODT0003="{0}": Fus orar nevalid
err\:FOER0000=Eroare neidentificat\u0103
err\:FONS0003="{0}": Prefixul nu este definit \u00EEn context static
err\:FONS0004="{0}": Nu a fost g\u0103sit spa\u0163iul de nume pt. acest prefix
err\:FONS0005=URI-ul de baz\u0103 nu a fost definit
err\:FORG0001="{0}": Valoare nevalid\u0103 pt. cast/constructor: {1}
err\:FORG0002="{0}": argument nevalid pt. fn:resolve-uri()
err\:FORG0003=Se a\u015Fteptau zero elemente sau unul singur, dar s-au primit dou\u0103 sau mai multe
err\:FORG0004=Se a\u015Ftepta un element sau mai multe, s-au primit zero
err\:FORG0005=Se a\u015Ftepta exact un element, s-au primit {0} elemente
err\:FORG0006="{0}": Tip de argument nevalid
err\:FORG0008=Ambele argumente pt. fn:dateTime au un fus orar specificat: "{0}" \u015Fi "{1}"
err\:FORG0009=fn:resolve-uri() a fost apelat\u0103 cu un URI de baz\u0103 care nu este absolut: "{0}"
err\:FORX0001=Marcaje nevalide pt. expresii logice
err\:FORX0002="{0}": expresie logic\u0103 nevalid\u0103
err\:FORX0003=Expresia logic\u0103 corespunde unui \u015Fir de lungime zero: "{0}"
err\:FORX0004="{0}": \u015Fir de \u00EEnlocuire nevalid
err\:FOTY0011=Elementul de context nu este un nod

########## Oracle-specific dynamic exceptions ####################################

ora-err\:TBDDYNAMIC=TBD DYNAMIC: {0}
ora-err\:XPDY0002a=Este necesar un element de context, dar nu a fost definit niciunul (sau lipse\u015Fte un caracter '$' din fa\u0163a unui nume de variabil\u0103)
ora-err\:XPDY0002b="{0}": Variabil\u0103 extern\u0103 ne-legat\u0103
ora-err\:XPDY0002c="{0}": URI document nevalid
ora-err\:XQDY0027a=Atributul "{0}" nu a fost g\u0103sit pt. validare
ora-err\:XQDY0027b=Elementul "{0}" nu a fost g\u0103sit pt. validare
ora-err\:ENT001=URI-ul "{0}" nu a putut fi rezolvat: Schem\u0103 necunoscut\u0103
ora-err\:FODC0002a=Eroare la interpretarea XML de intrare: "{0}" {1}
ora-err\:FODC0002b=Eroare la interpretarea XML-ului de intrare: Un cursor StAX poate fi utilizat doar o singur\u0103 dat\u0103
ora-err\:FODC0002c=Colec\u0163ia prestabilit\u0103 nu este definit\u0103
ora-err\:FO0001="{0}": Argument nevalid pt. func\u0163ia {1}
ora-err\:FO0002="{0}": nu este \u00EEn formatul a\u015Fteptat - {1}
ora-err\:NS0001="{0}": Prefixul este deja legat la {1}
ora-err\:FOUD0001=Procedura {0} a fost invocat\u0103 cu o intrare incomplet\u0103"
ora-err\:MEM0001=Cererea necesit\u0103 {0} operatori administra\u0163i din memorie, dar sunt disponibili doar {1}

########## Standard static exceptions #########################################

err\:FONC0001=element de context nedefinit
err\:XPST0001="{0}": Valoarea contextului static nu este definit\u0103
err\:XPST0003=Expresie nevalid\u0103: {0}
err\:XPST0005=Nu se poate asigna un tip gol
err\:XPST0008=Numele "{0}" nu a fost g\u0103sit \u00EEn contextul static
err\:XPST0051="{0}": Tipul este nedefinit sau nu este atomic
err\:XQST0009=Caracteristica de import al schemei nu este acceptat\u0103
err\:XPST0010=Caracteristica de ax\u0103 complet\u0103 nu este acceptat\u0103
err\:XQST0012=Schem\u0103 nevalid\u0103: {0}. {1}
err\:XQST0013=Con\u0163inutul directivei pragma este nevalid. {0}
err\:XQST0014=Con\u0163inutul extensiei este nevalid. {0}
err\:XQST0016=Caracteristica pt. modul nu este acceptat\u0103
err\:XPST0017="{0}": Func\u0163ie necunoscut\u0103 (sau este gre\u015Fit num\u0103rul de argumente: ({1})) {2}
err\:XQST0022=Atributul declara\u0163iei pt. spa\u0163iul de nume trebuie s\u0103 fie un \u015Fir literal
err\:XQST0031="{0}": Versiunea nu este acceptat\u0103
err\:XQST0032="{0}": Declara\u0163ie duplicat a URI-ului de baz\u0103
err\:XQST0033="{0}": Declara\u0163ie duplicat a prefixului spa\u0163iului de nume
err\:XQST0034="{0}": Func\u0163ia a fost deja declarat\u0103 sau importat\u0103
err\:XQST0035="{0}": Numele a fost importat \u00EEnainte
err\:XQST0038="{0}": Asambl\u0103ri necunoscute sau multiple
err\:XQST0039="{0}": Numele parametrului func\u0163iei este duplicat
err\:XQST0045=Func\u0163ia "{0}" este declarat\u0103 \u00EEn spa\u0163iul de nume rezervat: "{1}"
err\:XQST0046="{0}": URI ilegal
err\:XQST0047="{0}": Spa\u0163iu de nume destina\u0163ie duplicat
err\:XQST0048="{0}": Numele trebuie s\u0103 fie \u00EEn spa\u0163iul de nume destina\u0163ie pt. modul: "{1}"
err\:XQST0049="{0}": Nume de variabil\u0103 duplicat
err\:XQST0054=Declara\u0163ia pt. "{0}" are o expresie de ini\u0163ializare care depinde direct sau indirect de "{0}": ({1})
err\:XQST0055=S-au g\u0103sit mai multe declara\u0163ii de spa\u0163ii de nume pt. copiere
err\:XQST0056="{0}": Spa\u0163iul de nume destina\u0163ie utilizat de modulul de import
err\:XQST0057=Un import de schem\u0103 nu poate lega un prefix dac\u0103 spa\u0163iul de nume este gol
err\:XQST0058="{0}": Spa\u0163iu de nume destina\u0163ie duplicat
err\:XQST0059=Nu s-a putut g\u0103si schema sau modulul
err\:XQST0060="{0}": Numele func\u0163iei nu poate avea un spa\u0163iu de nume gol
err\:XQST0065=S-au g\u0103sit mai multe declara\u0163ii de ordonare prestabilite
err\:XQST0066=S-au g\u0103sit mai multe declara\u0163ii de elemente, tipuri, sau spa\u0163ii de nume pt. func\u0163ii prestabilite
err\:XQST0067=S-au g\u0103sit mai multe declara\u0163ii pt. construc\u0163ii prestabilite
err\:XQST0068=S-au g\u0103sit mai multe declara\u0163ii pt. spa\u0163ii limit\u0103
err\:XQST0069=Prologul interog\u0103rii nu poate con\u0163ine dec\u00E2t o singur\u0103 declara\u0163ie de ordine goal\u0103.
err\:XQST0070=Declara\u0163ie de spa\u0163iu de nume nevalid\u0103.
err\:XQST0071="{0}": Atribut duplicat pt. declara\u0163ia spa\u0163iului de nume
err\:XQST0075=Caracteristica de validare nu este acceptat\u0103
err\:XQST0076="{0}": Asamblare necunoscut\u0103
err\:XQST0077="{0}": Directiv\u0103 pragma necunoscut\u0103
err\:XQST0078="{0}": Op\u0163iune necunoscut\u0103
err\:XQST0079=Extensie nevalid\u0103. {0}
err\:XPST0080=Tipul destina\u0163ie al unui cast sau al unei expresii castable este xs:NOTATION sau xs:anyAtomicType
err\:XPST0081=Prefixul "{0}" utilizat \u00EEn numele calificat "{1}" nu poate fi rezolvat
err\:XQST0085=Declara\u0163ia spa\u0163iului de nume pt. prefixul: "{0}" este goal\u0103
err\:XQST0087=Codificarea "{0}" din declara\u0163ia versiunii nu este valid\u0103
err\:XQST0088=Spa\u0163iu de nume destina\u0163ie gol ilegal \u00EEn importul sau declara\u0163ia modulului
err\:XQST0089=Variabila "{0}" legat\u0103 pt. clauz\u0103 are acela\u015Fi QName extins ca variabila sa pozi\u0163ional\u0103 asociat\u0103
err\:XQST0090=Valoarea "{0}" nu este o referin\u0163\u0103 de caracter valid\u0103 \u00EEn XML 1.0
err\:XQST0093=Importuri de modul circulare. Declara\u0163ia pt. "{0}" are o expresie de ini\u0163ializare care depinde direct sau indirect de "{0}": ({1})

########## Oracle-specific static exceptions #####################################

ora-err\:XPST0003a=Tag de \u00EEncheiere XML desperecheat: "{1}" nu corespunde cu "{0}"
ora-err\:XPST0003b=Utilizare ilegal\u0103 a expresiei "{0}". {1}
ora-err\:XPST0003c=Eroare de sintax\u0103. "{0}" nu era a\u015Fteptat
ora-err\:XPST0003d=Eroare de sintax\u0103
ora-err\:XPST0005a=Nodul de test "{0}" nu corespunde niciunui nod din secven\u0163a de intrare de tip: {1}
ora-err\:XPST0008a=Variabila "${0}" este utilizat\u0103 dar nu a fost declarat\u0103
ora-err\:XPST0017a="{0}": func\u0163ie extern\u0103 ne-legat\u0103. {1}
ora-err\:XQST0059a=Schema XML {0} nu a putut fi g\u0103sit\u0103. {1}
ora-err\:XQST0059b=Modulul de bibliotec\u0103 nu a fost g\u0103sit: {0}. {1}
ora-err\:XQST0059c=Schem\u0103 XML nevalid\u0103: {0}. {1}
ora-err\:XQST0059d=Modul de bibliotec\u0103 nevalid: {0}. {1}
ora-err\:EXT0001="{0}" nu este o directiv\u0103 pragma recunoscut\u0103
ora-err\:EXT0002=Directiva pragma "{0}" poate fi utilizat\u0103 doar \u00EEn jurul unui element sau constructor de nod de atribut
ora-err\:FUNC002=Utilizare ilegal\u0103 a procedurii pt. efecte colaterale, {0}, cu arity {1}. Procedurile pt. efecte colaterale nu pot fi invocate dintr-un context f\u0103r\u0103 efecte colaterale.
ora-err\:FUNC003=S-a g\u0103sit un apel de func\u0163ie, ale c\u0103rui rezultate sunt abandonate
ora-err\:VAR002="${0}": Variabil\u0103 ini\u0163ializat\u0103

########## Oracle-specific system exceptions #####################################

ora-err\:TBDSYSTEM=TBD SYSTEM: {0}
ora-err\:SYS001=Aceast\u0103 func\u0163ionalitate nu poate fi implementat\u0103. {0}
ora-err\:SYS002=S-a detectat o excep\u0163ie a bibliotecii:
ora-err\:SYS003=Excep\u0163ie nea\u015Fteptat\u0103
ora-err\:SYS004=\u00CEntrerupere la runtime
ora-err\:SYS005=Interogare oprit\u0103 la cererea utilizatorului
ora-err\:SYS006=Func\u0163ia {0} este recursiv\u0103, dar acest lucru nu este permis
ora-err\:SYS007=Configura\u0163ie de context nevalid\u0103.
ora-err\:SYS008=URI de context duplicat: {0}
ora-err\:SYS009=Se \u00EEncearc\u0103 legarea func\u0163iei externe {0} cu arity {1}, dar nu s-a putut g\u0103si func\u0163ia
ora-err\:SYS010=Interogare oprit\u0103 la cererea administratorului
ora-err\:SYS011=Interogare oprit\u0103 din cauza expir\u0103rii specificate de utilizator
ora-err\:SYS012=Interogare oprit\u0103 din cauza expir\u0103rii tranzac\u0163iei
ora-err\:SYS013=Tranzac\u0163ia (xid={0}) a fost derulat\u0103 \u00EEnapoi.
ora-err\:SYS014=Referin\u0163\u0103 de entitate ne-extins\u0103 \u00EEn DOM
ora-err\:SYS015=Intrare ilegal\u0103: Nodurile DOM trebuie s\u0103 \u0163in\u0103 cont de spa\u0163iile de nume. Dac\u0103 utiliza\u0163i un interpretor DOM, asigura\u0163i-v\u0103 c\u0103 proprietatea care \u0163ine cont de spa\u0163iul de nume este setat\u0103 la "true" (consulta\u0163i javax.xml.parsers.DocumentBuilderFactory#setNamespaceAware(boolean)). Dac\u0103 construi\u0163i DOM cu metodele de creare, asigura\u0163i-v\u0103 c\u0103 sunt utilizate versiuni de metode care \u0163in cont de spa\u0163iul de nume (de exemplu org.w3c.dom.Document#createElementNS(String, String))
ora-err\:SYS016=Nodurile DOM trebuie s\u0103 fie comparabile. org.w3c.dom.Node.compareDocumentPosition(.) a returnat "{0}" pt. nodurile "{1}" \u015Fi "{2}" 
ora-err\:SYS017=Nu a fost setat "Lazy SDOM PageManagerPool"
ora-err\:SYS018=Nu este permis\u0103 redenumirea unui nod de instruc\u0163iune de procesare DOM
ora-err\:SYS019=Implement\u0103rile DOM \u00EEn care org.w3c.dom.Document.renameNode(...) creeaz\u0103 un nou nod nu sunt acceptate pt. expresiile de redenumire XQuery Update.
ora-err\:SYS020=Declara\u0163ia op\u0163iunii este nevalid\u0103: {0} := "{1}"
ora-err\:SYS021=A survenit o eroare la evaluarea interog\u0103rii dinamice: {0}
ora-err\:SYS022=Tip suport media neacceptat sau nevalid: {0}
ora-err\:SYS023=Profil de limb\u0103 nevalid: {0}
ora-err\:SYS024=Au fost returnate date nevalide din implementarea SPI de la dezvoltator. {0}
ora-err\:SYS025=Leg\u0103tura DOM specificat\u0103 nu este valid\u0103. Nodurile DOM de tip entitate, nota\u0163ie, EntityReference, \u015Fi DocumentType nu pot fi modelate ca XDM
ora-err\:SYS026=Leg\u0103tura DOM specificat\u0103 nu este valid\u0103. Nodurile text \u015Fi CDATASection goale nu pot fi g\u0103site dec\u00E2t dac\u0103 nu au niciun p\u0103rinte
ora-err\:SYS027=Leg\u0103tura DOM specificat\u0103 nu este valid\u0103. Un nod text nu poate fi legat dac\u0103 are un frate adiacent care este de asemenea de tip text
ora-err\:SYS028=Leg\u0103tura DOM specificat\u0103 nu este valid\u0103. Implementarea trebuie s\u0103 accepte DOM de nivelul 3 (Core \u015Fi XML)
ora-err\:SYS029=Declara\u0163ia "{0}" a op\u0163iunii nu este recunoscut\u0103
ora-err\:SYS030=Pentru declara\u0163ia de op\u0163iune {0}, valoarea "{1}" nu este acceptat\u0103
ora-err\:SYS031=Pentru leg\u0103turile de func\u0163ii Java, trebuie specificat un nume de clas\u0103 utiliz\u00E2ndu-se op\u0163iunea {0}
ora-err\:SYS032=Nu s-a putut g\u0103si numele clasei specificate: {0}
ora-err\:SYS033=Clasa specificat\u0103 nu a putut fi instan\u0163iat\u0103: {0}
ora-err\:SYS034=A survenit o eroare la ini\u0163ializarea argumentelor pt. apelarea func\u0163iei {0}
ora-err\:SYS035=A survenit o eroare la \u00EEncercarea de a invoca metoda static\u0103 definit\u0103 de utilizator: {0} : {1}
ora-err\:SYS036=A survenit o eroare la procesarea rezultatului unei metode statice definite de utilizator: {0} : {1}
ora-err\:SYS037=Func\u0163ia rezolvat\u0103 {0} (definit\u0103 de utilizator) trebuie s\u0103 extind\u0103 {1}
ora-err\:SYS038=A survenit o eroare la \u00EEncercarea de a rezolva func\u0163ia {0}. {1}
ora-err\:SYS039=Pentru func\u0163ia {0}, rezolvitorul de entitate a returnat un tip de leg\u0103tur\u0103 de func\u0163ie neacceptat: "{1}"
ora-err\:SYS040=Aceast\u0103 interogare a fost preg\u0103tit\u0103 doar pt. analiza static\u0103 \u015Fi nu poate fi executat\u0103
ora-err\:SYS041=Func\u0163ia fn:put nu este activat\u0103
ora-err\:SYS042=Nu a putut fi g\u0103sit\u0103 metoda Java care s\u0103 corespund\u0103 semn\u0103turii func\u0163iei XQuery (nepotrivire \u00EEntre nume, parametri sau tipurile returnate)
ora-err\:SYS043=Nu s-a putut g\u0103si metoda "{0}" specificat\u0103 pt. clasa "{1}"
ora-err\:SYS044=Tip de suport media nevalid: {0}
ora-err\:SYS045=Entitate document nevalid\u0103: {0}
ora-err\:SYS046=Eroare depanator: {0}
ora-err\:SYS047=Opera\u0163ia nu poate fi efectuat\u0103, deoarece instan\u0163a este \u00EEnchis\u0103
ora-err\:SYS048=Un modul de bibliotec\u0103 nu poate fi invocat direct \u00EEn acest context. Este obligatoriu un modul principal cu un corp de interogare
ora-err\:SYS049=Nepotrivire de mod de procesare \u00EEntre o interogare \u015Fi un modul de bibliotec\u0103 sau \u00EEntre dou\u0103 module de bibliotec\u0103
ora-err\:SYS050=Acces refuzat. Actualiz\u0103rile nu sunt activate
ora-err\:SYS051=Acest tip de surs\u0103 de date nu permite actualiz\u0103ri
ora-err\:SYS052=Leg\u0103turile SAX trebuie s\u0103 accepte caracteristica pt. spa\u0163ii de nume
ora-err\:SYS053=Nu se pot actualiza concurent cele dou\u0103 surse de date ce fac referin\u0163\u0103 la acelea\u015Fi date fizice de baz\u0103. De exemplu, acest lucru se poate \u00EEnt\u00E2mpla dac\u0103 aceea\u015Fi instan\u0163\u0103 DOM este legat\u0103 la interogare de mai multe ori
ora-err\:SYS054=Partea care reprezint\u0103 un \u015Fir de interogare, din URI-ul de asamblare, nu este valid\u0103: {0}
ora-err\:SYS055=Asamblorul specificat nu accept\u0103 opera\u0163ii de sub\u015Firuri
ora-err\:SYS056=URI relativ nea\u015Fteptat: {0}
ora-err\:SYS057=URI-urile de documente returnate pt. colec\u0163ie trebuie s\u0103 fie unice: {0}
ora-err\:SYS058=Configura\u0163ie de conversie infoset neacceptat\u0103. Nu este permis\u0103 p\u0103strarea unui spa\u0163iu gol nesemnificativ \u015Fi \u015Ftergerea unuia semnificativ.
ora-err\:SYS059=Leg\u0103tura DOM specificat\u0103 nu este valid\u0103. Nodurile DocumentFragment trebuie s\u0103 aib\u0103 exact un element fiu
ora-err\:SYS060=O instan\u0163\u0103 XQStaticContext ob\u0163inut\u0103 dintr-o expresie a unei interog\u0103ri nu poate fi utilizat\u0103 pt. preg\u0103tirea altor expresii
ora-err\:XDBC001=E\u015Fec XDBC: {0}

########## Standard type exceptions ###########################################

err\:XPTY0004=Tip nevalid: {0}
err\:FOTY0012=fn:data() a fost aplicat\u0103 unui tip complex cu con\u0163inut complex non-mixt: {0}
err\:XPTY0018=Ultimul pas din expresia de cale nu poate con\u0163ine \u015Fi valori de noduri, \u015Fi valori atomice
err\:XPTY0019=Pasul din expresia de cale nu poate fi de tip atomic
err\:XPTY0020=Elementul de context din expresia axei nu este un nod
err\:XQTY0023=Constructorul elementului nu poate con\u0163ine un nod de document
err\:XQTY0024=Constructorul elementului trebuie s\u0103 aib\u0103 nodurile de atribut \u00EEnaintea celorlalte
err\:XQTY0030=Argumentul expresiei de validare trebuie s\u0103 fie un document sau un element
err\:XQST0036=Tipul "{0}" din modulul importat "{1}" nu a fost g\u0103sit \u00EEn defini\u0163iile de scheme din domeniu
err\:XQTY0086=S-a g\u0103sit o valoare sensibil\u0103 la spa\u0163ii de nume, care este ilegal\u0103 \u00EEn modul ''no-preserve'': {0}

########## Standard serialization exceptions ###########################################
err\:SENR0001=Intrare nevalid\u0103 pt. serializor: Atributele \u015Fi spa\u0163iile de nume nu pot fi serializate direct
err\:SESU0007="{0}" nu este o codificare acceptat\u0103 \u00EEn acest JVM
err\:SESU0011=Formularul de normalizare "{0}" nu este acceptat
err\:SERE0008=Codificarea specificat\u0103, {0}, nu poate codifica textul "{1}"
err\:SEPM0004=Este eronat\u0103 specificarea parametrului doctype-system sau a unui parametru individual cu o alt\u0103 valoare dec\u00E2t OMIT, dac\u0103 instan\u0163a modelului de date con\u0163ine noduri text sau mai multe noduri de element ca fii ai nodului root
err\:SEPM0009=Dac\u0103 "omit-xml-declaration" are valoarea "Da" (sau Adev\u0103rat), atunci "standalone" trebuie s\u0103 aib\u0103 valoarea OMIT
err\:SEPM0016a=Valoarea "{0}" nu este acceptat\u0103 pt. parametru
err\:SEPM0016b=Valoarea "{0}" nu este acceptat\u0103 pt. parametru. Valorile valide sunt: {1}
err\:SEPM0016c=Parametrul "{0}" nu este acceptat
err\:SEPM0016d=Metoda specificat\u0103, {0}, genereaz\u0103 un rezultat binar, care nu poate fi scris drept caractere
err\:SEPM0016e=Valoarea propriet\u0103\u0163ii doctype-system nu poate con\u0163ine \u015Fi un apostrof, \u015Fi o ghilimea

########## Standard XQUF exceptions ###########################################
err\:XUST0001=Utilizare ilegal\u0103 a expresiei de actualizare sau secven\u0163iale
err\:XUST0002=Este obligatorie o expresie de actualizare
err\:XUST0003=Prologul nu poate con\u0163ine mai mult de o declara\u0163ie de re-validare
err\:XUTY0004=Secven\u0163a de inserare a expresiei de inserare con\u0163ine un nod de atribut dup\u0103 un nod care nu este de atribut.
err\:XUTY0005=\u00CEntr-o expresie de inserare \u00EEn care a fost specificat termenul 'into', ini\u0163ial sau final, expresia destina\u0163ie nu poate returna un rezultat care nu este gol \u015Fi care nu const\u0103 dintr-un nod de document sau element unic.
err\:XUTY0006=\u00CEntr-o expresie de inserare \u00EEn care s-a specificat termenul 'before' sau 'after', expresia destina\u0163ie nu poate returna un rezultat care nu este gol \u015Fi care nu const\u0103 dintr-un singur element, text, comentariu sau nod de instruc\u0163iune de procesare care are un p\u0103rinte.
err\:XUTY0007=Expresia destina\u0163ie a unei expresii de \u015Ftergere trebuie s\u0103 returneze o secven\u0163\u0103 de zero sau mai multe noduri
err\:XUTY0008=\u00CEntr-o expresie de \u00EEnlocuire, expresia destina\u0163ie trebuie s\u0103 returneze un rezultat care nu este gol \u015Fi care s\u0103 aib\u0103 un singur element, atribut, text, comentariu sau nod de instruc\u0163iune de procesare.
err\:XUDY0009=\u00CEntr-o expresie de \u00EEnlocuire \u00EEn care nu a fost specificat termenul 'value of', nodul returnat de expresia destina\u0163ie trebuie s\u0103 aib\u0103 un p\u0103rinte.
err\:XUTY0010=\u00CEntr-o expresie de \u00EEnlocuire \u00EEn care nu s-a specificat 'value of' \u015Fi destina\u0163ia este un element, un text, un comentariu sau un nod de instruc\u0163iune de procesare, secven\u0163a de \u00EEnlocuire trebuie s\u0103 fie format\u0103 din zero sau mai multe elemente, texte, comentarii sau noduri de instruc\u0163iune de procesare.
err\:XUTY0011=\u00CEntr-o expresie de \u00EEnlocuire \u00EEn care nu s-a specificat 'value of' \u015Fi destina\u0163ia este un nod de atribut, secven\u0163a de \u00EEnlocuire trebuie s\u0103 aib\u0103 zero sau mai multe noduri de atribut.
err\:XUTY0012=\u00CEntr-o expresie de redenumire, destina\u0163ia trebuie s\u0103 returneze un singur element, atribut sau nod de instruc\u0163iune de procesare.
err\:XUTY0013=\u00CEntr-o expresie de transformare, constituie o eroare de tip faptul c\u0103 o expresie surs\u0103 din clauza de copiere nu returneaz\u0103 un singur nod.
err\:XUDY0014=\u00CEntr-o expresie de transformare, constituie o eroare dinamic\u0103 faptul c\u0103 clauza de modificare modific\u0103 un nod care nu a fost creat de clauza de copiere.
err\:XUDY0015=Un nod este destina\u0163ia mai multor expresii de denumire din aceea\u015Fi interogare
err\:XUDY0016=Un nod este destina\u0163ia mai multor expresii de \u00EEnlocuire (care nu specific\u0103 'value of') din cadrul aceleia\u015Fi interog\u0103ri.
err\:XUDY0017=Un nod este destina\u0163ia mai multor expresii de \u00EEnlocuire pentru 'value of' din cadrul aceleia\u015Fi interog\u0103ri.
err\:XUDY0018=O func\u0163ie declarat\u0103 ca extern\u0103, dar f\u0103r\u0103 actualizare, returneaz\u0103 o list\u0103 de actualiz\u0103ri \u00EEn a\u015Fteptare care nu este goal\u0103.
err\:XUDY0019=O func\u0163ie care a fost declarat\u0103 at\u00E2t extern\u0103 c\u00E2t \u015Fi de actualizare returneaz\u0103 o instan\u0163\u0103 de model de date care nu este goal\u0103.
err\:XUDY0021=Actualiz\u0103rile ar avea ca rezultat un element, {0}, cu mai multe atribute denumite {1}
err\:XUTY0022=O expresie de inserare specific\u0103 inserarea unui nod de atribut \u00EEntr-un nod de document
err\:XUDY0023=O expresie de inserare, \u00EEnlocuire sau redenumire introduce prefixul "{0}" legat la URI-ul "{1}", ceea ce intr\u0103 \u00EEn conflict cu o leg\u0103tur\u0103 deja existent\u0103, la "{2}"
err\:XUDY0024=Un set de expresii de actualizare introduce o leg\u0103tur\u0103 de spa\u0163iu de nume ce intr\u0103 \u00EEn conflict, pt. prefixul "{0}" \u015Fi URI-urile "{1}" \u015Fi "{2}"
err\:XUST0026=O declara\u0163ie de re-validare din Prolog specific\u0103 un mod de re-validare care nu este acceptat
err\:XUDY0027=Expresia destina\u0163ie a unei expresii de inserare, \u00EEnlocuire sau redenumire este evaluat\u0103 la o secven\u0163\u0103 goal\u0103.
err\:XUST0028=O func\u0163ie de actualizare nu poate specifica un tip de returnare
err\:XUDY0029=\u00CEntr-o expresie de inserare \u00EEn care se specific\u0103 "before" sau "after", nodul returnat de expresia destina\u0163ie trebuie s\u0103 aib\u0103 un p\u0103rinte
err\:XUDY0030=O expresie de inserare nu poate specifica inserarea unui nod de atribut \u00EEnainte sau dup\u0103 un fiu al unui nod de document.
err\:XUDY0031=Nu este permis ca mai multe apeluri ale func\u0163iei fn:put din acela\u015Fi instantaneu s\u0103 specifice acela\u015Fi URI (dup\u0103 rezolvarea URI-urilor relative)
err\:FOUP0001=Primul operand al fn:put nu este un tip de nod acceptat
err\:FOUP0002=Cel de-al doilea operand al fn:put ({0}) nu este valid drept xs:anyURI 

########## Standard XQSX exceptions ###########################################
err\:SXST0002=Nu pot fi combina\u0163i operanzii de actualizare \u015Fi secven\u0163iali \u00EEntr-o expresie
err\:SXDY0003=Este o eroare dinamic\u0103 dac\u0103, dup\u0103 aplicarea actualiz\u0103rilor, valoarea legat\u0103 la orice variabil\u0103 din domeniu nu corespunde tipului static al acelei variabile conform regulilor de coresponden\u0163\u0103 SequenceType. Tip nevalid: {0}. Se a\u015Ftepta: {1}
err\:SXST0005=Dac\u0103 dou\u0103 sau mai multe variabile declarate \u00EEn aceea\u015Fi expresie de bloc au acela\u015Fi QName expandat ({0}), apare o eroare static\u0103.
err\:SXTY0006=Variabil\u0103 neini\u0163ializat\u0103: {0}
err\:SXST0007=Variabil\u0103 neasignabil\u0103: {0}
err\:SXST0008=Categorie ilegal\u0103 a unei expresii din corpul func\u0163iei: {0}. Se a\u015Ftepta: {1}
err\:SXST0009=Valoare nevalid\u0103 pt. op\u0163iunea de mod ''xqsx:query-mode'': {0}. Se a\u015Ftepta: ''sequential'' sau ''simple''

########## Oracle-specific type exceptions #######################################

ora-err\:TBDTYPE=TBD TYPE: {0}
ora-err\:TYPE001="{0}": Tipul nu a fost g\u0103sit
ora-err\:TYPE002="{0}": nu se poate efectua cast la {1} pt. asignare la {2}
ora-err\:TYPE003=Nepotrivire de tip la runtime
ora-err\:TYPE003a=Nepotrivire a tipului runtime: S-a primit o valoare xdt:untypedAtomic
ora-err\:XPTY0004a=Operatorul "{0}" nu poate fi utilizat pt. argumente de tip {1} \u015Fi {2}
ora-err\:XPTY0004b=S-a g\u0103sit o nepotrivire de tipuri \u00EEn expresie. Doar o secven\u0163\u0103 goal\u0103 respect\u0103 regulile de verificare a tipului. S-a g\u0103sit tipul: {0}. Tipul efectiv: {1}
ora-err\:XPTY0004d=Nu se poate aplica operatorul "{0}" pe valori de tip {1} \u015Fi {2}
ora-err\:XPTY0004e=Tip static nevalid: {0}
ora-err\:XPTY0004f="{0}": valoare gre\u015Fit\u0103 pt. tipul {1}
ora-err\:XPTY0004g=Elementele nu sunt comparabile: Tipurile sunt "{0}" \u015Fi "{1}"
ora-err\:XPTY0004h=Tip de nod nea\u015Fteptat: {0}

########## Oracle-specific update exceptions #####################################

ora-err\:UPD001=E\u015Fec de actualizare: S-a derulat \u00EEnapoi: {1}
ora-err\:UPD002=E\u015Fec de actualizare: S-a compensat: {1}
ora-err\:UPD003=E\u015Fec de actualizare: Rezultat mixt, s-a trimis o eroare de actualizare (updateid={0}): {1}
ora-err\:UPD004=S-a recuperat actualizarea \u00EEn a\u015Fteptare dup\u0103 o c\u0103dere de sistem (updateid={0})

########## Oracle-specific mutator exceptions ####################################
# Note: ChoiceFormat options should be translated.

ora-err\:MUT001=Elementul de actualizat, ({0}), trebuie s\u0103 aib\u0103 un tip complex, dar tipul care s-a g\u0103sit este "{1}"
ora-err\:MUT002=Tipul de valoare transmis ca argument, ({0}), nu corespunde cu tipul {1,choice,0#element|1#attribute} "{2}" ({3})
ora-err\:MUT003={0,choice,0#Element|1#Attribute} "{1}" este declarat ca av\u00E2nd un tip atomic simplu, ("{2}"), dar valoarea inserat\u0103 este o list\u0103
ora-err\:MUT004=Nu s-a putut compila calea "{0}": {1}
ora-err\:MUT005=XPath "{0}" nu a selectat niciun nod
ora-err\:MUT006=XPath "{0}" a selectat mai multe noduri
ora-err\:MUT007=Nu s-a putut construi un XPath care s\u0103 selecteze nodul p\u0103rinte pt. XPath "{0}"
ora-err\:MUT008=Nu s-au g\u0103sit noduri p\u0103rinte pt. selec\u0163ie: {0}
ora-err\:MUT009=S-au g\u0103sit mai multe noduri p\u0103rinte pt. selec\u0163ie: {0}
ora-err\:MUT010=Nu se poate insera o valoare atomic\u0103, deoarece punctul de inser\u0163ie nu a putut fi determinat; utiliza\u0163i un element sau un nod de atribut
ora-err\:MUT011=Argumentul "path" ("{0}") trebuie s\u0103 duc\u0103 la un element cu un con\u0163inut complex pt. ca inser\u0163ia s\u0103 fie posibil\u0103
ora-err\:MUT012=Nu s-a g\u0103sit {0,choice,0#element|1#attribute}" cu numele "{1}" \u00EEn tipul "{2}" sau declarat global
ora-err\:MUT013=Elementul "{0}" este declarat ca fiind de tip simplu ("{1}"), dar elementul inserat nu are un con\u0163inut simplu
ora-err\:MUT014={0,choice,0#Element|1#Attribute} "{1}" exist\u0103 deja
ora-err\:MUT015=Conversia XToken<->SDO a e\u015Fuat: {0}
ora-err\:MUT016=Elementul a c\u0103rui valoare trebuie \u00EEnlocuit\u0103 ("{0}") trebuie s\u0103 aib\u0103 un tip simplu sau un tip complex cu con\u0163inut simplu. Tipul g\u0103sit este: {1}
ora-err\:MUT017=Calea "{0}" a fost indexat\u0103, dar {1,choice,0#element|1#attribute} ("{2}") corespondent nu poate ap\u0103rea de mai multe ori
ora-err\:MUT018=A fost transmis\u0103 o list\u0103, dar tipul {0,choice,0#element|1#attribute} "{1}" ("{2}") nu este un tip de list\u0103
ora-err\:MUT019=XPath utilizat ca argument trebuie s\u0103 fie relativ: {0}
ora-err\:MUT020=Nu s-a putut converti valoarea "{0}" la tipul "{1}" pt. {2,choice,0#element|1#attribute} "{3}"

