/
/ $Header: wptg/xdk/src/java/xquery/resources/oracle/xml/xquery/exceptions/XQJExceptionMessages_no.properties /generic/6 2014/04/25 08:49:20 gmolloy Exp $
/
/ XQMessages.txt
/
/ Copyright (c) Oracle Corporation 2000. All Rights Reserved.
/
/   NAME
/     XQMessages.properties
/
/   DESCRIPTION
/     <short description of component this file declares/defines>
/
/   NOTES
/     <other useful comments, qualifications, etc.>
/
/   MODIFIED   (MM/DD/YY)
/   morgiyan   04/28/11 - Fix a bug with context item not being allowed to be
/                         rebound in immediate mode
/   jspiegel   03/21/11 - Add debugger error message
/   morgiyan   03/17/11 - Add error for closing resources
/   morgiyan   02/20/11 - Add a missing error message re sequence being past
/                         the end
/   jspiegel   02/15/11 - Fix error message about not supporting any data
/                         source properties
/   morgiyan   01/21/11 - Add a new error message for XmlObjects getter
/   morgiyan   10/01/10 - Creation
/

#---------
# XQJ Errors (XQJ-0601 to XQJ-0900)
XQJ-0600 = XQSequence-metoden kan ikke kalles p\u00E5 ikke-blabare sekvenser
XQJ-0601 = metoden kan ikke kalles siden sekvensen er lukket
XQJ-0602 = en forekomst av oracle.xml.parser.v2.XMLNode er n\u00F8dvendig
XQJ-0603 = metoden kan ikke kalles siden mellomlagret sekvens er lukket
XQJ-0604 = en forekomst av OXQItem er n\u00F8dvendig
XQJ-0605 = en forekomst av OXQItemType er n\u00F8dvendig
XQJ-0606 = typen som er sendt inn, samsvarer ikke med den forventede typen
XQJ-0611 = mark\u00F8ren er ikke p\u00E5 elementet
XQJ-0612 = XQSequence: Gjeldende element er ikke av n\u00F8dvendig type
XQJ-0613 = XQSequence: Elementet kan bare hentes \u00E9n gang fra en ikke-blabar sekvens
XQJ-0614 = XQSequence: Elementet er ikke en node
XQJ-0615 = XQItem: Elementet er ikke av n\u00F8dvendig type
XQJ-0616 = XQItem: Elementet er ikke en node
XQJ-0617 = metoden kan ikke kalles siden tilkoblingen er lukket
XQJ-0618 = XQPreparedExpression: Uttrykket er lukket
XQJ-0619 = getStaticVariableType i XQPreparedExpression: ingen ekstern variabel med angitt navn i den statiske konteksten
XQJ-0620 = setQueryLanguageAndVersion i XQConnection: {0} st\u00F8ttes ikke
XQJ-0621 = setUpdatability i XQConnection: {0} st\u00F8ttes ikke
XQJ-0622 = bindItem i OXQExpression kan bare ta \u00E9n forekomst av oracle.xquery.xqj.OXQItem
XQJ-0623 = bindItem i OXQPreparedExpression kan bare ta \u00E9n forekomst av oracle.xquery.xqj.OXQItem
XQJ-0624 = interoperabilitetsproblem: OXQExpression kan bare ta \u00E9n forekomst av oracle.xquery.xqj.OXQItem
XQJ-0625 = bindContextItem i OXQPreparedExpression kan bare ta \u00E9n forekomst av oracle.xquery.xqj.OXQItem
XQJ-0626 = metoden kan ikke kalles siden klargjort uttrykk er lukket
XQJ-0627 = metoden kan ikke kalles siden elementet er lukket
XQJ-0628 = en forekomst av oracle.xquery.xqj.OXQSequenceType er n\u00F8dvendig
XQJ-0629 = den angitte typen st\u00F8ttes ikke for inndataverdien
XQJ-0630 = en forekomst av oracle.xquery.xqj.OXQItem er n\u00F8dvendig
XQJ-0631 = en forekomst av oracle.xquery.xqj.OXQItemType er n\u00F8dvendig
XQJ-0632 = standard fellesbehandler st\u00F8tter bare de grunnleggende typene 
XQJ-0633 = fellesbehandler er ikke angitt
XQJ-0634 = metoden kan ikke kalles siden uttrykket er lukket
XQJ-0635 = returverdien ligger ikke i omr\u00E5det til en Java byte-type
XQJ-0636 = returverdien ligger ikke i omr\u00E5det til en Java short-type
XQJ-0637 = returverdien ligger ikke i omr\u00E5det til en Java int-type
XQJ-0638 = returverdien ligger ikke i omr\u00E5det til en Java long-type
XQJ-0639 = returverdien ligger ikke i omr\u00E5det til en Java BigInteger-type
XQJ-0640 = typen kontekstelement samsvarer ikke med den statiske kontekstelementtypen
XQJ-0641 = kan ikke sende nullparametre til funksjon
XQJ-0642 = bindSequence kan bare godta en forekomst av oracle.xquery.xqj.OXQSequence
XQJ-0643 = navn p\u00E5 ekstern variabel kan ikke v\u00E6re null i bindingsmetode
XQJ-0644 = metode kan bare kalles med en atomisk type, ikke en nodetype
XQJ-0645 = konverteringen av verdien til en XDM-forekomst mislyktes
XQJ-0646 = interoperabilitetsproblem: elementet er ikke interoperabelt
XQJ-0647 = interoperabilitetsproblem: statisk kontekstelementtype er ikke interoperabel
XQJ-0648 = brukerdefinert type kan ikke brukes til \u00E5 binde eller opprette et dokument i denne implementeringen. Denne implementeringen st\u00F8tter bare innebygde XQuery-typer.
XQJ-0649 = typen som er angitt for \u00E5 binde eller opprette et dokument, er ikke en type dokumentelement eller dokumentskjemaelement.
XQJ-0650 = verdien som ble angitt for binding eller opprettelse, er null
XQJ-0651 = den angitte sp\u00F8rringen er null
XQJ-0652 = kan ikke opprette eller binde element, ettersom det bestemte kildeobjektet ikke st\u00F8ttes. Bare SAXSource, StreamSource og DOMSource st\u00F8ttes.
XQJ-0653 = \u00E9n av de angitte parametrene er null
XQJ-0654 = den angitte parameteren er null
XQJ-0655 = den angitte os-parameteren er null
XQJ-0656 = den angitte ow-parameteren er null
XQJ-0657 = den angitte basistypen st\u00F8ttes ikke
XQJ-0658 = det angitte typenavnet refererer til en forh\u00E5ndsdefinert type, men er forskjellig fra basistypen
XQJ-0659 = OXQConnection: Lagring st\u00F8ttes ikke
XQJ-0660 = OXQConnection: Metode ikke implementert
XQJ-0661 = denne implementeringen m\u00E5 ha et statisk kontekstobjekt fra Oracle
XQJ-0662 = OXQConnection: Tilbakestilling st\u00F8ttes ikke
XQJ-0663 = kan ikke fastsette varighetstypen
XQJ-0664 = kan ikke fastsette typen gregoriansk XML-kalender
XQJ-0665 = det angitte objektet st\u00F8ttes ikke
XQJ-0666 = elementtypeargumentet er null
XQJ-0667 = XMLReader-feil under analyse
XQJ-0668 = kan ikke trekke ut knutepunkt fra DOMSource, konvertering til XDM mislyktes
XQJ-0669 = kan ikke trekke ut inndatakilde eller XML-leser fra SAXSource, konvertering til XDM mislyktes
XQJ-0670 = kan ikke trekke ut inndatastr\u00F8m eller leser fra StreamSource, konvertering til XDM mislyktes
XQJ-0671 = feil i createAttributeType() for OXQDataFactory - baseType st\u00F8ttes ikke
XQJ-0672 = feil i createAttributeType() for OXQDataFactory - hvis schemaURI er angitt, m\u00E5 typenavnet ogs\u00E5 angis
XQJ-0673 = feil i createSchemaAttributeType() for OXQDataFactory - baseType st\u00F8ttes ikke
XQJ-0674 = Feil i createSchemaAttributeType() for OXQDataFactory - nodename kan ikke v\u00E6re null
XQJ-0675 = funksjonen godtar en nullbuffer som f\u00F8rste argument
XQJ-0676 = kan ikke hente f\u00F8rste element i sekvensen
XQJ-0677 = attributtknutepunkt st\u00F8ttes ikke i serialisering
XQJ-0678 = den innsendte parameteren er ikke en gyldig XQItemType
XQJ-0679 = prefikset er ukjent
XQJ-0680 = feil i createDocumentElementType() for OXQDataFactory - elementType kan ikke v\u00E6re null
XQJ-0681 = feil i createDocumentElementType() for OXQDataFactory - elementtypen for elementType er ikke gyldig
XQJ-0682 = feil i createDocumentSchemaElementType() for OXQDataFactory - elementType kan ikke v\u00E6re null
XQJ-0683 = feil i createDocumentSchemaElementType() for OXQDataFactory - elementtypen for elementType er ikke gyldig
XQJ-0684 = feil i createElementType() for OXQDataFactory - hvis schemaURI er angitt, m\u00E5 typenavnet ogs\u00E5 angis
XQJ-0685 = feil i createSchemaElementType() for OXQDataFactory - nodename kan ikke v\u00E6re null
XQJ-0686 = feil i createSequenceType() for OXQDataFactory - elementet er null, og forekomsten er ikke XQSequenceType.OCC_EMPTY
XQJ-0687 = feil i createSequenceType() for OXQDataFactory - elementet er ikke null, og forekomsten er XQSequenceType.OCC_EMPTY
XQJ-0688 = feil i createSequenceType() for OXQDataFactory - den angitte forekomsten er ikke gyldig
XQJ-0689 = feil i createNdTyp() for OXQDataFactory - baseType st\u00F8ttes ikke
XQJ-0690 = XQDataSource: getConnection(conn) st\u00F8ttes ikke
XQJ-0691 = egenskapsnavnet gjenkjennes ikke
XQJ-0692 = verdier for den angitte egenskapen er ugyldig. Denne implementeringen st\u00F8tter ingen egenskaper
XQJ-0693 = OXQExpression: executeCommand st\u00F8ttes ikke
XQJ-0694 = kan ikke identifisere sp\u00F8rringsobjektet
XQJ-0695 = oracle.xml.parser.v2.XMLParseException
XQJ-0696 = org.xml.sax.SAXException
XQJ-0697 = kan ikke opprette DatatypeFactory eller Duration
XQJ-0698 = kan ikke opprette DatatypeFactory
XQJ-0699 = XQStaticContext: ugyldig prefiks for metoden getNamespaceURI 
XQJ-0700 = typen i getObject() st\u00F8ttes ikke
XQJ-0701 = instanceOf-relasjonen kan ikke fastsettes fordi det gjeldende elementet har en brukerdefinert skjematype. Brukerdefinert skjematype st\u00F8ttes ikke i denne implementeringen.
XQJ-0702 = instanceOf-relasjonen kan ikke fastsettes fordi inndatatypen er en brukerdefinert skjematype. Brukerdefinert skjematype st\u00F8ttes ikke i denne implementeringen.
XQJ-0703 = XQItem: writeItemToSAX-feil
XQJ-0704 = XQItemType.getBaseType(): elementtypen er ikke gyldig
XQJ-0705 = XQItemType.getTypeName(): elementtypen er ikke gyldig
XQJ-0706 = XQItemType.getPIName(): elementtypen er ikke gyldig
XQJ-0707 = XQItemType.getNodeName(): elementtypen er ikke gyldig
XQJ-0708 = kan ikke hente leser eller inndatastr\u00F8m
XQJ-0709 = XQResultSequence: feil i writeSequenceToSAX
XQJ-0710 = XQResultSequence: writeItemToSAX-feil
XQJ-0711 = ugyldig modus angitt i setConstructionMode
XQJ-0712 = ugyldig modus angitt i setOrderingMode
XQJ-0713 = ugyldig rekkef\u00F8lge angitt i setDefaultOrderForEmptySequences
XQJ-0714 = ugyldig modus angitt i setBoundarySpacePolicy
XQJ-0715 = ugyldig modus angitt i setCopyNamespacesModePreserve
XQJ-0716 = ugyldig modus angitt i setCopyNamespacesModeInherit
XQJ-0717 = ugyldig modus angitt i setBindingMode
XQJ-0718 = ugyldig modus angitt i setHoldability
XQJ-0719 = ugyldig langtype i setQueryLanguageTypeAndVersion
XQJ-0720 = ugyldig rullbarhet i setScrollability
XQJ-0721 = sekundparameteren for setQueryTimeout kan ikke v\u00E6re 0
XQJ-0722 = OXQUtils:printResult()
XQJ-0723 = OXQUtils.makeOXQItemType - ukjent type1
XQJ-0724 = OXQUtils.makeOXQItemType - ukjent type2
XQJ-0725 = OXQUtils.makeOXQItemType - ukjent type3
XQJ-0726 = OXQUtils:setContextItem - elementet er ikke OXQItem
XQJ-0727 = ukjent XML-str\u00F8mhendelsestype
XQJ-0728 = problem i OXQUtils.cnvStreamToDOM.
XQJ-0729 = ukjent baseItemType i OXQUtils.normalizeSequence
XQJ-0730 = kan ikke opprette XMLStreamReader
XQJ-0731 = interoperabilitetsproblem: brukerdefinert type er ikke interoperabel
XQJ-0732 = uskrevet inndatadokument er ikke en forekomst av den angitte typen, i henhold til regler for typesamsvar for XQuery-sekvens
XQJ-0733 = inndataknutepunktet er ikke en forekomst av den angitte typen
XQJ-0734 = ukjent basistype
XQJ-0735 = oppdaget XQItemType med type som ikke st\u00F8ttes
XQJ-0736 = en type som ikke st\u00F8ttes, er angitt for String-objektet
XQJ-0737 = kan ikke hente XQueryX-fremstillingen for inndatasp\u00F8rringen
XQJ-0738 = navneparameteren er null
XQJ-0739 = egenskapsverdien er ugyldig
XQJ-0740 = feil under oppretting av en databasetilkobling - ikke alle de n\u00F8dvendige egenskapene er angitt
XQJ-0741 = kan ikke hente XQueryX-fremstillingen for inndatasp\u00F8rringen
XQJ-0742 = bindingsvariabelen {0} er ikke definert
XQJ-0743 = ikke st\u00F8ttet bindingstype
XQJ-0744 = egenskapsnavnet gjenkjennes ikke
XQJ-0745 = det har oppst\u00E5tt en feil ved tilgang til det gjeldende elementet
XQJ-0746 = metoden kan ikke kalles siden sekvensen er plassert etter det siste elementet
XQJ-0747 = det har oppst\u00E5tt en feil ved henting av elementet som et DOM-knutepunkt
XQJ-0748 = det har oppst\u00E5tt en feil ved serialisering av elementet
XQJ-0749 = det har oppst\u00E5tt en feil ved serialisering av sekvensen
XQJ-0750 = variabelen er ikke deklarert som ekstern i sp\u00F8rringen, eller, hvis vi binder kontekstelementet, er ikke dette kontekstelementet brukt i sp\u00F8rringen
XQJ-0751 = ikke alle de eksterne variablene er bundet
XQJ-0752 = det finnes ikke noe ubundet kontekstelement i sp\u00F8rringen
XQJ-0753 = inndatasekvensen har ingen elementer
XQJ-0754 = finner ikke den angitte brukerdefinerte typen
XQJ-0757 = inndataene er ikke godt utformet, eller det finnes en uventet behandlingsbetingelse, og konvertering til XDM mislyktes
XQJ-0759 = det har oppst\u00E5tt en feil ved tilgang til elementtypen
XQJ-0760 = internt motorunntak
XQJ-0761 = ugyldig modus angitt i setAccessorMode
XQJ-0762 = ugyldig modus angitt i setProcessingMode
XQJ-0763 = det har oppst\u00E5tt en feil ved henting av elementet som et XmlObject
XQJ-0764 = input XQPrepareExpression er utf\u00F8rt eller har bundne variabler eller er en kopi av annet XQPreparedExpression. Nytt XQPreparedExpression kan bare opprettes fra XQPreparedExpression som ikke har blitt utf\u00F8rt, ikke har blitt kopiert fra et annet XQPreparedExpression og ikke har bundne variabler.
XQJ-0765 = XQPreparedExpression-objektet m\u00E5 v\u00E6re fra en Oracle XQJ-implementering i det midtre laget
XQJ-0766 = intern motorfeil under opprettelse av et nytt XQPreparedExpression-objekt fra et annet XQPreparedExpression-objekt
XQJ-0767 = createsNewNodes() st\u00F8ttes ikke i dette XQPreparedExpression
XQJ-0768 = isContextItemUnbound() st\u00F8ttes ikke i dette XQPreparedExpression
XQJ-0769 = XQPreparedExpression hadde en ugyldig uttrykkskategori 
XQJ-0770 = getExpressionCategory() st\u00F8ttes ikke i dette XQPreparedExpression
XQJ-0771 = omgj\u00F8ring mellom XQuery og XQueryX mislyktes
XQJ-0772 = Det oppstod et Java I/U-unntak under behandling av inndataene
XQJ-0773 = getStaticResultType() st\u00F8ttes ikke for dette XQPreparedExpression
XQJ-0774 = getStaticVariableType() st\u00F8ttes ikke for dette XQPreparedExpression
XQJ-0775 = kopiering st\u00F8ttes ikke for dette XQPreparedExpression
XQJ-0776 = kall av denne metoden etter at elementet allerede er hentet i en sekvens bare fremover, st\u00F8ttes ikke for \u00F8yeblikket
XQJ-0777 = det oppstod en feil under lukking av ett av objektene som kan lukkes
XQJ-0778 = det angitte objektet som kan lukkes, st\u00F8ttes ikke for dette hovedobjektet
XQJ-0779 = det angitte hovedobjektet kan ikke ha objekter som kan lukkes
XQJ-0780 = ukjent navn
XQJ-0781 = feilleting er ikke aktivert i denne tilkoblingen
XQJ-0782 = bruk av ekstern lagring m\u00E5 v\u00E6re aktivert i XQDataSource f\u00F8r du angir en PageManager
XQJ-0783 = bruk av ekstern lagring er aktivert i XQDataSource, og en PageManager m\u00E5 dermed angis f\u00F8r du utf\u00F8rer sp\u00F8rringen
XQJ-0784 = ugyldig modus angitt i setUpdateMode
XQJ-0785 = det angitte elementet m\u00E5 v\u00E6re et dokumentknutepunkt
XQJ-0786 = oppdateringsmodus kan bare angis n\u00E5r bindingsmodusen er utsatt
XQJ-0787 = ingen tilgang til sekvensen etter en feil
XQJ-0788 = det oppstod en feil under skjemaimport
XQJ-0789 = ugyldig parameterverdi: {0}
XQJ-0790 = en brukerdefinert type med det samme navnet, men en annen skjema-URI (Uniform Resource Identifier) er allerede registrering i tilkoblingen
XQJ-0791 = den angitte basistypen samsvarer ikke med basistypen for den opprettede skjematypen, som er: {0}
XQJ-0792 = finner ikke variabelen {0}
XQJ-0793 = finner ikke importen for navneomr\u00E5det {0}
XQJ-0794 = prefikset {0} er ukjent
XQJ-0795 = XQPreparedExpression m\u00E5 kopieres ved hjelp av XQConnection som opprettet det
XQJ-0796 = metoden kan bare kalles n\u00E5r bindingsmodusen er satt til utsatt
