parser.parse.1=\u0395\u03C3\u03C6\u03B1\u03BB\u03BC\u03AD\u03BD\u03BF\u03C2 \u03C7\u03B1\u03C1\u03B1\u03BA\u03C4\u03AE\u03C1\u03B1\u03C2.
parser.parse.2=\u039C\u03B7 \u03AD\u03B3\u03BA\u03C5\u03C1\u03BF\u03C2 \u03B1\u03C1\u03B9\u03B8\u03BC\u03CC\u03C2 \u03B1\u03BD\u03B1\u03C6\u03BF\u03C1\u03AC\u03C2.
parser.next.1=\u0391\u03C0\u03B1\u03B9\u03C4\u03B5\u03AF\u03C4\u03B1\u03B9 \u03C7\u03B1\u03C1\u03B1\u03BA\u03C4\u03AE\u03C1\u03B1\u03C2 \u03BC\u03B5\u03C4\u03AC \u03C4\u03BF \\.
parser.next.2=\u0394\u03B5\u03BD \u03B1\u03BD\u03B1\u03BC\u03AD\u03BD\u03B5\u03C4\u03B1\u03B9'?'.  '(?:' \u03AE '(?=' \u03AE '(?!' \u03AE '(?<' \u03AE '(?#' \u03AE '(?>'?
parser.next.3=\u0391\u03BD\u03B1\u03BC\u03AD\u03BD\u03B5\u03C4\u03B1\u03B9 '(?<=' \u03AE '(?<!'.
parser.next.4=\u0388\u03BD\u03B1 \u03C3\u03C7\u03CC\u03BB\u03B9\u03BF \u03B4\u03B5\u03BD \u03C0\u03B5\u03C1\u03B9\u03BB\u03B1\u03BC\u03B2\u03AC\u03BD\u03B5\u03B9 \u03C7\u03B1\u03C1\u03B1\u03BA\u03C4\u03AE\u03C1\u03B5\u03C2 \u03C4\u03B5\u03C1\u03BC\u03B1\u03C4\u03B9\u03C3\u03BC\u03BF\u03CD.
parser.factor.1=\u0391\u03BD\u03B1\u03BC\u03AD\u03BD\u03B5\u03C4\u03B1\u03B9 ')'.
parser.factor.2=\u039C\u03B7 \u03B1\u03BD\u03B1\u03BC\u03B5\u03BD\u03CC\u03BC\u03B5\u03BD\u03BF \u03C3\u03CD\u03BC\u03B2\u03BF\u03BB\u03BF \u03C4\u03AD\u03BB\u03BF\u03C5\u03C2 \u03C3\u03C4\u03BF \u03BC\u03BF\u03C4\u03AF\u03B2\u03BF \u03BC\u03B9\u03B1\u03C2 \u03BF\u03BC\u03AC\u03B4\u03B1\u03C2 \u03C0\u03B1\u03C1\u03B1\u03BC\u03AD\u03C4\u03C1\u03C9\u03BD \u03C4\u03C1\u03BF\u03C0\u03BF\u03C0\u03BF\u03AF\u03B7\u03C3\u03B7\u03C2.
parser.factor.3=\u0391\u03BD\u03B1\u03BC\u03AD\u03BD\u03B5\u03C4\u03B1\u03B9 ':'.
parser.factor.4=\u039C\u03B7 \u03B1\u03BD\u03B1\u03BC\u03B5\u03BD\u03CC\u03BC\u03B5\u03BD\u03BF \u03C3\u03CD\u03BC\u03B2\u03BF\u03BB\u03BF \u03C4\u03AD\u03BB\u03BF\u03C5\u03C2 \u03C3\u03C4\u03BF \u03BC\u03BF\u03C4\u03AF\u03B2\u03BF \u03BC\u03B9\u03B1\u03C2 \u03BF\u03BC\u03AC\u03B4\u03B1\u03C2 \u03C5\u03C0\u03CC \u03CC\u03C1\u03BF\u03C5\u03C2.
parser.factor.5=\u03A3\u03B5 \u03AD\u03BD\u03B1 \u03BC\u03BF\u03C4\u03AF\u03B2\u03BF \u03C5\u03C0\u03CC \u03CC\u03C1\u03BF\u03C5\u03C2 \u03B1\u03BD\u03B1\u03BC\u03AD\u03BD\u03B5\u03C4\u03B1\u03B9 \u03C3\u03C4\u03BF\u03B9\u03C7\u03B5\u03AF\u03BF "back reference" \u03AE "anchor" \u03AE "lookahead" \u03AE "lookbehind".
parser.factor.6=\u03A5\u03C0\u03AC\u03C1\u03C7\u03BF\u03C5\u03BD \u03C0\u03B5\u03C1\u03B9\u03C3\u03C3\u03CC\u03C4\u03B5\u03C1\u03B5\u03C2 \u03B1\u03C0\u03CC \u03C4\u03C1\u03B5\u03B9\u03C2 \u03B5\u03C0\u03B9\u03BB\u03BF\u03B3\u03AD\u03C2 \u03C3\u03B5 \u03BC\u03B9\u03B1 \u03BF\u03BC\u03AC\u03B4\u03B1 \u03C5\u03C0\u03CC \u03CC\u03C1\u03BF\u03C5\u03C2.
parser.atom.1=\u0388\u03BD\u03B1\u03C2 \u03C7\u03B1\u03C1\u03B1\u03BA\u03C4\u03AE\u03C1\u03B1\u03C2 \u03B5\u03BD\u03C4\u03CC\u03C2 U+0040-U+005f \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03B1\u03BA\u03BF\u03BB\u03BF\u03C5\u03B8\u03B5\u03AF \u03C4\u03BF \\c.
parser.atom.2=\u0391\u03C0\u03B1\u03B9\u03C4\u03B5\u03AF\u03C4\u03B1\u03B9 '{' \u03C0\u03C1\u03B9\u03BD \u03B1\u03C0\u03CC \u03BC\u03B9\u03B1 \u03BA\u03B1\u03C4\u03B7\u03B3\u03BF\u03C1\u03AF\u03B1 \u03C7\u03B1\u03C1\u03B1\u03BA\u03C4\u03AE\u03C1\u03C9\u03BD.
parser.atom.3=\u0388\u03BD\u03B1 \u03CC\u03BD\u03BF\u03BC\u03B1 \u03B9\u03B4\u03B9\u03CC\u03C4\u03B7\u03C4\u03B1\u03C2 \u03B4\u03B5\u03BD \u03BA\u03BB\u03B5\u03AF\u03BD\u03B5\u03B9 \u03BC\u03B5 '}'.
parser.atom.4=\u039C\u03B7 \u03B1\u03BD\u03B1\u03BC\u03B5\u03BD\u03CC\u03BC\u03B5\u03BD\u03BF\u03C2 \u03BC\u03B5\u03C4\u03B1-\u03C7\u03B1\u03C1\u03B1\u03BA\u03C4\u03AE\u03C1\u03B1\u03C2.
parser.atom.5=\u0386\u03B3\u03BD\u03C9\u03C3\u03C4\u03B7 \u03B9\u03B4\u03B9\u03CC\u03C4\u03B7\u03C4\u03B1.
parser.cc.1=\u039C\u03B9\u03B1 \u03BA\u03BB\u03AC\u03C3\u03B7 \u03C7\u03B1\u03C1\u03B1\u03BA\u03C4\u03AE\u03C1\u03C9\u03BD POSIX \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03BA\u03BB\u03B5\u03AF\u03BD\u03B5\u03B9 \u03BC\u03B5 ':]'.
parser.cc.2=\u039C\u03B7 \u03B1\u03BD\u03B1\u03BC\u03B5\u03BD\u03CC\u03BC\u03B5\u03BD\u03BF \u03C3\u03CD\u03BC\u03B2\u03BF\u03BB\u03BF \u03C4\u03AD\u03BB\u03BF\u03C5\u03C2 \u03C3\u03C4\u03BF \u03BC\u03BF\u03C4\u03AF\u03B2\u03BF \u03BC\u03B9\u03B1\u03C2 \u03BA\u03BB\u03AC\u03C3\u03B7\u03C2 \u03C7\u03B1\u03C1\u03B1\u03BA\u03C4\u03AE\u03C1\u03C9\u03BD.
parser.cc.3=\u0386\u03B3\u03BD\u03C9\u03C3\u03C4\u03BF \u03CC\u03BD\u03BF\u03BC\u03B1 \u03B3\u03B9\u03B1 \u03BC\u03B9\u03B1 \u03BA\u03BB\u03AC\u03C3\u03B7 \u03C7\u03B1\u03C1\u03B1\u03BA\u03C4\u03AE\u03C1\u03C9\u03BD POSIX.
parser.cc.4=\u03A4\u03BF '-' \u03B4\u03B5\u03BD \u03B5\u03AF\u03BD\u03B1\u03B9 \u03AD\u03B3\u03BA\u03C5\u03C1\u03BF \u03B5\u03B4\u03CE.
parser.cc.5=\u0391\u03BD\u03B1\u03BC\u03AD\u03BD\u03B5\u03C4\u03B1\u03B9 ']'.
parser.cc.6=\u03A4\u03BF '[' \u03B4\u03B5\u03BD \u03B5\u03AF\u03BD\u03B1\u03B9 \u03AD\u03B3\u03BA\u03C5\u03C1\u03BF \u03C3\u03B5 \u03BC\u03B9\u03B1 \u03BA\u03BB\u03AC\u03C3\u03B7 \u03C7\u03B1\u03C1\u03B1\u03BA\u03C4\u03AE\u03C1\u03C9\u03BD.  \u0393\u03C1\u03AC\u03C8\u03C4\u03B5 '\\['.
parser.cc.7=\u03A4\u03BF ']' \u03B4\u03B5\u03BD \u03B5\u03AF\u03BD\u03B1\u03B9 \u03AD\u03B3\u03BA\u03C5\u03C1\u03BF \u03C3\u03B5 \u03BC\u03B9\u03B1 \u03BA\u03BB\u03AC\u03C3\u03B7 \u03C7\u03B1\u03C1\u03B1\u03BA\u03C4\u03AE\u03C1\u03C9\u03BD.  \u0393\u03C1\u03AC\u03C8\u03C4\u03B5 '\\]'.
parser.cc.8=\u03A4\u03BF '-' \u03B4\u03B5\u03BD \u03B5\u03AF\u03BD\u03B1\u03B9 \u03AD\u03B3\u03BA\u03C5\u03C1\u03B7 \u03C0\u03B5\u03C1\u03B9\u03BF\u03C7\u03AE \u03C4\u03B9\u03BC\u03CE\u03BD \u03C7\u03B1\u03C1\u03B1\u03BA\u03C4\u03AE\u03C1\u03C9\u03BD. \u0393\u03C1\u03AC\u03C8\u03C4\u03B5 '\\-'.
parser.ope.1=\u0391\u03BD\u03B1\u03BC\u03AD\u03BD\u03B5\u03C4\u03B1\u03B9 '['.
parser.ope.2=\u0391\u03BD\u03B1\u03BC\u03AD\u03BD\u03B5\u03C4\u03B1\u03B9 ')' \u03AE '-[' \u03AE '+[' \u03AE '&['.
parser.ope.3=\u03A4\u03BF \u03C3\u03B7\u03BC\u03B5\u03AF\u03BF \u03BA\u03CE\u03B4\u03B9\u03BA\u03B1 \u03BB\u03AE\u03BE\u03B7\u03C2 \u03C4\u03B7\u03C2 \u03C0\u03B5\u03C1\u03B9\u03BF\u03C7\u03AE\u03C2 \u03C4\u03B9\u03BC\u03CE\u03BD \u03B5\u03AF\u03BD\u03B1\u03B9 \u03BC\u03B9\u03BA\u03C1\u03CC\u03C4\u03B5\u03C1\u03BF \u03B1\u03C0\u03CC \u03C4\u03BF \u03C3\u03B7\u03BC\u03B5\u03AF\u03BF \u03AD\u03BD\u03B1\u03C1\u03BE\u03B7\u03C2 \u03BA\u03CE\u03B4\u03B9\u03BA\u03B1.
parser.descape.1=\u039C\u03B7 \u03AD\u03B3\u03BA\u03C5\u03C1\u03B7 \u03C3\u03B7\u03BC\u03B5\u03B9\u03BF\u03B3\u03C1\u03B1\u03C6\u03AF\u03B1 \u03B4\u03B5\u03BA\u03B1\u03B5\u03BE\u03B1\u03B4\u03B9\u03BA\u03BF\u03CD Unicode.
parser.descape.2=\u03A5\u03C0\u03B5\u03C1\u03C7\u03B5\u03AF\u03BB\u03B9\u03C3\u03B7 \u03C3\u03B5 \u03BC\u03B9\u03B1 \u03B4\u03B5\u03BA\u03B1\u03B5\u03BE\u03B1\u03B4\u03B9\u03BA\u03AE \u03C3\u03B7\u03BC\u03B5\u03B9\u03BF\u03B3\u03C1\u03B1\u03C6\u03AF\u03B1.
parser.descape.3=\u03A4\u03BF '\\x{' \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03BA\u03BB\u03B5\u03AF\u03BD\u03B5\u03B9 \u03BC\u03B5 '}'.
parser.descape.4=\u039C\u03B7 \u03AD\u03B3\u03BA\u03C5\u03C1\u03BF \u03C3\u03B7\u03BC\u03B5\u03AF\u03BF \u03BA\u03CE\u03B4\u03B9\u03BA\u03B1 Unicode.
parser.descape.5=\u0394\u03B5\u03BD \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03C5\u03C0\u03AC\u03C1\u03C7\u03B5\u03B9 \u03B1\u03B3\u03BA\u03CD\u03C1\u03C9\u03C3\u03B7 \u03C3\u03B5 \u03B1\u03C5\u03C4\u03CC \u03C4\u03BF \u03C3\u03B7\u03BC\u03B5\u03AF\u03BF.
parser.process.1=\u0391\u03C5\u03C4\u03AE \u03B7 \u03AD\u03BA\u03C6\u03C1\u03B1\u03C3\u03B7 \u03B4\u03B5\u03BD \u03C5\u03C0\u03BF\u03C3\u03C4\u03B7\u03C1\u03AF\u03B6\u03B5\u03C4\u03B1\u03B9 \u03C3\u03C4\u03BF \u03C4\u03C1\u03AD\u03C7\u03BF\u03BD \u03C0\u03B5\u03C1\u03B9\u03B2\u03AC\u03BB\u03BB\u03BF\u03BD \u03B5\u03C0\u03B9\u03BB\u03BF\u03B3\u03CE\u03BD.
parser.quantifier.1=\u039C\u03B7 \u03AD\u03B3\u03BA\u03C5\u03C1\u03BF\u03C2 \u03C4\u03B5\u03BB\u03B5\u03C3\u03C4\u03AE\u03C2 \u03C0\u03BF\u03C3\u03BF\u03C4\u03B9\u03BA\u03BF\u03C0\u03BF\u03AF\u03B7\u03C3\u03B7\u03C2 \u0391\u03BD\u03B1\u03BC\u03AD\u03BD\u03B5\u03C4\u03B1\u03B9 \u03C8\u03B7\u03C6\u03AF\u03BF.
parser.quantifier.2=\u039C\u03B7 \u03AD\u03B3\u03BA\u03C5\u03C1\u03BF\u03C2 \u03C4\u03B5\u03BB\u03B5\u03C3\u03C4\u03AE\u03C2 \u03C0\u03BF\u03C3\u03BF\u03C4\u03B9\u03BA\u03BF\u03C0\u03BF\u03AF\u03B7\u03C3\u03B7\u03C2 \u039C\u03B7 \u03AD\u03B3\u03BA\u03C5\u03C1\u03B7 \u03C0\u03BF\u03C3\u03CC\u03C4\u03B7\u03C4\u03B1 \u03AE \u03BB\u03B5\u03AF\u03C0\u03B5\u03B9 \u03AD\u03BD\u03B1 '}'.
parser.quantifier.3=\u039C\u03B7 \u03AD\u03B3\u03BA\u03C5\u03C1\u03BF\u03C2 \u03C4\u03B5\u03BB\u03B5\u03C3\u03C4\u03AE\u03C2 \u03C0\u03BF\u03C3\u03BF\u03C4\u03B9\u03BA\u03BF\u03C0\u03BF\u03AF\u03B7\u03C3\u03B7\u03C2 \u0391\u03BD\u03B1\u03BC\u03AD\u03BD\u03B5\u03C4\u03B1\u03B9 \u03C8\u03B7\u03C6\u03AF\u03BF \u03AE '}'.
parser.quantifier.4=\u039C\u03B7 \u03AD\u03B3\u03BA\u03C5\u03C1\u03BF\u03C2 \u03C4\u03B5\u03BB\u03B5\u03C3\u03C4\u03AE\u03C2 \u03C0\u03BF\u03C3\u03BF\u03C4\u03B9\u03BA\u03BF\u03C0\u03BF\u03AF\u03B7\u03C3\u03B7\u03C2 \u0397 \u03B5\u03BB\u03AC\u03C7\u03B9\u03C3\u03C4\u03B7 \u03C0\u03BF\u03C3\u03CC\u03C4\u03B7\u03C4\u03B1 \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03B5\u03AF\u03BD\u03B1\u03B9 <= \u03C4\u03B7 \u03BC\u03AD\u03B3\u03B9\u03C3\u03C4\u03B7 \u03C0\u03BF\u03C3\u03CC\u03C4\u03B7\u03C4\u03B1.
parser.quantifier.5=\u039C\u03B7 \u03AD\u03B3\u03BA\u03C5\u03C1\u03BF\u03C2 \u03C4\u03B5\u03BB\u03B5\u03C3\u03C4\u03AE\u03C2 \u03C0\u03BF\u03C3\u03BF\u03C4\u03B9\u03BA\u03BF\u03C0\u03BF\u03AF\u03B7\u03C3\u03B7\u03C2 \u03A5\u03C0\u03B5\u03C1\u03C7\u03B5\u03AF\u03BB\u03B9\u03C3\u03B7 \u03C4\u03B9\u03BC\u03AE\u03C2 \u03C0\u03BF\u03C3\u03CC\u03C4\u03B7\u03C4\u03B1\u03C2.
